
<!DOCTYPE HTML>
<html lang="ko" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>개괄: 기업에서의 오픈소스 · 기업에서의 오픈소스</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="이민석 外">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="04-why-are-companies-and-governments-turning-to-open-source.html" />
    
    
    <link rel="prev" href="01-preface.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="검색어 입력" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-acknowledgments.html">
            
                <a href="00-acknowledgments.html">
            
                    
                    감사의 글
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-preface.html">
            
                <a href="01-preface.html">
            
                    
                    역자 서문
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="03-open-source-in-the-enteprise.html">
            
                <a href="03-open-source-in-the-enteprise.html">
            
                    
                    개괄: 기업에서의 오픈소스
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                <a href="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                    
                    왜 기업과 정부는 오픈소스로 전환하는가?
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05-more-than-a-license-or-even-code.html">
            
                <a href="05-more-than-a-license-or-even-code.html">
            
                    
                    저작권이나 심지어 코드보다 더 중요한 것
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06-groundworks-for-understanding-open-source.html">
            
                <a href="06-groundworks-for-understanding-open-source.html">
            
                    
                    오픈소스를 이해하기 위한 기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07-adopting-and-using-open-source-code.html">
            
                <a href="07-adopting-and-using-open-source-code.html">
            
                    
                    오픈소스 코드의 도입과 사용
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08-participating-in-a-projects-community.html">
            
                <a href="08-participating-in-a-projects-community.html">
            
                    
                    프로젝트 커뮤니티에의 참여
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09-contributing-to-open-source-project.html">
            
                <a href="09-contributing-to-open-source-project.html">
            
                    
                    오픈소스 프로젝트에 기여하기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-launching-an-open-source-project.html">
            
                <a href="10-launching-an-open-source-project.html">
            
                    
                    오픈소스 프로젝트의 시작
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-open-source-and-the-cloud.html">
            
                <a href="11-open-source-and-the-cloud.html">
            
                    
                    오픈소스와 클라우드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-conclusion.html">
            
                <a href="12-conclusion.html">
            
                    
                    결어
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-about-authors.html">
            
                <a href="13-about-authors.html">
            
                    
                    저자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-translators.html">
            
                <a href="14-translators.html">
            
                    
                    역자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="15-links.html">
            
                <a href="15-links.html">
            
                    
                    외부 링크
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="../GLOSSARY.html">
            
                <a href="../GLOSSARY.html">
            
                    
                    용어 사전
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBook에 게시
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >개괄: 기업에서의 오픈소스</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#xFEFF;### Open Source in the Enterprise</p>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC; : &#xD64D;&#xC2B9;&#xD658;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h3 id="&#xC5D4;&#xD130;&#xD504;&#xB77C;&#xC774;&#xC988;&#xC5D0;&#xC11C;&#xC758;-&#xC624;&#xD508;&#xC18C;&#xC2A4;">&#xC5D4;&#xD130;&#xD504;&#xB77C;&#xC774;&#xC988;&#xC5D0;&#xC11C;&#xC758; &#xC624;&#xD508;&#xC18C;&#xC2A4;</h3>
<p>Free and open source software is everywhere, frequently taking over entire fields of computing. </p>
<p>&#xC790;&#xC720; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC640; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xC5B4;&#xB514;&#xC5D0;&#xB098; &#xC788;&#xACE0;, &#xCEF4;&#xD4E8;&#xD305; &#xBD84;&#xC57C; &#xC804;&#xCCB4;&#xC5D0; &#xAC78;&#xCCD0;&#xC11C; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><a href="https://www.linuxfoundation.org/" target="_blank">GNU/Linux</a> is now the most common operating system, powering data centers and controlling Android devices around the world.</p>
<p><a href="https://www.linuxfoundation.org/" target="_blank">GNU/Linux</a>&#xB294; &#xC9C0;&#xAE08; &#xAC00;&#xC7A5; &#xB110;&#xB9AC; &#xC4F0;&#xC774;&#xB294; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC774;&#xBA70;, &#xC804;&#xC138;&#xACC4;&#xC5D0; &#xC788;&#xB294; &#xB370;&#xC774;&#xD130; &#xC13C;&#xD130;&#xB97C; &#xC6C0;&#xC9C1;&#xC774;&#xACE0; Android &#xAE30;&#xAE30;&#xB4E4;&#xC744; &#xC81C;&#xC5B4;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Apache <a href="http://hadoop.apache.org/" target="_blank">Hadoop</a> and its follow-on open source technologies brought the big data revolution to a wide range of organizations, whereas <a href="https://www.docker.com/" target="_blank">Docker</a> and <a href="https://kubernetes.io/" target="_blank">Kubernetes</a> underpin microservices-based cloud computing, and artificial intelligence (AI) has over&#x2010;whelmingly become the province of open source technologies such as <a href="https://www.tensorflow.org/" target="_blank">TensorFlow</a> and Apache <a href="https://mxnet.apache.org/" target="_blank">MXNet</a>.</p>
<p>Apache <a href="http://hadoop.apache.org/" target="_blank">Hadoop</a>&#xACFC; &#xB9C8;&#xC774;&#xD06C;&#xB85C; &#xC11C;&#xBE44;&#xC2A4; &#xAE30;&#xBC18; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xCEF4;&#xD4E8;&#xD305;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xB294; <a href="https://www.docker.com/" target="_blank">Docker</a>&#xB098; <a href="https://kubernetes.io/" target="_blank">Kubernetes</a>&#xC640; &#xAC19;&#xC740; &#xD6C4;&#xC18D; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xAE30;&#xC220;&#xB4E4;&#xC740; &#xC5EC;&#xB7EC; &#xBD84;&#xC57C;&#xC758; &#xC870;&#xC9C1;&#xB4E4;&#xC5D0; &#xBE45;&#xB370;&#xC774;&#xD130; &#xD601;&#xBA85;&#xC744; &#xBD88;&#xB7EC;&#xC77C;&#xC73C;&#xCF30;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xC778;&#xACF5;&#xC9C0;&#xB2A5;(AI) &#xBD84;&#xC57C;&#xB294; <a href="https://www.tensorflow.org/" target="_blank">TensorFlow</a>&#xC640; Apache <a href="https://mxnet.apache.org/" target="_blank">MXNet</a>&#xACFC; &#xAC19;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xAE30;&#xC220;&#xB4E4;&#xC744; &#xD1B5;&#xD574; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC9C4;&#xC601;&#xC758; &#xC555;&#xB3C4;&#xC801;&#xC778; &#xC8FC;&#xC5ED;&#xC774; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>The major players in computing such as Amazon, Apple, Facebook, Google, Huawei, IBM, Intel, Microsoft, PayPal, Red Hat, and Twitter have launched and maintain open source projects, and they&#x2019;re not doing it out of altruism. </p>
<p>Amazon, Apple, Facebook, Google, Huawei, IBM, Intel, Microsoft, PayPal, Red Hat, &#xADF8;&#xB9AC;&#xACE0; Twitter&#xC640; &#xAC19;&#xC740; &#xCEF4;&#xD4E8;&#xD305; &#xC5C5;&#xACC4;&#xC758; &#xC8FC;&#xC694; &#xAE30;&#xC5C5;&#xB4E4;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB4E4;&#xC744; &#xB9CC;&#xB4E4;&#xACE0; &#xC720;&#xC9C0;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xADF8;&#xB4E4;&#xC740; &#xADF8; &#xAE30;&#xC220;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xC0AC;&#xB791;&#xD558;&#xB294; &#xB9C8;&#xC74C;&#xC73C;&#xB85C; &#xC190;&#xD574;&#xB97C; &#xAC10;&#xC218;&#xD558;&#xBA74;&#xC11C; &#xADF8; &#xC791;&#xC5C5;&#xC744; &#xD558;&#xACE0; &#xC788;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;.</p>
<p>Every business and government involved with digital transformation or with building services in the cloud is consuming open source software because it&#x2019;s good for business and for their mission.</p>
<p>&#xC804;&#xC0B0;&#xD654; &#xB610;&#xB294; &#xD074;&#xB77C;&#xC6B0;&#xB4DC;&#xC5D0;&#xC11C;&#xC758; &#xC11C;&#xBE44;&#xC2A4; &#xAD6C;&#xCD95;&#xACFC; &#xAD00;&#xB828;&#xC788;&#xB294; &#xBAA8;&#xB4E0; &#xC0AC;&#xC5C5; &#xBC0F; &#xC815;&#xBD80;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xADF8; &#xC774;&#xC720;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xADF8;&#xB4E4;&#xC758; &#xBAA9;&#xC801;&#xACFC; &#xBE44;&#xC988;&#xB2C8;&#xC2A4;&#xC5D0; &#xC801;&#xD569;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>It is time for organizations of every size and in every field to include free and open source software in their strategies.</p>
<p>&#xC774;&#xC81C;&#xB294; &#xC870;&#xC9C1;&#xC758; &#xBD84;&#xC57C;&#xC640; &#xD06C;&#xAE30;&#xC5D0; &#xC0C1;&#xAD00;&#xC5C6;&#xC774; &#xADF8;&#xB4E4;&#xC758; &#xC804;&#xB7B5;&#xC5D0; &#xC790;&#xC720; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC640; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xD3EC;&#xD568;&#xD574;&#xC57C; &#xD560; &#xB54C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>This book summarizes decades of lessons from open source communities to present a contemporary view of the trend.</p>
<p>&#xC774; &#xCC45;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB85C;&#xBD80;&#xD130; &#xC5BB;&#xC5B4;&#xC9C4; &#xC218;&#xC2ED; &#xB144;&#xAC04;&#xC758; &#xAD50;&#xD6C8;&#xC744; &#xC694;&#xC57D;&#xD558;&#xC5EC; &#xC9C0;&#xAE08;&#xC758; &#xC5C5;&#xACC4; &#xB3D9;&#xD5A5;&#xC5D0; &#xB300;&#xD55C; &#xD604;&#xB300;&#xC801;&#xC778; &#xAD00;&#xC810;&#xC744; &#xC81C;&#xC2DC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>We&#x2019;ll help you effectively use the software, contribute to it, and even launch an open source project of your own.</p>
<p>&#xC6B0;&#xB9AC;&#xB294; &#xB2F9;&#xC2E0;&#xC774; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xADF8;&#xC5D0; &#xAE30;&#xC5EC;&#xD558;&#xBA70; &#xB2F9;&#xC2E0; &#xC790;&#xC2E0;&#xC758; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2DC;&#xC791;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB3C4;&#xC6B8; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Not only do companies get better software by utilizing open source, but the dynamics of working in that community-based fashion opens up new channels for creativity and collaboration within these companies.</p>
<p>&#xAE30;&#xC5C5;&#xB4E4;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xB354; &#xB098;&#xC740; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB97C; &#xC911;&#xC2EC;&#xC5D0; &#xB460;&#xC73C;&#xB85C;&#xC368; &#xC5BB;&#xC5B4;&#xC9C0;&#xB294; &#xC5ED;&#xB3D9;&#xC131;&#xC744; &#xD1B5;&#xD574; &#xCC3D;&#xC758;&#xC131;&#xACFC; &#xD611;&#xC5C5;&#xC744; &#xC704;&#xD55C; &#xC0C8;&#xB85C;&#xC6B4; &#xD1B5;&#xB85C;&#xB97C; &#xAC1C;&#xCC99;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Conversely, institutions that fail to engage with open source will fall behind those that use it effectively.</p>
<p>&#xC774;&#xC640; &#xBC18;&#xB300;&#xB85C;, &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB97C; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xAE30;&#xAD00;&#xB4E4;&#xC740; &#xC774;&#xB97C; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAE30;&#xAD00;&#xB4E4;&#xC5D0; &#xBE44;&#xD574; &#xB4A4;&#xCC98;&#xC9C8; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Finally, it&#x2019;s worth mentioning that trade secrets and confidential business plans can coexist with open source engagement. </p>
<p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C;, &#xC601;&#xC5C5; &#xBE44;&#xBC00;&#xACFC; &#xBE44;&#xBC00;&#xC2A4;&#xB7EC;&#xC6B4; &#xC0AC;&#xC5C5; &#xACC4;&#xD68D;&#xB4E4;&#xC774; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCC38;&#xC5EC;&#xC640; &#xACF5;&#xC874;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xC5B8;&#xAE09;&#xD560; &#xAC00;&#xCE58;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>If even the <a href="https://thehackernews.com/2017/06/nsa-github-projects.html" target="_blank">US National Security Agency</a> and <a href="https://github.com/gchq" target="_blank">UK Government Communications Headquarters</a> can use open source software, you can, too.</p>
<p>&#xC2EC;&#xC9C0;&#xC5B4; <a href="https://thehackernews.com/2017/06/nsa-github-projects.html" target="_blank">&#xBBF8;&#xAD6D; &#xAD6D;&#xAC00;&#xC548;&#xBCF4;&#xAD6D;</a>&#xACFC; <a href="https://github.com/gchq" target="_blank">&#xC601;&#xAD6D; &#xC815;&#xBD80;&#xD1B5;&#xC2E0;&#xBCF8;&#xBD80;</a>&#xC870;&#xCC28;&#xB3C4; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC73C;&#xB2C8;, &#xB2F9;&#xC2E0;&#xB3C4; &#xADF8;&#xB807;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="01-preface.html" class="navigation navigation-prev " aria-label="Previous page: 역자 서문">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="04-why-are-companies-and-governments-turning-to-open-source.html" class="navigation navigation-next " aria-label="Next page: 왜 기업과 정부는 오픈소스로 전환하는가?">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"개괄: 기업에서의 오픈소스","level":"1.4","depth":1,"next":{"title":"왜 기업과 정부는 오픈소스로 전환하는가?","level":"1.5","depth":1,"path":"src/04-why-are-companies-and-governments-turning-to-open-source.md","ref":"src/04-why-are-companies-and-governments-turning-to-open-source.md","articles":[]},"previous":{"title":"역자 서문","level":"1.3","depth":1,"path":"src/01-preface.md","ref":"src/01-preface.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"이민석 外","pdf.fontSize":14,"pdf.fontFamily":"NanumGothic","pdf.paperSize":"a5","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"기업에서의 오픈소스","language":"ko","gitbook":"*","description":"Zaheda Bhorat, Andy Oram의 저서 'Open Source in the Enterprise'의 한글 번역본. https://aws.amazon.com/opensource/enterprise-oss-book/","pdf.pageNumbers":true},"file":{"path":"src/03-open-source-in-the-enteprise.md","mtime":"2019-01-03T08:27:03.907Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-03T08:28:29.523Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

