
<!DOCTYPE HTML>
<html lang="ko" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>왜 기업과 정부는 오픈소스로 전환하는가? · 기업에서의 오픈소스</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="이민석 外">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="05-more-than-a-license-or-even-code.html" />
    
    
    <link rel="prev" href="03-open-source-in-the-enteprise.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="검색어 입력" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-acknowledgments.html">
            
                <a href="00-acknowledgments.html">
            
                    
                    감사의 글
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-preface.html">
            
                <a href="01-preface.html">
            
                    
                    역자 서문
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03-open-source-in-the-enteprise.html">
            
                <a href="03-open-source-in-the-enteprise.html">
            
                    
                    개괄: 기업에서의 오픈소스
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                <a href="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                    
                    왜 기업과 정부는 오픈소스로 전환하는가?
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05-more-than-a-license-or-even-code.html">
            
                <a href="05-more-than-a-license-or-even-code.html">
            
                    
                    저작권이나 심지어 코드보다 더 중요한 것
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06-groundworks-for-understanding-open-source.html">
            
                <a href="06-groundworks-for-understanding-open-source.html">
            
                    
                    오픈소스를 이해하기 위한 기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07-adopting-and-using-open-source-code.html">
            
                <a href="07-adopting-and-using-open-source-code.html">
            
                    
                    오픈소스 코드의 도입과 사용
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08-participating-in-a-projects-community.html">
            
                <a href="08-participating-in-a-projects-community.html">
            
                    
                    프로젝트 커뮤니티에의 참여
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09-contributing-to-open-source-project.html">
            
                <a href="09-contributing-to-open-source-project.html">
            
                    
                    오픈소스 프로젝트에 기여하기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-launching-an-open-source-project.html">
            
                <a href="10-launching-an-open-source-project.html">
            
                    
                    오픈소스 프로젝트의 시작
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-open-source-and-the-cloud.html">
            
                <a href="11-open-source-and-the-cloud.html">
            
                    
                    오픈소스와 클라우드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-conclusion.html">
            
                <a href="12-conclusion.html">
            
                    
                    결어
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-about-authors.html">
            
                <a href="13-about-authors.html">
            
                    
                    저자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-translators.html">
            
                <a href="14-translators.html">
            
                    
                    역자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="15-links.html">
            
                <a href="15-links.html">
            
                    
                    외부 링크
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="../GLOSSARY.html">
            
                <a href="../GLOSSARY.html">
            
                    
                    용어 사전
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBook에 게시
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >왜 기업과 정부는 오픈소스로 전환하는가?</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#xFEFF;### Why Are Companies and Governments Turning to Open Source?</p>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC; : &#xD64D;&#xC2B9;&#xD658;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h3 id="&#xC65C;-&#xD68C;&#xC0AC;&#xC640;-&#xC815;&#xBD80;&#xB4E4;&#xC774;-&#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB85C;-&#xC804;&#xD658;&#xD558;&#xB294;&#xAC00;">&#xC65C; &#xD68C;&#xC0AC;&#xC640; &#xC815;&#xBD80;&#xB4E4;&#xC774; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB85C; &#xC804;&#xD658;&#xD558;&#xB294;&#xAC00;?</h3>
<p>There are solid business reasons for using, supporting, and creating open source software.</p>
<p>&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xC0AC;&#xC6A9;&#xACFC; &#xC9C0;&#xC6D0; &#xBC0F; &#xC0DD;&#xC131;&#xC5D0; &#xB300;&#xD55C; &#xD655;&#xC2E4;&#xD55C; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xCE21;&#xBA74;&#xC758; &#xC774;&#xC720;&#xB4E4;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Benefits include the following:</p>
<p>&#xADF8;&#xB85C; &#xC778;&#xD574; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB294; &#xC774;&#xC775;&#xB4E4;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<p><em>Multiplying the company&#x2019;s investment</em></p>
<p><strong>&#xD68C;&#xC0AC;&#xC5D0; &#xB300;&#xD55C; &#xD22C;&#xC790;&#xAC00; &#xBC30;&#xAC00;&#xB428;</strong></p>
<p>Open source benefits from the <a href="https://quoteinvestigator.com/2018/01/28/smartest/" target="_blank">famous principle</a>: &#x201C;The smartest people in every field are never in your own company.&#x201D;</p>
<p>&#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC758; &#xC774;&#xC775;&#xC744; &#xBCF4;&#xC5EC;&#xC8FC;&#xB294; <a href="https://quoteinvestigator.com/2018/01/28/smartest/" target="_blank">&#xC720;&#xBA85;&#xD55C; &#xC6D0;&#xCE59;</a>&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;: &quot;&#xC5B4;&#xB5A4; &#xBD84;&#xC57C;&#xC5D0;&#xC11C;&#xB4E0; &#xADF8; &#xC911; &#xAC00;&#xC7A5; &#xB611;&#xB611;&#xD55C; &#xC0AC;&#xB78C;&#xC740; &#xB2F9;&#xC2E0;&#xC758; &#xD68C;&#xC0AC;&#xC5D0; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.&quot;</p>
<p>At best, an ecosystem of innovation will grow up around an open project.</p>
<p>&#xAE30;&#xAECF;&#xD574;&#xC57C; &#xD601;&#xC2E0;&#xC758; &#xC0DD;&#xD0DC;&#xACC4;&#xB294; &#xAC1C;&#xBC29;&#xD615; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xC131;&#xC7A5;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Evidence that opening a project pays off financially comes from a recent <a href="https://opendri.org/wp-content/uploads/2017/03/OpenDRI-and-GeoNode-a-Case-Study-on-Institutional-Investments-in-Open-Source.pdf" target="_blank">report prepared under World Bank auspices</a>.</p>
<p><a href="https://opendri.org/wp-content/uploads/2017/03/OpenDRI-and-GeoNode-a-Case-Study-on-Institutional-Investments-in-Open-Source.pdf" target="_blank">&#xC138;&#xACC4; &#xC740;&#xD589;(World Bank)&#xC758; &#xD6C4;&#xC6D0;&#xC73C;&#xB85C; &#xC791;&#xC131;&#xB41C; &#xCD5C;&#xADFC; &#xBCF4;&#xACE0;&#xC11C;</a>&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC5EC;&#xB294; &#xAC83;&#xC774; &#xC7AC;&#xC815;&#xC801;&#xC73C;&#xB85C; &#xB3C4;&#xC6C0;&#xC774; &#xB41C;&#xB2E4;&#xB294; &#xC99D;&#xAC70;&#xB97C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Careful tracing of contributions to their project &#x2014;- a form of geospatial software called <a href="http://geonode.org/" target="_blank">GeoNode</a> -- showed that the World Bank&#x2019;s subsidiary had invested about one million dollars in the project but had benefited from an estimated two million dollars invested by other organizations.</p>
<p>&#xADF8;&#xB4E4;&#xC758; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC778; <a href="http://geonode.org/" target="_blank">GeoNode</a>&#xB77C;&#xB294; &#xC9C0;&#xD615; &#xACF5;&#xAC04;&#xC5D0; &#xAD00;&#xB828;&#xB41C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xAE30;&#xC5EC;&#xB97C; &#xC8FC;&#xC758; &#xAE4A;&#xAC8C; &#xCD94;&#xC801;&#xD55C; &#xACB0;&#xACFC;, &#xC138;&#xACC4; &#xC740;&#xD589;&#xC758; &#xC790;&#xD68C;&#xC0AC;&#xB294; &#xADF8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xC57D; &#xBC31;&#xB9CC; &#xB2EC;&#xB7EC;&#xB97C; &#xD22C;&#xC790;&#xD588;&#xC9C0;&#xB9CC; &#xB2E4;&#xB978; &#xC870;&#xC9C1;&#xB4E4;&#xC758; &#xD22C;&#xC790;&#xB85C; &#xB418;&#xB824; 2&#xBC31;&#xB9CC; &#xB2EC;&#xB7EC;&#xC758; &#xC774;&#xC775;&#xC744; &#xC5BB;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><em>Benefiting from the most recent advances</em></p>
<p><strong>&#xCD5C;&#xC2E0; &#xAE30;&#xC220;&#xB85C;&#xBD80;&#xD130;&#xC758; &#xC774;&#xC775;</strong></p>
<p>The AI projects mentioned in the introduction are a good example.</p>
<p>&#xB3C4;&#xC785;&#xBD80;&#xC5D0;&#xC11C; &#xC774;&#xC57C;&#xAE30;&#xD588;&#xB358; &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xB9E4;&#xC6B0; &#xC88B;&#xC740; &#xC608;&#xC2DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Your data scientists will want implementations of the best and most up-to-date algorithms, and these implementations will usually be open source.</p>
<p>&#xB2F9;&#xC2E0;&#xC758; &#xB370;&#xC774;&#xD130; &#xACFC;&#xD559;&#xC790;&#xB4E4;&#xC740; &#xCD5C;&#xACE0;&#xC758;, &#xAC00;&#xC7A5; &#xCD5C;&#xC2E0;&#xC778; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC5D0; &#xB300;&#xD55C; &#xAD6C;&#xD604;&#xCCB4;&#xB97C; &#xC6D0;&#xD560; &#xAC83;&#xC774;&#xBA70;, &#xADF8;&#xAC83;&#xB4E4;&#xC740; &#xB300;&#xBD80;&#xBD84; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC77C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>There is no need to reinvent the wheel in-house.</p>
<p>&#xB2F9;&#xC2E0;&#xC758; &#xD68C;&#xC0AC; &#xC548;&#xC5D0;&#xC11C; &#xADF8;&#xAC83;&#xB4E4;&#xC744; &#xB2E4;&#xC2DC; &#xAC1C;&#xBC1C;&#xD560; &#xD544;&#xC694;&#xB294; &#xC804;&#xD600; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Furthermore, your company can innovate more quickly by using tools and existing code that you can get with a simple download and installation process.</p>
<p>&#xB098;&#xC544;&#xAC00;, &#xB2F9;&#xC2E0;&#xC758; &#xD68C;&#xC0AC;&#xB294; &#xAC04;&#xB2E8;&#xD55C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xC640; &#xC124;&#xCE58; &#xACFC;&#xC815;&#xC744; &#xD1B5;&#xD574; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB294; &#xB3C4;&#xAD6C;&#xB4E4;&#xACFC; &#xC774;&#xBBF8; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xB4E4;&#xC744; &#xD1B5;&#xD574; &#xB354;&#xC6B1; &#xBE60;&#xB974;&#xAC8C; &#xD601;&#xC2E0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><em>Spreading knowledge of the software</em></p>
<p><strong>&#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xC9C0;&#xC2DD;&#xC758; &#xC804;&#xD30C;</strong></p>
<p>When the code is open and especially when a robust community grows up around it adoption is broader.</p>
<p>&#xCF54;&#xB4DC;&#xAC00; &#xACF5;&#xAC1C;&#xB418;&#xC5B4; &#xC788;&#xC744; &#xB54C;, &#xD2B9;&#xD788; &#xADF8; &#xCF54;&#xB4DC;&#xB97C; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xD2BC;&#xD2BC;&#xD55C; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xAC00; &#xC131;&#xC7A5;&#xD588;&#xC744; &#xB54C; &#xADF8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xB354; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>This initially takes effort on the company&#x2019;s part, but it leads to more people throughout the industry understanding the code and the contribution process.</p>
<p>&#xC774;&#xAC83;&#xC740; &#xADFC;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xD68C;&#xC0AC;&#xC758; &#xB178;&#xB825;&#xC774; &#xB4E4;&#xC5B4;&#xAC00;&#xC57C; &#xD558;&#xC9C0;&#xB9CC;, &#xC5C5;&#xACC4;&#xC758; &#xB354; &#xB9CE;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xCF54;&#xB4DC;&#xC640; &#xAE30;&#xC5EC; &#xACFC;&#xC815;&#xC744; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC774;&#xB04C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><em>Increasing the developer base</em></p>
<p><strong>&#xAC1C;&#xBC1C;&#xC790; &#xC778;&#xC7AC;&#xD480;&#xC758; &#xC99D;&#xAC00;</strong></p>
<p>Broader adoption, along with wide discussion of the source code, translates into a larger pool of talented developers from which the company can hire to work on the code and related projects.</p>
<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xC5D0; &#xB300;&#xD55C; &#xC5EC;&#xB7EC; &#xD1A0;&#xB860;&#xB4E4;&#xACFC; &#xD568;&#xAED8; &#xB354; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xB41C;&#xB2E4;&#xBA74;, &#xD68C;&#xC0AC;&#xC5D0; &#xACE0;&#xC6A9;&#xB418;&#xC5B4; &#xCF54;&#xB4DC;&#xC640; &#xADF8;&#xC5D0; &#xAD00;&#xB828;&#xB41C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C; &#xC77C;&#xD560; &#xC218; &#xC788;&#xB294; &#xC7AC;&#xB2A5;&#xC788;&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC774; &#xD3EC;&#xD568;&#xB41C; &#xD070; &#xC778;&#xC7AC;&#xD480;&#xC744; &#xC5BB;&#xB294; &#xAC83;&#xACFC; &#xB2E4;&#xB984;&#xC774; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><em>Upgrading internal developer skills</em></p>
<p><strong>&#xD68C;&#xC0AC;&#xC5D0; &#xC18C;&#xC18D;&#xB41C; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC758; &#xB2A5;&#xB825; &#xD5A5;&#xC0C1;</strong></p>
<p>The spread of knowledge goes in many directions.</p>
<p>&#xC9C0;&#xC2DD;&#xC758; &#xC804;&#xD30C;&#xB294; &#xB9CE;&#xC740; &#xBC29;&#xD5A5;&#xC73C;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p>Developers already recognize that the best way to learn good coding skills is to work on an open source project because they can study the practices of the top coders in the field.</p>
<p>&#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xD6CC;&#xB96D;&#xD55C; &#xCF54;&#xB529; &#xB2A5;&#xB825;&#xC744; &#xBC30;&#xC6B0;&#xB294; &#xAC00;&#xC7A5; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC774; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xB294; &#xAC83;&#xC784;&#xC744; &#xC774;&#xBBF8; &#xC54C;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xCC38;&#xC5EC;&#xB97C; &#xD1B5;&#xD574; &#xADF8; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xC798;&#xD558;&#xB294; &#xCF54;&#xB354;&#xB4E4;&#xC758; &#xCF54;&#xB4DC;&#xB4E4;&#xC744; &#xBCF4;&#xACE0; &#xBC30;&#xC6B8; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>These benefits spread to the company that employs the open source developers.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC774;&#xC775;&#xB4E4;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC744; &#xACE0;&#xC6A9;&#xD558;&#xB294; &#xD68C;&#xC0AC;&#xC5D0; &#xD37C;&#xC9C0;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><em>Building reputation</em></p>
<p><strong>&#xD68C;&#xC0AC;&#xC5D0; &#xB300;&#xD55C; &#xD3C9;&#xD310;&#xC758; &#xD5A5;&#xC0C1;</strong></p>
<p>Most people want to work for organizations they can boast about.</p>
<p>&#xB300;&#xBD80;&#xBD84;&#xC758; &#xC0AC;&#xB78C;&#xB4E4;&#xC740; &#xC790;&#xB791;&#xD560; &#xB9CC;&#xD55C; &#xC870;&#xC9C1;&#xC5D0;&#xC11C; &#xC77C;&#xD558;&#xACE0; &#xC2F6;&#xC5B4;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Adopting open source -- both the code and the practices that go with it -- shows that your organization is cool.</p>
<p>&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xCF54;&#xB4DC;&#xC640; &#xAD00;&#xD589;&#xB4E4;&#xC744; &#xCC44;&#xD0DD;&#xD558;&#xB294; &#xAC83;&#xC740; &#xB2F9;&#xC2E0;&#xC758; &#xC870;&#xC9C1;&#xC774; &#xB9E4;&#xC6B0; &#xBA4B;&#xC9C0;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>And if you can release your own code as open source and win adoption for it, you prove that your organization is a leader in your field, adept at the best development practices.</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xB9CC;&#xC57D; &#xB2F9;&#xC2E0;&#xC774; &#xB2F9;&#xC2E0;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB85C; &#xBC30;&#xD3EC;&#xD588;&#xACE0; &#xADF8;&#xAC83;&#xB4E4; &#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xCC44;&#xD0DD;&#xD588;&#xB2E4;&#xBA74;, &#xB2F9;&#xC2E0;&#xC740; &#xB2F9;&#xC2E0;&#xC758; &#xC870;&#xC9C1;&#xC774; &#xADF8; &#xBD84;&#xC57C;&#xC758; &#xB9AC;&#xB354; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70; &#xCD5C;&#xACE0;&#xC758; &#xAC1C;&#xBC1C; &#xAD00;&#xD589;&#xC5D0; &#xC775;&#xC219;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC99D;&#xBA85;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><em>Recruiting and retaining developers</em></p>
<p><strong>&#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC758; &#xACE0;&#xC6A9;&#xACFC; &#xC720;&#xC9C0;</strong></p>
<p>Good developers want to work on exciting projects that affect large groups of people.</p>
<p>&#xD6CC;&#xB96D;&#xD55C; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xB9CE;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC8C; &#xC601;&#xD5A5;&#xC744; &#xB07C;&#xCE58;&#xB294; &#xC7AC;&#xBBF8;&#xC788;&#xB294; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C; &#xC77C;&#xD558;&#xACE0; &#xC2F6;&#xC5B4;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>They also want their skills and contributions to be widely recognized, and they enjoy the interactions they can have with peers around the world.</p>
<p>&#xB610;&#xD55C; &#xADF8;&#xB4E4;&#xC740; &#xADF8;&#xB4E4;&#xC758; &#xB2A5;&#xB825;&#xACFC; &#xAE30;&#xC5EC;&#xB4E4;&#xC774; &#xB110;&#xB9AC; &#xC54C;&#xB824;&#xC9C0;&#xAE30;&#xB97C; &#xBC14;&#xB77C;&#xBA70;, &#xC804;&#xC138;&#xACC4;&#xC5D0; &#xC788;&#xB294; &#xB3D9;&#xB8CC;&#xB4E4;&#xACFC; &#xC758;&#xACAC;&#xC744; &#xAD50;&#xD658;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC990;&#xAE41;&#xB2C8;&#xB2E4;.</p>
<p>All these considerations lead them to gravitate toward open source projects, and if your competitors are more successful than you in supporting such projects, developers will bring their talents and reputations to those companies instead of yours.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xBAA8;&#xB4E0; &#xACE0;&#xBBFC;&#xB4E4;&#xC740; &#xADF8;&#xB4E4;&#xC774; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC5D0; &#xB04C;&#xB9AC;&#xB3C4;&#xB85D; &#xC720;&#xB3C4;&#xD558;&#xBA70;, &#xB9CC;&#xC57D; &#xB2F9;&#xC2E0;&#xC758; &#xACBD;&#xC7C1;&#xC0AC;&#xB4E4;&#xC774; &#xC5B4;&#xB5A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xB2F9;&#xC2E0;&#xBCF4;&#xB2E4; &#xB354; &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xC9C0;&#xC6D0;&#xD558;&#xC600;&#xB2E4;&#xBA74; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xB2F9;&#xC2E0;&#xC758; &#xD68C;&#xC0AC; &#xB300;&#xC2E0; &#xB2F9;&#xC2E0;&#xC758; &#xACBD;&#xC7C1;&#xC0AC;&#xC5D0; &#xADF8;&#xB4E4;&#xC758; &#xC7AC;&#xB2A5;&#xACFC; &#xBA85;&#xC131;&#xB4E4;&#xC744; &#xC3DF;&#xC744; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><em>Faster startup of new companies and projects</em>
<strong>&#xC0C8;&#xB85C;&#xC6B4; &#xD68C;&#xC0AC;&#xC640; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xBE60;&#xB978; &#xC2DC;&#xC791;</strong></p>
<p>In the frenetic pace of today&#x2019;s social and business environments, a startup or new division needs to go from concept to product in months, not years.</p>
<p>&#xC624;&#xB298;&#xB0A0;&#xC758; &#xC0AC;&#xD68C; &#xBC0F; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xD658;&#xACBD;&#xC758; &#xC5F4;&#xAD11;&#xC801;&#xC778; &#xC18D;&#xB3C4;&#xC5D0;&#xC11C; &#xC2E0;&#xC0DD; &#xAE30;&#xC5C5; &#xB610;&#xB294; &#xC2E0;&#xADDC; &#xC0AC;&#xC5C5;&#xBD80;&#xB294; &#xC218; &#xB144;&#xC774; &#xC544;&#xB2CC; &#xC218; &#xAC1C;&#xC6D4; &#xB9CC;&#xC5D0; &#xCEE8;&#xC149;&#xC744; &#xC81C;&#xD488;&#xC73C;&#xB85C; &#xBC14;&#xAFB8;&#xC5B4;&#xB0B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Working with a community, both on existing software and on your own innovations, saves you time and lets you focus limited employee time on critical competitive parts of your product.</p>
<p>&#xC774;&#xBBF8; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC640; &#xB2F9;&#xC2E0;&#xC758; &#xD601;&#xC2E0;&#xC5D0; &#xB300;&#xD55C; &#xBD80;&#xBD84;&#xC744; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC640; &#xD568;&#xAED8;&#xD55C;&#xB2E4;&#xBA74;, &#xB2F9;&#xC2E0;&#xC758; &#xC2DC;&#xAC04;&#xC744; &#xC544;&#xAEF4;&#xC904; &#xAC83;&#xC774;&#xBA70; &#xC81C;&#xD488;&#xC758; &#xC911;&#xC694;&#xD55C; &#xACBD;&#xC7C1;&#xB825; &#xC788;&#xB294; &#xBD80;&#xBD84;&#xC5D0; &#xD55C;&#xC815;&#xB41C; &#xC9C1;&#xBB34; &#xC2DC;&#xAC04;&#xC744; &#xC9D1;&#xC911;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><a href="https://www.csis.org/analysis/government-open-source-policies" target="_blank">Many governments</a> have launched major open source policies and initiatives. </p>
<p><a href="https://www.csis.org/analysis/government-open-source-policies" target="_blank">&#xB9CE;&#xC740; &#xC815;&#xBD80;&#xB4E4;</a>&#xC740; &#xADF8;&#xB4E4;&#xC758; &#xC8FC;&#xC694; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC815;&#xCC45;&#xACFC; &#xC774;&#xB2C8;&#xC154;&#xD2F0;&#xBE0C;&#xB4E4;&#xC744; &#xBC1C;&#xC871;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>As <a href="http://circulaire.legifrance.gouv.fr/pdf/2012/09/cir_35837.pdf" target="_blank">France</a> and the <a href="https://code.gov/" target="_blank">United States</a> demonstrate, we are now seeing a shift from the use of open source to policies that encourage the development of open source and investment in open source communities.</p>
<p><a href="http://circulaire.legifrance.gouv.fr/pdf/2012/09/cir_35837.pdf" target="_blank">&#xD504;&#xB791;&#xC2A4;</a>&#xC640; <a href="https://code.gov/" target="_blank">&#xBBF8;&#xAD6D;</a>&#xC774; &#xBCF4;&#xC5EC;&#xC8FC;&#xC5C8;&#xB4EF;, &#xC6B0;&#xB9AC;&#xB294; &#xC815;&#xCC45; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC5D0; &#xADF8;&#xCE58;&#xC9C0; &#xC54A;&#xACE0; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xAC1C;&#xBC1C;&#xACFC; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC5D0; &#xB300;&#xD55C; &#xD22C;&#xC790;&#xB97C; &#xB3C5;&#xB824;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C;&#xC758; &#xBCC0;&#xD654;&#xB97C; &#xBCF4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Some have committed to an &#x201C;open source first&#x201D; strategy, requiring vendors as well as internal developers to use open source licenses and practices wherever possible.</p>
<p>&#xC77C;&#xBD80;&#xB294; &#xC11C;&#xBE44;&#xC2A4; &#xC81C;&#xACF5;&#xC790;&#xB4E4;&#xACFC; &#xB0B4;&#xBD80; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC5D0;&#xAC8C; &#xC5B4;&#xB290; &#xACF3;&#xC774;&#xB4E0; &#xAC00;&#xB2A5;&#xD55C; &#xACF3;&#xC5D0;&#xC11C;&#xBD80;&#xD130; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xC640; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xAC1C;&#xBC1C; &#xBC29;&#xBC95;&#xB860;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xAD8C;&#xC7A5;&#xD558;&#xB294; &quot;&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xBA3C;&#xC800; (open source first)&quot; &#xC804;&#xB7B5;&#xC744; &#xBCF4;&#xC5EC;&#xC8FC;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>For example, the government of France has stated that all agencies must do future code work in open source.</p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xD504;&#xB791;&#xC2A4; &#xC815;&#xBD80;&#xB294; &#xBAA8;&#xB4E0; &#xAE30;&#xAD00;&#xC774; &#xC774;&#xD6C4;&#xC758; &#xCF54;&#xB4DC;&#xC5D0; &#xAD00;&#xB828;&#xB41C; &#xC77C;&#xB4E4;&#xC744; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB85C; &#xD574;&#xC57C;&#xB9CC; &#xD55C;&#xB2E4;&#xACE0; &#xBA85;&#xC2DC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>With such policies, agencies can revise obsolete, expensive, slow procurement practices that have been notorious for causing failed software projects and outrageous cost overruns.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC815;&#xCC45;&#xB4E4;&#xACFC; &#xD568;&#xAED8;, &#xAE30;&#xAD00;&#xB4E4;&#xC740; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xC2E4;&#xD328;&#xC640; &#xD130;&#xBB34;&#xB2C8;&#xC5C6;&#xB294; &#xC608;&#xC0B0; &#xCD08;&#xACFC;&#xC758; &#xC6D0;&#xC778;&#xC778; &#xC545;&#xBA85; &#xB192;&#xC740; &#xC4F8;&#xBAA8;&#xC5C6;&#xACE0; &#xBE44;&#xC2F8;&#xBA70; &#xB290;&#xB9AC;&#xAC8C; &#xC870;&#xB2EC;&#xB418;&#xB294; &#xAD00;&#xC2B5;&#xC744; &#xBC14;&#xAFC0; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>For governments, open source becomes a staging ground for the latest, more responsive software practices that have proven more efficient and productive in other sectors.</p>
<p>&#xC815;&#xBD80;&#xB4E4;&#xC5D0;&#xAC8C; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB294; &#xB2E4;&#xB978; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC774;&#xACE0; &#xC0DD;&#xC0B0;&#xC131;&#xC788;&#xB294; &#xAC83;&#xC774; &#xC99D;&#xBA85;&#xB41C;, &#xCD5C;&#xC2E0;&#xC758; &#xBCF4;&#xB2E4; &#xBBFC;&#xAC10;&#xD55C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xAC1C;&#xBC1C; &#xBC29;&#xBC95;&#xB860;&#xB4E4;&#xC758; &#xC2DC;&#xC791;&#xC810;&#xC774; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Furthermore, governments are realizing that each agency&#x2019;s needs are similar to other agencies, around the nation and around the world.</p>
<p>&#xB098;&#xC544;&#xAC00;, &#xC815;&#xBD80;&#xB4E4;&#xC740; &#xAD6D;&#xAC00;&#xC640; &#xC138;&#xACC4;&#xB97C; &#xC544;&#xC6B8;&#xB7EC; &#xAC01; &#xAE30;&#xAD00;&#xC774; &#xAC00;&#xC9C4; &#xD544;&#xC694;&#xAC00; &#xB2E4;&#xB978; &#xAE30;&#xAD00;&#xB4E4;&#xACFC; &#xC11C;&#xB85C; &#xBE44;&#xC2B7;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xAE68;&#xB2EB;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Open source means, at least, that the investment made by one agency can save money for all the rest and, at best, that the agencies will share requirements and collaborate in the classic open source manner to create software that helps governments better serve their citizens everywhere.</p>
<p>&#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB294; &#xCD5C;&#xC18C;&#xD55C; &#xD55C; &#xAE30;&#xAD00;&#xC5D0; &#xC758;&#xD574; &#xC774;&#xB8E8;&#xC5B4;&#xC9C4; &#xD22C;&#xC790;&#xAC00; &#xC804;&#xBD80;&#xC758; &#xC608;&#xC0B0;&#xC744; &#xC544;&#xB084; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xB098;&#xC544;&#xAC00; &#xAE30;&#xAD00;&#xB4E4;&#xC774; &#xADF8;&#xB4E4;&#xC758; &#xD544;&#xC694;&#xC131;&#xC744; &#xACF5;&#xC720;&#xD558;&#xACE0; &#xC804;&#xD1B5;&#xC801;&#xC778; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xAC1C;&#xBC1C; &#xBC29;&#xC2DD;&#xC744; &#xD1B5;&#xD574; &#xD611;&#xB825;&#xD558;&#xBA70; &#xC815;&#xBD80;&#xAC00; &#xADF8;&#xB4E4;&#xC758; &#xC2DC;&#xBBFC;&#xB4E4;&#xC744; &#xC704;&#xD574; &#xBD09;&#xC0AC;&#xD558;&#xB294; &#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC8FC;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xAC1C;&#xBC1C;&#xD558;&#xB294; &#xAC83;&#xC744; &#xB73B;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Open source collaboration also opens opportunities for smaller companies, citizen developers, and nonprofits to contribute to innovation in government services. </p>
<p>&#xB610;&#xD55C; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC5D0;&#xC11C;&#xC758; &#xD611;&#xB825;&#xC740; &#xC791;&#xC740; &#xD68C;&#xC0AC;&#xB4E4;&#xACFC; &#xC2DC;&#xBBFC; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;, &#xADF8;&#xB9AC;&#xACE0; &#xBE44;&#xC601;&#xB9AC; &#xB2E8;&#xCCB4;&#xB4E4;&#xC5D0;&#xAC8C; &#xC815;&#xBD80; &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xD601;&#xC2E0;&#xC5D0; &#xAE30;&#xC5EC;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xD68C;&#xB97C; &#xC5F4;&#xC5B4;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>Finally, the software creates a common standard that fosters interoperability for many kinds of development.</p>
<p>&#xACB0;&#xAD6D;, &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xC885;&#xB958;&#xC758; &#xAC1C;&#xBC1C;&#xC5D0;&#xC11C; &#xC0C1;&#xD638; &#xC774;&#xC6A9;&#xC131;&#xC744; &#xD0A4;&#xC6B0;&#xB294; &#xACF5;&#xD1B5;&#xC801;&#xC778; &#xD45C;&#xC900;&#xC744; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="03-open-source-in-the-enteprise.html" class="navigation navigation-prev " aria-label="Previous page: 개괄: 기업에서의 오픈소스">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="05-more-than-a-license-or-even-code.html" class="navigation navigation-next " aria-label="Next page: 저작권이나 심지어 코드보다 더 중요한 것">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"왜 기업과 정부는 오픈소스로 전환하는가?","level":"1.5","depth":1,"next":{"title":"저작권이나 심지어 코드보다 더 중요한 것","level":"1.6","depth":1,"path":"src/05-more-than-a-license-or-even-code.md","ref":"src/05-more-than-a-license-or-even-code.md","articles":[]},"previous":{"title":"개괄: 기업에서의 오픈소스","level":"1.4","depth":1,"path":"src/03-open-source-in-the-enteprise.md","ref":"src/03-open-source-in-the-enteprise.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"이민석 外","pdf.fontSize":14,"pdf.fontFamily":"NanumGothic","pdf.paperSize":"a5","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"기업에서의 오픈소스","language":"ko","gitbook":"*","description":"Zaheda Bhorat, Andy Oram의 저서 'Open Source in the Enterprise'의 한글 번역본. https://aws.amazon.com/opensource/enterprise-oss-book/","pdf.pageNumbers":true},"file":{"path":"src/04-why-are-companies-and-governments-turning-to-open-source.md","mtime":"2019-01-03T08:27:03.907Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-03T08:28:29.523Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

