
<!DOCTYPE HTML>
<html lang="ko" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>오픈소스를 이해하기 위한 기초 · 기업에서의 오픈소스</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="이민석 外">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="07-adopting-and-using-open-source-code.html" />
    
    
    <link rel="prev" href="05-more-than-a-license-or-even-code.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="검색어 입력" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-acknowledgments.html">
            
                <a href="00-acknowledgments.html">
            
                    
                    감사의 글
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-preface.html">
            
                <a href="01-preface.html">
            
                    
                    역자 서문
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03-open-source-in-the-enteprise.html">
            
                <a href="03-open-source-in-the-enteprise.html">
            
                    
                    개괄: 기업에서의 오픈소스
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                <a href="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                    
                    왜 기업과 정부는 오픈소스로 전환하는가?
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05-more-than-a-license-or-even-code.html">
            
                <a href="05-more-than-a-license-or-even-code.html">
            
                    
                    저작권이나 심지어 코드보다 더 중요한 것
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="06-groundworks-for-understanding-open-source.html">
            
                <a href="06-groundworks-for-understanding-open-source.html">
            
                    
                    오픈소스를 이해하기 위한 기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07-adopting-and-using-open-source-code.html">
            
                <a href="07-adopting-and-using-open-source-code.html">
            
                    
                    오픈소스 코드의 도입과 사용
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08-participating-in-a-projects-community.html">
            
                <a href="08-participating-in-a-projects-community.html">
            
                    
                    프로젝트 커뮤니티에의 참여
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09-contributing-to-open-source-project.html">
            
                <a href="09-contributing-to-open-source-project.html">
            
                    
                    오픈소스 프로젝트에 기여하기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-launching-an-open-source-project.html">
            
                <a href="10-launching-an-open-source-project.html">
            
                    
                    오픈소스 프로젝트의 시작
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-open-source-and-the-cloud.html">
            
                <a href="11-open-source-and-the-cloud.html">
            
                    
                    오픈소스와 클라우드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-conclusion.html">
            
                <a href="12-conclusion.html">
            
                    
                    결어
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-about-authors.html">
            
                <a href="13-about-authors.html">
            
                    
                    저자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-translators.html">
            
                <a href="14-translators.html">
            
                    
                    역자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="15-links.html">
            
                <a href="15-links.html">
            
                    
                    외부 링크
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="../GLOSSARY.html">
            
                <a href="../GLOSSARY.html">
            
                    
                    용어 사전
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBook에 게시
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >오픈소스를 이해하기 위한 기초</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#xFEFF;### Groundwork for Understanding Open Source</p>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h3 id="&#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB97C;-&#xC774;&#xD574;&#xD558;&#xAE30;-&#xC704;&#xD55C;-&#xAE30;&#xCD08;">&#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB97C; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xAE30;&#xCD08;</h3>
<p>Before discussing open source software from three angles&#x2014;how to adopt software developed elsewhere, how to contribute to a project, and how to launch a project of your own&#x2014;let&#x2019;s quickly try to dispel a few myths:</p>
<p>&#xC774;&#xBBF8; &#xAC1C;&#xBC1C;&#xB41C; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xCC44;&#xD0DD;&#xD558;&#xB294; &#xBC29;&#xBC95;, &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xAE30;&#xC5EC;&#xD558;&#xB294; &#xBC29;&#xBC95; &#xBC0F; &#xC790;&#xC2E0;&#xC758; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xB4F1; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC124;&#xBA85;&#xD558;&#xAE30;&#xC5D0; &#xC55E;&#xC11C; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xBA87;&#xBA87; &#xC624;&#xD574;&#xB97C; &#xD480;&#xC5B4; &#xBCF4;&#xACE0;&#xC790; &#xD55C;&#xB2E4;.</p>
<p><em>Open source software is low quality or less secure</em></p>
<p>Now that major companies are involved in open source, this myth is not cited so often, but it persists in attitudes that often go unstated. People accustomed to typical procurement processes have trouble believing that something distributed without cost can be high quality. In fact, open source projects have replaced the need to charge for licenses through a number of other funding strategies. But the key issue is that strong open source projects adopt strict quality processes, which your organization can also adopt for your own benefit. As for security, flaws occur in both open source and closed software. Neither is guaranteed to avoid breaches. Experience suggests that transparency and a large development community in open source lead to faster fixes and faster distribution of the fixed software.</p>
<p><strong>&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xD488;&#xC9C8;&#xC774; &#xB0AE;&#xAC70;&#xB098; &#xBCF4;&#xC548;&#xC131;&#xC774; &#xB5A8;&#xC5B4;&#xC9C4;&#xB2E4;.</strong></p>
<p>&#xCD5C;&#xADFC;&#xB4E4;&#xC5B4; &#xC8FC;&#xC694; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xAE30;&#xC5C5;&#xB4E4;&#xC774; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xBA74;&#xC11C; &#xC774;&#xAC19;&#xC740; &#xC624;&#xD574;&#xAC00; &#xB35C; &#xC5B8;&#xAE09;&#xB418;&#xACE0;&#xB294; &#xC788;&#xC9C0;&#xB9CC;, &#xAF2D; &#xC9C1;&#xC811; &#xC5B8;&#xAE09;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xB354;&#xB3C4; &#xC544;&#xC9C1;&#xB3C4; &#xC774;&#xAC19;&#xC740; &#xC0DD;&#xAC01;&#xC744; &#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xC788;&#xB2E4;. &#xC0C1;&#xC6A9; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xAD6C;&#xB9E4;&#xC5D0; &#xC775;&#xC219;&#xD55C; &#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC8C;&#xB294; &#xBE44;&#xC6A9;&#xC744; &#xB4E4;&#xC774;&#xC9C0; &#xC54A;&#xACE0; &#xBD84;&#xC0B0;&#xD558;&#xC5EC; &#xAC1C;&#xBC1C;&#xD55C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xB192;&#xC740; &#xD488;&#xC9C8;&#xC744; &#xBCF4;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xBBFF;&#xAE30; &#xC5B4;&#xB824;&#xC6B8; &#xAC83;&#xC774;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC2E4;&#xC81C;&#xB85C; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xC5EC;&#xB7EC; &#xBC29;&#xBC95;&#xC758; &#xC790;&#xAE08; &#xC9C0;&#xC6D0; &#xC804;&#xB7B5;&#xC744; &#xD1B5;&#xD574; &#xB77C;&#xC774;&#xC120;&#xC2A4; &#xBE44;&#xC6A9;&#xC744; &#xB300;&#xCCB4;&#xD588;&#xB2E4;. &#xD575;&#xC2EC;&#xC740; &#xC5C4;&#xACA9;&#xD55C; &#xD488;&#xC9C8; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xCC44;&#xD0DD;&#xD558;&#xC5EC; &#xACE0;&#xD488;&#xC9C8;&#xC758; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xADF8; &#xACB0;&#xACFC; &#xACE0;&#xAC1D;&#xC758; &#xD3B8;&#xC758;&#xB97C; &#xB3C4;&#xBAA8;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xBCF4;&#xC548;&#xC5D0; &#xB300;&#xD55C; &#xACB0;&#xD568;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC640; &#xC18C;&#xC2A4;&#xAC00; &#xACF5;&#xAC1C;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xBAA8;&#xB450;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xBA70;, &#xC5B4;&#xB290; &#xB204;&#xAD6C;&#xB3C4; &#xC774;&#xB97C; &#xD53C;&#xD560; &#xC218; &#xC5C6;&#xB2E4;. &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC758; &#xD22C;&#xBA85;&#xC131;&#xACFC; &#xD070; &#xADDC;&#xBAA8;&#xC758; &#xAC1C;&#xBC1C; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xAC00; &#xBCF4;&#xC548;&#xBB38;&#xC81C;&#xC5D0; &#xB300;&#xD55C; &#xBCF4;&#xB2E4; &#xC2E0;&#xC18D;&#xD55C; &#xC218;&#xC815;&#xACFC; &#xC218;&#xC815;&#xB41C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xBC30;&#xD3EC;&#xB85C; &#xC774;&#xC5B4;&#xC84C;&#xC5C8;&#xB2E4;.</p>
<p><em>Open source software lacks support</em></p>
<p>Popular open source projects have many sources of technical support from both organizations and individuals. The open code is a great advantage because you are not locked into a single company for support. Smaller and younger projects might not have yet developed this ecosystem of support, so getting support here might require you to devote more developer time and draw on informal help from the community. Likely enough, you will stumble over a critical bug that requires immediate attention someday, and you will be thankful that you can apply your own developers or a hire a developer to fix the bug instead of waiting for an indifferent vendor&#x2019;s fix.</p>
<p><strong>&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xACE0;&#xAC1D; &#xC9C0;&#xC6D0;&#xC774; &#xBD80;&#xC871;&#xD558;&#xB2E4;.</strong></p>
<p>&#xB300;&#xC911;&#xC801;&#xC778; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xC870;&#xC9C1;&#xACFC; &#xAC1C;&#xC778;&#xB4E4;&#xB85C;&#xBD80;&#xD130; &#xAE30;&#xC220; &#xC9C0;&#xC6D0;&#xC744; &#xBC1B;&#xACE0; &#xC788;&#xB2E4;. &#xC9C0;&#xC6D0;&#xC774; &#xD55C; &#xD68C;&#xC0AC;&#xC5D0; &#xC885;&#xC18D;&#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xC810;&#xC774; &#xCF54;&#xB4DC;&#xAC00; &#xC624;&#xD508;&#xB41C; &#xAC83;&#xC758; &#xC7A5;&#xC810;&#xC774;&#xB2E4;. &#xB354; &#xC791;&#xACE0; &#xC624;&#xB798;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xC544;&#xC9C1; &#xC9C0;&#xC6D0; &#xC0DD;&#xD0DC;&#xACC4; &#xAC1C;&#xBC1C;&#xC774; &#xCDA9;&#xBD84;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xC218; &#xC788;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC758; &#xB354; &#xB9CE;&#xC740; &#xAC1C;&#xBC1C; &#xC2DC;&#xAC04; &#xD560;&#xC560;&#xC640; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB85C;&#xBD80;&#xD130; &#xBE44;&#xACF5;&#xC2DD;&#xC801;&#xC778; &#xB3C4;&#xC6C0;&#xC774; &#xD544;&#xC694;&#xD558;&#xB2E4;. &#xC544;&#xB9C8;&#xB3C4; &#xC5B8;&#xC820;&#xAC00; &#xC989;&#xC2DC; &#xC218;&#xC815;&#xC774; &#xD544;&#xC694;&#xD55C; &#xCE58;&#xBA85;&#xC801;&#xC778; &#xBC84;&#xADF8;&#xB97C; &#xB9CC;&#xB0AC;&#xC744; &#xB54C;, &#xBB34;&#xAD00;&#xC2EC;&#xD55C; &#xBCA4;&#xB354;&#xC758; &#xC9C0;&#xC6D0;&#xC744; &#xAE30;&#xB2E4;&#xB9AC;&#xC9C0; &#xC54A;&#xACE0; &#xB0B4;&#xBD80; &#xAC1C;&#xBC1C;&#xC790;&#xC5D0; &#xC694;&#xCCAD;&#xD558;&#xC5EC; &#xC218;&#xC815;&#xD558;&#xAC70;&#xB098; &#xAC1C;&#xBC1C;&#xC790;&#xB97C; &#xC544;&#xC6C3;&#xC18C;&#xC2F1;&#xD558;&#xC5EC; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<p><em>Open source software projects are unmanaged and chaotic and free for the taking</em></p>
<p>As you will see through the course of this book, successful open source projects have well-defined processes for decision-making, review of code, and dealing with users like your organization. You must follow certain rules when you use code developed by others. The code almost always has a license, but with different rules from proprietary code. If one of your developers copies code found on the internet into your own products, you will almost certainly be violating a license, and it&#x2019;s a bad practice for legal and other reasons. These points receive more discussion at the Open Source Initiative and Software Freedom Conservancy. Later sections of this book explain current practices for accepting open source code into your organization.</p>
<p><strong>&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xAD00;&#xB9AC;&#xB418;&#xC9C0; &#xC54A;&#xACE0; &#xD63C;&#xB780;&#xC2A4;&#xB7FD;&#xACE0; &#xBB34;&#xB8CC;&#xC774;&#xB2E4;.</strong></p>
<p>&#xC774; &#xCC45;&#xC744; &#xD1B5;&#xD574; &#xC54C; &#xC218; &#xC788;&#xB4EF;&#xC774; &#xC131;&#xACF5;&#xC801;&#xC778; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB4E4;&#xC740; &#xC758;&#xC0AC; &#xACB0;&#xC815;, &#xCF54;&#xB4DC; &#xB9AC;&#xBDF0; &#xBC0F; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0; &#xB300;&#xD55C; &#xB300;&#xC751; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xBCF4;&#xD1B5;&#xC758; &#xC870;&#xC9C1;&#xB4E4;&#xACFC; &#xAC19;&#xC774; &#xC798; &#xC815;&#xC758;&#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xAC1C;&#xBC1C;&#xD55C; &#xCF54;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C;&#xB294; &#xD2B9;&#xC815; &#xADDC;&#xCE59;&#xC744; &#xB530;&#xB77C;&#xC57C; &#xD55C;&#xB2E4;. &#xCF54;&#xB4DC;&#xC5D0;&#xB294; &#xAC70;&#xC758; &#xD56D;&#xC0C1; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xAC00; &#xC788;&#xC9C0;&#xB9CC; &#xB3C5;&#xC810;&#xC801;&#xC778; &#xCF54;&#xB4DC;&#xC640;&#xB294; &#xB2E4;&#xB978; &#xADDC;&#xCE59;&#xC774;&#xB2E4;. &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xC778;&#xD130;&#xB137;&#xC5D0; &#xC788;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xC790;&#xC2E0;&#xC758; &#xC81C;&#xD488;&#xC5D0; &#xBCF5;&#xC0AC;&#xD558;&#xBA74; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xB97C; &#xC704;&#xBC18;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAC70;&#xC758; &#xD655;&#xC2E4;&#xD558;&#xBA70; &#xBC95;&#xC801; &#xB610;&#xB294; &#xB2E4;&#xB978; &#xC774;&#xC720;&#xB85C; &#xB098;&#xC05C; &#xAD00;&#xD589;&#xC778; &#xAC83;&#xC774;&#xB2E4;. &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC774;&#xB2C8;&#xC154;&#xD2F0;&#xBE0C; (Open Source Initiative)&#xC640; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC790;&#xC720; &#xBCF4;&#xD638; &#xD611;&#xD68C; (Software Freedom Conservancy)&#xC5D0;&#xC11C; &#xC774;&#xC5D0; &#xB300;&#xD558;&#xC5EC; &#xB9CE;&#xC740; &#xD1A0;&#xB860;&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;. &#xB2E4;&#xC74C; &#xC139;&#xC158;&#xB4E4;&#xC5D0;&#xC11C; &#xB2F9;&#xC2E0;&#xC758; &#xC870;&#xC9C1;&#xC5D0; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xC218;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xBA87;&#xAC00;&#xC9C0; &#xD604;&#xC7AC; &#xC9C4;&#xD589; &#xC911;&#xC778; &#xC0AC;&#xB840;&#xB4E4;&#xC5D0; &#xB300;&#xD574; &#xC124;&#xBA85;&#xD558;&#xB824;&#xACE0; &#xD55C;&#xB2E4;.</p>
<p><em>Using open source software requires you to open your code</em></p>
<p>This is something of a reverse of the previous myth. Certainly, you need to be aware of what the license requires before you use open source software. Some licenses have rules for contributing back changes you make, and as you&#x2019;ll see later, you benefit by doing so. (These licenses are sometimes called &#x201C;viral,&#x201D; but their users dislike the negative connotations of that word; &#x201C;copy&#x2010; left&#x201D; is a more neutral term.) Most open source projects, even those with rules for contributing back code, are distributed as libraries that you can link into your own code without opening the functions you write yourself (for instance, the GNU Lesser General Public License).</p>
<p><strong>&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB824;&#xBA74; &#xCF54;&#xB4DC;&#xB97C; &#xACF5;&#xAC1C;&#xD558;&#xC5EC;&#xC57C; &#xD55C;&#xB2E4;.</strong></p>
<p>&#xC774;&#xB294; &#xC55E;&#xC758; &#xC624;&#xD574;&#xC640; &#xBC18;&#xB300;&#xB41C;&#xB2E4;. &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xC5D0; &#xD544;&#xC694;&#xD55C; &#xC0AC;&#xD56D;&#xC744; &#xD544;&#xD788; &#xC219;&#xC9C0;&#xD558;&#xC5EC;&#xC57C; &#xD55C;&#xB2E4;. &#xC77C;&#xBD80; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xC5D0;&#xB294; &#xAE30;&#xC5EC;&#xD55C; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC744; &#xBC18;&#xC601;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xADDC;&#xCE59;&#xC774; &#xC788;&#xC73C;&#xBA70;, &#xB098;&#xC911;&#xC5D0; &#xBCFC; &#xC218; &#xC788;&#xB4EF;&#xC774; &#xC774;&#xB807;&#xAC8C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xB2E4;. (&#xB54C;&#xB85C; &#xC774;&#xB7EC;&#xD55C; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xB97C; &quot;&#xBC14;&#xC774;&#xB7F4;&quot;&#xD558;&#xB2E4;&#xACE0; &#xD558;&#xC9C0;&#xB9CC; &#xD574;&#xB2F9; &#xB2E8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xBD80;&#xC815;&#xC801; &#xC758;&#xBBF8; &#xB54C;&#xBB38;&#xC5D0; &quot;&#xCE74;&#xD53C;-&#xB808;&#xD504;&#xD2B8;&quot;&#xAC00; &#xBCF4;&#xB2E4; &#xC911;&#xB9BD;&#xC801;&#xC778; &#xC6A9;&#xC5B4;&#xC774;&#xB2E4;.) &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xACBD;&#xC6B0; &#xAE30;&#xC5EC; &#xCF54;&#xB4DC;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xC5EC; &#xB300;&#xBD80;&#xBD84; &#xAC1C;&#xBC1C;&#xD55C; &#xAE30;&#xB2A5;&#xC744; &#xC9C1;&#xC811; &#xACF5;&#xAC1C;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xB300;&#xBD80;&#xBD84; &#xC790;&#xC2E0;&#xC758; &#xCF54;&#xB4DC;&#xC5D0; &#xC5F0;&#xACB0;&#xD560; &#xC218; &#xC788;&#xB294; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xD615;&#xD0DC;&#xB85C; &#xBC30;&#xD3EC;&#xD55C;&#xB2E4;.(&#xC608; : GNU Lesser General Public License).</p>
<p><em>You can gain a user base and community by releasing code on a public repository</em></p>
<p>Opening code out of laziness never works. Open source projects do have an advantage over proprietary ones in gaining adoption, but only if you treat the project as a respected element of your business strategy. Open source projects realize value only as part of an active community. In many cases, the interactions inherent in that process are in and of themselves highly valuable to participants. But open source dynamics reward ongoing investment. You&#x2019;ll see more of how to do this during the course of the book. Inactive projects produce declining benefits over time as the costs of stagnation add up.</p>
<p><strong>&#xACF5;&#xAC1C; &#xC800;&#xC7A5;&#xC18C;&#xC5D0; &#xCF54;&#xB4DC;&#xB97C; &#xACF5;&#xAC1C;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xC0AC;&#xC6A9;&#xC790; &#xAE30;&#xBC18;&#xACFC; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB97C; &#xD655;&#xBCF4;&#xD560; &#xC218; &#xC788;&#xB2E4;.</strong></p>
<p>&#xACF5;&#xAC1C;&#xB41C; &#xCF54;&#xB4DC;&#xAC00; &#xAC8C;&#xC73C;&#xB974;&#xAC8C; &#xC9C4;&#xD654;&#xB418;&#xBA74; &#xACB0;&#xCF54; &#xC791;&#xB3D9;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xC804;&#xB7B5; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xBC14;&#xB78C;&#xC9C1;&#xD55C; &#xC694;&#xC778;&#xC744; &#xC81C;&#xACF5;&#xD560; &#xB54C; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xB3C5;&#xC810;&#xC801;&#xC778; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xBCF4;&#xB2E4; &#xCC44;&#xD0DD;&#xC5D0; &#xC788;&#xC5B4;&#xC11C; &#xC720;&#xB9AC;&#xD558;&#xB2E4;. &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xD65C;&#xC131;&#xD654;&#xB41C; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xAC00; &#xC788;&#xC744; &#xB54C; &#xADF8; &#xAC00;&#xCE58;&#xAC00; &#xC2E4;&#xD604;&#xB41C;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xB9CE;&#xC740; &#xACBD;&#xC6B0;&#xC5D0;, &#xADF8; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xB0B4;&#xC7AC;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xC0C1;&#xD638; &#xC791;&#xC6A9;&#xC740; &#xADF8; &#xC790;&#xCCB4;&#xB85C; &#xCC38;&#xC5EC;&#xC790;&#xC5D0;&#xAC8C; &#xB9E4;&#xC6B0; &#xADC0;&#xC911;&#xD558;&#xB2E4;. &#xC774;&#xAC19;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC5ED;&#xD559;&#xC740; &#xC9C0;&#xC18D;&#xC801;&#xC778; &#xD22C;&#xC790;&#xB97C; &#xBCF4;&#xC0C1;&#xD55C;&#xB2E4;. &#xC774; &#xCC45;&#xC744; &#xC77D;&#xB294; &#xB3D9;&#xC548; &#xC774; &#xC810;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xC774;&#xB8E8;&#xC5B4; &#xC9C0;&#xB294;&#xAC00;&#xC5D0; &#xB300;&#xD574; &#xB354; &#xB9CE;&#xC774; &#xC54C; &#xC218; &#xC788;&#xC744; &#xAC83;&#xC774;&#xB2E4;. &#xBE44;&#xD65C;&#xC131; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xC2DC;&#xAC04;&#xC774; &#xC9C0;&#xB0A8;&#xC5D0; &#xB530;&#xB77C; &#xC815;&#xCCB4; &#xBE44;&#xC6A9;&#xC774; &#xC99D;&#xAC00;&#xD558;&#xC5EC; &#xD61C;&#xD0DD;&#xC774; &#xC904;&#xC5B4;&#xB4E0;&#xB2E4;.</p>
<p><em>An open source project will occupy all your developers&#x2019; time with support requests</em></p>
<p>In open source, you trade the time you spend on support for the contributions you get back from the community. Certainly, you must budget time for support, but your company can control how much time to put in and can pull back in order to meet deadlines on internal projects or control excessive support costs. In a successful open source community, all members engage in education, and your company is not solely responsible for providing it.</p>
<p><strong>&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xD68C;&#xC0AC;&#xC758; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC774; &#xAE30;&#xC220;&#xC9C0;&#xC6D0;&#xC744; &#xD558;&#xB294;&#xB370; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC2DC;&#xAC04;&#xC744; &#xC4F0;&#xAC8C; &#xB9CC;&#xB4E0;&#xB2E4;.</strong></p>
<p>&#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC5D0;&#xC11C;&#xB294; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC758; &#xAE30;&#xC5EC;&#xC5D0; &#xB300;&#xD55C; &#xBCF4;&#xC0C1; &#xCC28;&#xC6D0;&#xC5D0;&#xC11C; &#xAE30;&#xC220; &#xC9C0;&#xC6D0;&#xC5D0; &#xC2DC;&#xAC04;&#xC744; &#xD22C;&#xC785;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xBB3C;&#xB860; &#xC9C0;&#xC6D0;&#xC744; &#xC704;&#xD55C; &#xC2DC;&#xAC04;&#xC744; &#xBBF8;&#xB9AC; &#xC815;&#xD574;&#xB193;&#xC544;&#xC57C;&#xD558;&#xC9C0;&#xB9CC; &#xD68C;&#xC0AC;&#xAC00; &#xB0B4;&#xBD80; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xB370;&#xB4DC;&#xB77C;&#xC778;&#xC744; &#xB9DE;&#xCD94;&#xAC70;&#xB098; &#xACFC;&#xB3C4;&#xD55C; &#xC9C0;&#xC6D0; &#xBE44;&#xC6A9;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD22C;&#xC785; &#xC2DC;&#xAC04;&#xC744; &#xC870;&#xC808;&#xD558;&#xAE30;&#xB3C4; &#xD55C;&#xB2E4;. &#xC131;&#xACF5;&#xC801;&#xC778; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC5D0;&#xC11C;&#xB294; &#xBAA8;&#xB4E0; &#xD68C;&#xC6D0;&#xC774; &#xAD50;&#xC721;&#xC744; &#xD568;&#xAED8; &#xBD84;&#xB2F4;&#xD558;&#xBA70; &#xC774;&#xB97C; &#xC704;&#xD558;&#xC5EC; &#xC804;&#xC801;&#xC73C;&#xB85C; &#xD55C; &#xD68C;&#xC0AC;&#xAC00; &#xC804;&#xC801;&#xC73C;&#xB85C; &#xCC45;&#xC784;&#xC744; &#xC9C0;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;.</p>
<h4 id="terminology-free-and-open-source">Terminology: Free and Open Source</h4>
<p>The terms free and open source appear interchangeably in this book, because with negligible exceptions, everything that falls under the definition of free software also falls under the definition of open source, and vice versa. The term free soft&#x2010; ware is used by those who want to emphasize the aspects of liberty, privacy, and sharing, whereas open source is used by those who emphasize its practical and business benefits.</p>
<p>Do not use the obsolete term freeware, which used to refer to programs whose developers kept the source code closed while distributing the executable files cost free. This is not free software as currently understood. To be truly free (or open source), the source code must be available and must be under a license that allows its users to modify and redistribute it.</p>
<h4 id="&#xC6A9;&#xC5B4;-&#xD504;&#xB9AC;-&#xC624;&#xD508;-&#xC18C;&#xC2A4;">&#xC6A9;&#xC5B4;: &#xD504;&#xB9AC; &#xC624;&#xD508; &#xC18C;&#xC2A4;</h4>
<p>&#xBB34;&#xC2DC;&#xD560; &#xC218;&#xC788;&#xB294; &#xC608;&#xC678;&#xB97C; &#xC81C;&#xC678;&#xD558;&#xBA74; &#xC790;&#xC720; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xC815;&#xC758;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xAC83;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC758; &#xC815;&#xC758;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xBA70; &#xADF8; &#xBC18;&#xB300;&#xC758; &#xACBD;&#xC6B0;&#xB3C4; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC790;&#xC720; &#xBC0F; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB77C;&#xB294; &#xC6A9;&#xC5B4;&#xB97C; &#xC774; &#xCC45;&#xC5D0;&#xC11C; &#xC11C;&#xB85C; &#xBC14;&#xAFD4;&#xC5B4; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;. &#xC790;&#xC720;, &#xAC1C;&#xC778; &#xC815;&#xBCF4; &#xBC0F; &#xACF5;&#xC720;&#xC758; &#xCE21;&#xBA74;&#xC744; &#xAC15;&#xC870;&#xD558;&#xB824;&#xB294; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xC790;&#xC720; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB77C;&#xB294; &#xC6A9;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC18;&#xBA74;, &#xC2E4;&#xC6A9;&#xC801;&#xC774;&#xACE0; &#xBE44;&#xC988;&#xB2C8;&#xC2A4;&#xC801;&#xC778; &#xC774;&#xC810;&#xC744; &#xAC15;&#xC870;&#xD558;&#xB294; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB77C;&#xB294; &#xC6A9;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;.</p>
<p>&#xC2E4;&#xD589; &#xD30C;&#xC77C;&#xC744; &#xBB34;&#xB8CC;&#xB85C; &#xBC30;&#xD3EC;&#xD558;&#xC9C0;&#xB9CC;, &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xACF5;&#xAC1C;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xBD80;&#xB974;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC608;&#xC804; &#xC6A9;&#xC5B4;&#xC778; &#xD504;&#xB9AC;&#xC6E8;&#xC5B4;&#xB77C;&#xB294; &#xB9D0;&#xC744; &#xB354; &#xC774;&#xC0C1; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xB9D0;&#xC544;&#xC57C; &#xD55C;&#xB2E4;. &#xADF8;&#xAC83;&#xC740; &#xD604;&#xC7AC; &#xD1B5;&#xC6A9;&#xB418;&#xB294; &#xD504;&#xB9AC; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xC544;&#xB2C8;&#xB2E4;. &#xC9C4;&#xC815;&#xC73C;&#xB85C; &#xD504;&#xB9AC; (&#xB610;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4;)&#xAC00; &#xB418;&#xB824;&#xBA74; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xAC00; &#xACF5;&#xAC1C;&#xB418;&#xC5B4; &#xC774;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xC57C; &#xD558;&#xBA70; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xC218;&#xC815;&#xD558;&#xACE0; &#xC7AC;&#xBC30;&#xD3EC; &#xD560; &#xC218; &#xC788;&#xB294; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xAC00; &#xC788;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="05-more-than-a-license-or-even-code.html" class="navigation navigation-prev " aria-label="Previous page: 저작권이나 심지어 코드보다 더 중요한 것">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="07-adopting-and-using-open-source-code.html" class="navigation navigation-next " aria-label="Next page: 오픈소스 코드의 도입과 사용">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"오픈소스를 이해하기 위한 기초","level":"1.7","depth":1,"next":{"title":"오픈소스 코드의 도입과 사용","level":"1.8","depth":1,"path":"src/07-adopting-and-using-open-source-code.md","ref":"src/07-adopting-and-using-open-source-code.md","articles":[]},"previous":{"title":"저작권이나 심지어 코드보다 더 중요한 것","level":"1.6","depth":1,"path":"src/05-more-than-a-license-or-even-code.md","ref":"src/05-more-than-a-license-or-even-code.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"이민석 外","pdf.fontSize":14,"pdf.fontFamily":"NanumGothic","pdf.paperSize":"a5","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"기업에서의 오픈소스","language":"ko","gitbook":"*","description":"Zaheda Bhorat, Andy Oram의 저서 'Open Source in the Enterprise'의 한글 번역본. https://aws.amazon.com/opensource/enterprise-oss-book/","pdf.pageNumbers":true},"file":{"path":"src/06-groundworks-for-understanding-open-source.md","mtime":"2019-01-03T08:27:03.907Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-03T08:28:29.523Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

