
<!DOCTYPE HTML>
<html lang="ko" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>오픈소스 프로젝트에 기여하기 · 기업에서의 오픈소스</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="이민석 外">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="10-launching-an-open-source-project.html" />
    
    
    <link rel="prev" href="08-participating-in-a-projects-community.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="검색어 입력" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-acknowledgments.html">
            
                <a href="00-acknowledgments.html">
            
                    
                    감사의 글
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-preface.html">
            
                <a href="01-preface.html">
            
                    
                    역자 서문
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03-open-source-in-the-enteprise.html">
            
                <a href="03-open-source-in-the-enteprise.html">
            
                    
                    개괄: 기업에서의 오픈소스
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                <a href="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                    
                    왜 기업과 정부는 오픈소스로 전환하는가?
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05-more-than-a-license-or-even-code.html">
            
                <a href="05-more-than-a-license-or-even-code.html">
            
                    
                    저작권이나 심지어 코드보다 더 중요한 것
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06-groundworks-for-understanding-open-source.html">
            
                <a href="06-groundworks-for-understanding-open-source.html">
            
                    
                    오픈소스를 이해하기 위한 기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07-adopting-and-using-open-source-code.html">
            
                <a href="07-adopting-and-using-open-source-code.html">
            
                    
                    오픈소스 코드의 도입과 사용
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08-participating-in-a-projects-community.html">
            
                <a href="08-participating-in-a-projects-community.html">
            
                    
                    프로젝트 커뮤니티에의 참여
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="09-contributing-to-open-source-project.html">
            
                <a href="09-contributing-to-open-source-project.html">
            
                    
                    오픈소스 프로젝트에 기여하기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-launching-an-open-source-project.html">
            
                <a href="10-launching-an-open-source-project.html">
            
                    
                    오픈소스 프로젝트의 시작
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-open-source-and-the-cloud.html">
            
                <a href="11-open-source-and-the-cloud.html">
            
                    
                    오픈소스와 클라우드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-conclusion.html">
            
                <a href="12-conclusion.html">
            
                    
                    결어
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-about-authors.html">
            
                <a href="13-about-authors.html">
            
                    
                    저자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-translators.html">
            
                <a href="14-translators.html">
            
                    
                    역자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="15-links.html">
            
                <a href="15-links.html">
            
                    
                    외부 링크
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="../GLOSSARY.html">
            
                <a href="../GLOSSARY.html">
            
                    
                    용어 사전
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBook에 게시
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >오픈소스 프로젝트에 기여하기</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#xFEFF;### Contributing to Open Source Projects</p>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h3 id="&#xC624;&#xD508;&#xC18C;&#xC2A4;-&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;-&#xAE30;&#xC5EC;&#xD558;&#xAE30;">&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xAE30;&#xC5EC;&#xD558;&#xAE30;</h3>
<p>If you use open source code, you will get much more from the project by contributing back, both through code and through other 
practices such as sponsorship and donations. It makes sense to begin by creating an open source project around noncritical 
software such as a tool in your support software, a platform add-on, or a plug-in.</p>
<p>&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xBA74; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB85C;&#xB4E0; &#xC2A4;&#xD3F0;&#xC11C;&#xB098; &#xAE30;&#xBD80; &#xB4F1;&#xC758; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xADF8; &#xC624;&#xD504;&#xC18C;&#xC2A4; &#xCF54;&#xB4DC; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xAE30;&#xC5EC;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xB354; &#xB9CE;&#xC740; &#xAC83;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. 
&#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xB3C4;&#xAD6C;&#xB098; &#xD50C;&#xB7AB;&#xD3FC; &#xC560;&#xB4DC;&#xC628;, &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xACFC; &#xAC19;&#xC740; &#xC911;&#xC694;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xC624;&#xD51D; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xBCF4;&#xBA74;&#xC11C; &#xC2DC;&#xC791;&#xD574; &#xBCFC; &#xC218;
&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>This section covers making contributions to existing projects, and the next section looks at the extra steps involved in 
launching one of your own.</p>
<p>&#xC874;&#xC7AC;&#xD558;&#xB294; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xAE30;&#xC5EC;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC124;&#xBA85;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0;, &#xC774;&#xC5B4;&#xC11C; &#xC5EC;&#xB7EC;&#xBD84; &#xC790;&#xC2E0;&#xB9CC;&#xC758; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xBCF4;&#xB294; &#xACFC;&#xC815;&#xB3C4; &#xC0B4;&#xD3B4;&#xBCFC; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h4 id="establish-the-why-throughout-the-company">Establish the &#x201C;Why&#x201D; Throughout the Company</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h4 id="&#xD68C;&#xC0AC;-&#xC804;&#xBC18;&#xC5D0;-&#xAE30;&#xC5EC;&#xD574;&#xC57C;&#xD558;&#xB294;-&#xC774;&#xC720;-&#xD655;&#xB9BD;&#xD558;&#xAE30;">&#xD68C;&#xC0AC; &#xC804;&#xBC18;&#xC5D0; &#xAE30;&#xC5EC;&#xD574;&#xC57C;&#xD558;&#xB294; &quot;&#xC774;&#xC720;&quot; &#xD655;&#xB9BD;&#xD558;&#xAE30;</h4>
<p>You understand by now that adopting open source is not a matter of copy and paste but represents a serious commitment from your organization. Managers must approve the use of resources for the open source project, including the kinds of participation in the community discussed earlier. You need a story that justifies the investment of checking the code and community and then participating as community members. Thus, you need to explain clearly how the use of the code contributes to the business goals of the organization, and you need to check regularly to make sure that the local goals of the developers stay aligned with these larger goals. A <a href="https://drive.google.com/file/d/1woaZ0wjQMbLQhyfB8ZOYveh8cW-jlDPG/view" target="_blank">whitepaper</a> from Mozilla and Open Tech Strategies offers ten different overall strategies for creating and running open source projects. The variety of governance structures and motivational frameworks discussed in that paper and the impacts they have on outcomes show how important such choices are.</p>
<p>&#xC774;&#xC81C; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB97C; &#xC801;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC18C;&#xC2A4;&#xB97C; &#xADF8;&#xC800; &#xBCF5;&#xC0AC;&#xD574; &#xBD99;&#xC5EC;&#xB123;&#xAE30; &#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C;, &#xC5EC;&#xB7EC;&#xBD84;&#xC758; &#xC18D;&#xD55C; &#xC870;&#xC9C1;&#xC758; &#xC9C4;&#xC9C0;&#xD55C; &#xC758;&#xC9C0;&#xB97C; &#xC758;&#xBBF8;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC774;&#xD574;&#xD588;&#xC744; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xB9E4;&#xB2C8;&#xC800;&#xB4E4;&#xC740; &#xC55E;&#xC11C; &#xC774;&#xC57C;&#xAE30;&#xD588;&#xB358; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xAE30; &#xB4F1;&#xC758; &#xD65C;&#xB3D9;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xC5EC; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC5D0; &#xD22C;&#xC785;&#xD558;&#xB294; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xC2B9;&#xC778;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xB7EC;&#xBD84;&#xC740; &#xCF54;&#xB4DC;&#xC640; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB97C; &#xD655;&#xC778;&#xD558;&#xACE0; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAD6C;&#xC131;&#xC6D0;&#xC73C;&#xB85C;&#xC11C; &#xD558;&#xB294; &#xD65C;&#xB3D9;&#xC5D0; &#xC5EC;&#xB7EC;&#xBD84;&#xC758; &#xC790;&#xC6D0;&#xC744; &#xD22C;&#xC790;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC815;&#xB2F9;&#xD654;&#xD560; &#xB9CC; &#xD55C; &#xADFC;&#xAC70;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC624;&#xD508; &#xC18C;&#xC2A4;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC870;&#xC9C1;&#xC758; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xBAA9;&#xD45C;&#xC5D0; &#xC5B4;&#xB5BB;&#xAC8C; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xB294;&#xC9C0; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xC124;&#xBA85;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC758; &#xAC1C;&#xBCC4;&#xC801;&#xC778; &#xBAA9;&#xD45C;&#xAC00; &#xC774;&#xB7EC;&#xD55C; &#xC870;&#xC9C1;&#xC758; &#xAE30;&#xC5C5;&#xC801; &#xBAA9;&#xD45C;&#xC5D0; &#xBD80;&#xD569;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC8FC;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. Mozilla and Open Tech Strategies&#xC5D0;&#xC11C; &#xBC1C;&#xAC04;&#xD55C; <a href="https://drive.google.com/file/d/1woaZ0wjQMbLQhyfB8ZOYveh8cW-jlDPG/view" target="_blank">&#xBC31;&#xC11C;</a>&#xC5D0;&#xC11C;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xB9CC;&#xB4E4;&#xACE0; &#xC6B4;&#xC601;&#xD558;&#xB294; &#xC804;&#xBC18;&#xC5D0; &#xB300;&#xD55C; 10&#xAC00;&#xC9C0; &#xC804;&#xB7B5;&#xC774; &#xC801;&#xD600; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC31;&#xC11C;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD558;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xAC70;&#xBC84;&#xB10C;&#xC2A4; &#xAD6C;&#xC870;&#xC640; &#xB3D9;&#xAE30; &#xBD80;&#xC5EC;&#xB97C; &#xC704;&#xD55C; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB4E4; &#xADF8;&#xB9AC;&#xACE0; &#xADF8; &#xAC83;&#xB4E4;&#xC774; &#xBBF8;&#xCE5C; &#xC601;&#xD5A5;&#xC740; &#xC774;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC5BC;&#xB9C8;&#xB098; &#xC911;&#xC694;&#xD55C; &#xC9C0; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<h4 id="hire-from-the-community">Hire from the Community</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h4 id="&#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB85C;&#xBD80;&#xD130;-&#xACE0;&#xC6A9;&#xD558;&#xAE30;">&#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB85C;&#xBD80;&#xD130; &#xACE0;&#xC6A9;&#xD558;&#xAE30;</h4>
<p>A great way to jump-start your use of an existing open source project is to hire qualified contributors who are currently working on the project. Some companies recruit the leaders or key committers, paying them to work full time on the open source project. Other companies strike some kind of balance, allowing a developer to work part time on the open source code and the rest of the time integrating the code into the company or doing other company-specific projects.</p>
<p>&#xAE30;&#xC874;&#xC758; &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xB294; &#xAC00;&#xC7A5; &#xC88B;&#xC740; &#xCD9C;&#xBC1C;&#xC810;&#xC740; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xD65C;&#xBC1C;&#xD558;&#xAC8C; &#xAE30;&#xC5EC;&#xD558;&#xACE0; &#xC788;&#xB294; &#xCEE8;&#xD2B8;&#xB9AC;&#xBDF0;&#xD130;&#xB97C; &#xACE0;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xBA87;&#xBA87; &#xAE30;&#xC5C5;&#xB4E4;&#xC740; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xB9AC;&#xB354;&#xB098; &#xC911;&#xC694; &#xCEE4;&#xBBF8;&#xD130;&#xB4E4;&#xC744; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xD480; &#xD0C0;&#xC784;&#xC73C;&#xB85C; &#xC791;&#xC5C5;&#xD558;&#xB3C4;&#xB85D; &#xACE0;&#xC6A9;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xB610; &#xC5B4;&#xB5A4; &#xAE30;&#xC5C5;&#xB4E4;&#xC740; &#xC9C1;&#xC6D0;&#xB4E4;&#xC5D0;&#xAC8C; &#xC77C;&#xC815; &#xC2DC;&#xAC04;&#xC744; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC5D0; &#xAE30;&#xC5EC;&#xD558;&#xACE0; &#xADF8; &#xC678;&#xC758; &#xC2DC;&#xAC04;&#xC740; &#xD574;&#xB2F9; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB97C; &#xAE30;&#xC5C5;&#xC5D0; &#xB179;&#xC5EC;&#xB0B4;&#xB294; &#xB370;&#xC5D0; &#xC4F0;&#xAC70;&#xB098; &#xAE30;&#xC5C5; &#xB0B4;&#xBD80; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xC2DD;&#xC73C;&#xB85C; &#xADE0;&#xD615;&#xC744; &#xB9DE;&#xCD94;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>The balance between internal and open source work can be difficult to maintain because managers are always eager to get more help for internal projects and are liable to slip more and more of this work onto the developer&#x2019;s schedule. To recruit developers from the community, your company must show your sincere commitment to the project, through your business plan and your participation in the project. You might also need to review your employee contract and amend it to support developers who want to contribute to their open source projects in their own time. When developers are hired, both management and the developers themselves must stay alert and stick to the original deal about how they divide their time.</p>
<p>&#xC0AC;&#xC2E4; &#xB0B4;&#xBD80; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC640; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xADE0;&#xD615;&#xC788;&#xAC8C; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC27D;&#xC9C0; &#xC54A;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9E4;&#xB2C8;&#xC800;&#xB4E4;&#xC740; &#xC5B8;&#xC81C;&#xB098; &#xB0B4;&#xBD80; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xB354; &#xD798;&#xC744; &#xC3DF;&#xAE30;&#xB97C; &#xBC14;&#xB77C;&#xACE0; &#xC788;&#xACE0;, &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xC77C;&#xC815;&#xC5D0; &#xB354; &#xB9CE;&#xC740; &#xB0B4;&#xBD80; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC791;&#xC5C5;&#xC744; &#xB07C;&#xC6CC;&#xB123;&#xC744; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xD68C;&#xC0AC;&#xAC00; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC5D0;&#xC11C; &#xAC1C;&#xBC1C;&#xC790;&#xB97C; &#xACE0;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xACC4;&#xD68D;&#xACFC; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC2E4;&#xC81C; &#xCC38;&#xC5EC;&#xB97C; &#xD1B5;&#xD574; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xB300;&#xD55C; &#xC9C4;&#xC9C0;&#xD55C; &#xC758;&#xC9C0;&#xB97C; &#xBCF4;&#xC5EC;&#xC8FC;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC774; &#xADF8; &#xB4E4;&#xC758; &#xC2DC;&#xAC04;&#xC744; &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xD22C;&#xC790;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xACE0;&#xC6A9; &#xACC4;&#xC57D;&#xC744; &#xB2E4;&#xC2DC; &#xD655;&#xC778; &#xD558;&#xACE0; &#xC218;&#xC815;&#xD574;&#xC57C; &#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xACE0;&#xC6A9;&#xC774; &#xB418;&#xBA74; &#xAD00;&#xB9AC; &#xBD80;&#xC11C;&#xC640; &#xAC1C;&#xBC1C;&#xC790; &#xC790;&#xC2E0; &#xBAA8;&#xB450; &#xC2DC;&#xAC04;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xBD84;&#xBC30;&#xD558;&#xAE30;&#xB85C; &#xD588;&#xB294;&#xC9C0; &#xAFB8;&#xC900;&#xD788; &#xC2E0;&#xACBD;&#xC368;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>Regardless of how much time you invest in the open source project, a healthy project that you adopt for the right reasons will pay you back handsomely for the reasons stated in &quot;Why Are Companies and Governments Turning to Open Source?&quot; on page 2 earlier in the book.</p>
<p>&#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xC5BC;&#xB9CC;&#xD07C;&#xC758; &#xC2DC;&#xAC04;&#xC744; &#xB4E4;&#xC600;&#xB358;&#xC9C0; &#xC801;&#xC7AC;&#xC801;&#xC18C;&#xC5D0; &#xD65C;&#xC6A9;&#xD55C; &#xAC74;&#xAC15;&#xD55C; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB294; 4&#xC7A5;&#xC758; <a href="TODO%204&#xCC55;&#xD130;%20&#xD30C;&#xC77C;%20&#xB9C1;&#xD06C;">&#xC65C; &#xAE30;&#xC5C5;&#xACFC; &#xC815;&#xBD80;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB85C; &#xC804;&#xD658;&#xD558;&#xB294;&#xAC00;?</a>&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD588;&#xB358; &#xB300;&#xB85C; &#xC5EC;&#xB7EC;&#xBD84;&#xC5D0;&#xAC8C; &#xBC18;&#xB4DC;&#xC2DC; &#xB4DD;&#xC774; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h4 id="develop-mentoring-and-support">Develop Mentoring and Support</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h4 id="&#xBA58;&#xD1A0;&#xB9C1;&#xACFC;-&#xC9C0;&#xC6D0;-&#xB9C8;&#xB828;&#xD558;&#xAE30;">&#xBA58;&#xD1A0;&#xB9C1;&#xACFC; &#xC9C0;&#xC6D0; &#xB9C8;&#xB828;&#xD558;&#xAE30;</h4>
<p>Your employees will need training, both to work with the new code you are handing them and to join the open source project. If you don&#x2019;t already have employees comfortable with working in an open source environment&#x2014;and it&#x2019;s worth polling your developers to find out, because you might be surprised to learn that some of them have experience with open source&#x2014;it&#x2019;s worth hiring developers who do, as explained in the previous section. These developers should also mentor others, because this is a key part of bringing developer resources into open source projects, whether within the company or in the wider community. As mentioned earlier, working on open source projects is an excellent way to improve a company&#x2019;s developer skills.</p>
<p>&#xC5EC;&#xB7EC;&#xBD84; &#xD68C;&#xC0AC;&#xC758; &#xC9C1;&#xC6D0;&#xC774; &#xD68C;&#xC0AC;&#xC758; &#xC0C8;&#xB85C;&#xC6B4; &#xCF54;&#xB4DC; &#xC791;&#xC5C5;&#xACFC; &#xC624;&#xD504;&#xC18C;&#xC2A4; &#xCC38;&#xC5EC; &#xB450;&#xAC00;&#xC9C0; &#xBAA8;&#xB450;&#xB97C; &#xD558;&#xB824;&#xBA74; &#xC5B4;&#xB290; &#xC815;&#xB3C4; &#xD6C8;&#xB828;&#xC774; &#xD544;&#xC694;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC77C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC775;&#xC219;&#xD55C; &#xC9C1;&#xC6D0;&#xC774; &#xC5C6;&#xB2E4;&#xBA74; - &#xD55C;&#xBC88; &#xC870;&#xC0AC;&#xD574;&#xBCF4;&#xBA74; &#xC774;&#xBBF8; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xACBD;&#xD5D8;&#xC774; &#xC788;&#xB294; &#xC9C1;&#xC6D0;&#xB4E4;&#xB3C4; &#xAF64; &#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC5D0; &#xB180;&#xB784; &#xAC83; &#xC785;&#xB2C8;&#xB2E4; - &#xC55E; &#xC139;&#xC158;&#xC5D0;&#xC11C; &#xC774;&#xC57C;&#xAE30;&#xD55C; &#xAC83;&#xACFC; &#xAC19;&#xC774; &#xC774;&#xBBF8; &#xC775;&#xC219;&#xD55C; &#xC9C1;&#xC6D0;&#xC744; &#xACE0;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xAD1C;&#xCC2E;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xB2E4;&#xB978; &#xC774;&#xB4E4;&#xC744; &#xBA58;&#xD1A0;&#xB9C1; &#xD574;&#xC57C;&#xD560; &#xC758;&#xBB34;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC;&#xC73C;&#xB85C;&#xC368; &#xD68C;&#xC0AC; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C;&#xB4E0; &#xB354; &#xB113;&#xC740; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC5D0;&#xC11C;&#xB4E0; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xCC38;&#xC5EC;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xC55E;&#xC11C; &#xC5B8;&#xAE09;&#xD588;&#xB4EF;, &#xC624;&#xD508; &#xC18C;&#xC2A4;&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xB294; &#xAC83;&#xC740; &#xD68C;&#xC0AC;&#xC758; &#xAC1C;&#xBC1C; &#xB2A5;&#xB825;&#xC744; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0A4;&#xB294; &#xD6CC;&#xB96D;&#xD55C; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h4 id="set-rules-for-participation">Set Rules for Participation</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h4 id="&#xCC38;&#xC5EC;&#xB97C;-&#xC704;&#xD55C;-&#xADDC;&#xCE59;-&#xC124;&#xC815;&#xD558;&#xAE30;">&#xCC38;&#xC5EC;&#xB97C; &#xC704;&#xD55C; &#xADDC;&#xCE59; &#xC124;&#xC815;&#xD558;&#xAE30;</h4>
<p>Open source changes every organization that adopts it, even just to participate in one outside project. Developers at many levels of the organization, and sometimes other employees, are now exposing their conversations and decisions to public scrutiny. Assume that what a developer says in an online forum for an open source project will be seen by the entire world and will last online forever. This might sound like a reason to discourage participation, but it&#x2019;s not. It just means that you need to establish rules for online participation, such as a code of conduct that enforces honest but respectful dialog and that lays out the rights of people who regularly experience discrimination or abuse. Many open source projects provide good codes of conduct that you can adopt. Several codes that have been carefully tested and vetted already are offered by the <a href="https://todogroup.org/opencodeofconduct/" target="_blank">TODO Group</a>. Revised versions of this code of conduct are implemented by companies such as <a href="https://aws.github.io/code-of-conduct.html" target="_blank">Amazon Web Services</a> across their open source projects.</p>
<p>&#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB294; &#xB2E8;&#xC9C0; &#xC678;&#xBD80; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xD558;&#xB098;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB97C; &#xCC44;&#xD0DD;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xC870;&#xC9C1;&#xC744; &#xBCC0;&#xD654;&#xD558;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xC870;&#xC9C1;&#xC5D0; &#xC18D;&#xD55C; &#xB2E4;&#xC591;&#xD55C; &#xC218;&#xC900;&#xC758; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;, &#xB54C;&#xB85C;&#xB294; &#xB2E4;&#xB978; &#xC9C1;&#xC6D0;&#xB4E4;&#xB3C4; &#xC774;&#xC81C;&#xB294; &#xB300;&#xD654;&#xC640; &#xACB0;&#xC815; &#xC0AC;&#xD56D;&#xC744; &#xACF5;&#xAC1C; &#xC870;&#xC0AC;&#xC5D0; &#xB178;&#xCD9C;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC628;&#xB77C;&#xC778; &#xD3EC;&#xB7FC;&#xC5D0;&#xC11C; &#xD55C; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xD55C; &#xB9D0;&#xC774; &#xC804;&#xC138;&#xACC4;&#xC5D0; &#xBCF4;&#xC5EC;&#xC9C0;&#xACE0;, &#xC628;&#xB77C;&#xC778; &#xC0C1;&#xC5D0; &#xC601;&#xC6D0;&#xD788; &#xB0A8;&#xACA8;&#xC9C4;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;. &#xC774;&#xAC8C; &#xCC38;&#xC5EC;&#xD560; &#xC758;&#xC9C0;&#xB97C; &#xB5A8;&#xC5B4;&#xB728;&#xB9B4; &#xC774;&#xC720; &#xAC19;&#xC774; &#xB4E4;&#xB9B4; &#xC218; &#xC788;&#xC9C0;&#xB9CC;, &#xC2E4;&#xC81C;&#xB85C;&#xB294; &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xAC74; &#xB2E8;&#xC9C0; &#xC815;&#xC9C1;&#xD558;&#xC9C0;&#xB9CC; &#xC874;&#xC911;&#xC774; &#xB2F4;&#xAE34; &#xB300;&#xD654;&#xB97C; &#xAC15;&#xC81C;&#xD558;&#xACE0;, &#xC790;&#xC8FC; &#xCC28;&#xBCC4;&#xACFC; &#xD559;&#xB300;&#xB97C; &#xACBD;&#xD5D8;&#xD558;&#xB294; &#xC0AC;&#xB78C;&#xB4E4;&#xC758; &#xAD8C;&#xB9AC;&#xB97C; &#xADDC;&#xC815;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xD589;&#xB3D9; &#xAC15;&#xB839;(Code of conduct)&#xACFC; &#xAC19;&#xC740; &#xC628;&#xB77C;&#xC778; &#xCC38;&#xC5EC; &#xC2DC;&#xC758; &#xADDC;&#xCE59;&#xC744; &#xD655;&#xB9BD;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD560; &#xBFD0; &#xC785;&#xB2C8;&#xB2E4;. &#xB9CE;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xCC44;&#xC6A9;&#xD560; &#xB9CC;&#xD55C; &#xC88B;&#xC740; &#xD589;&#xB3D9; &#xAC15;&#xB839;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <a href="https://todogroup.org/opencodeofconduct/" target="_blank">TODO Group</a>&#xC740; &#xC8FC;&#xC758; &#xAE4A;&#xAC8C; &#xC2DC;&#xD5D8;&#xD558;&#xACE0; &#xAC80;&#xC99D;&#xD55C; &#xC5EC;&#xB7EC; &#xAC15;&#xB839;&#xC744; &#xC774;&#xBBF8; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xD589;&#xB3D9; &#xAC15;&#xB839;&#xC758; &#xAC1C;&#xC815;&#xBCF8;&#xC774; <a href="https://aws.github.io/code-of-conduct.html" target="_blank">&#xC544;&#xB9C8;&#xC874;&#xC6F9;&#xC11C;&#xBE44;&#xC2A4;</a>&#xC640; &#xAC19;&#xC740; &#xD68C;&#xC0AC;&#xC758; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB4E4;&#xC5D0; &#xAC78;&#xCCD0; &#xC2DC;&#xD589;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>There has recently been a heightened awareness of practices in the computer industry (and other parts of society) that discourage the contributions of women and minorities, or that create a harassing and unsupportive environment. These are habits you&#x2019;ll want to root out of your organization, regardless of whether they&#x2019;re exposed to public scrutiny. The company and community must take positive and affirmative steps at diversity and inclusion.</p>
<p>&#xCD5C;&#xADFC; &#xCEF4;&#xD4E8;&#xD130; &#xC0B0;&#xC5C5;(&#xACFC; &#xC0AC;&#xD68C;&#xC758; &#xB2E4;&#xB978; &#xBD80;&#xBD84;&#xC5D0;&#xC11C;) &#xC5EC;&#xC131;&#xACFC; &#xC18C;&#xC218;&#xC790;&#xB4E4;&#xC758; &#xAE30;&#xC5EC;&#xB97C; &#xC88C;&#xC808;&#xC2DC;&#xD0A4;&#xAC70;&#xB098; &#xBE44;&#xD611;&#xC870;&#xC801;&#xC774;&#xACE0; &#xACE0;&#xD1B5;&#xC744; &#xC8FC;&#xB294; &#xD658;&#xACBD;&#xC744; &#xC870;&#xC131;&#xD558;&#xB294; &#xAD00;&#xD589;&#xC5D0; &#xB300;&#xD55C; &#xC8FC;&#xC758;&#xAC00; &#xB192;&#xC544;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5EC;&#xB7EC;&#xBD84;&#xB4E4;&#xB3C4; &#xACF5;&#xAC1C; &#xC870;&#xC0AC;&#xB85C; &#xB4E4;&#xC5B4;&#xB0AC;&#xB294;&#xC9C0; &#xC5EC;&#xBD80;&#xB97C; &#xB5A0;&#xB098;&#xC11C; &#xC774;&#xB7EC;&#xD55C; &#xC545;&#xC2B5;&#xB4E4;&#xC774; &#xC870;&#xC9C1;&#xC5D0;&#xC11C; &#xADFC;&#xC808;&#xB418;&#xAE38; &#xC6D0;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xAE30;&#xC5C5;&#xACFC; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB294; &#xB2E4;&#xC591;&#xC131;&#xACFC; &#xD3EC;&#xC6A9;&#xC131;&#xC744; &#xC704;&#xD55C; &#xAE0D;&#xC815;&#xC801;&#xC774;&#xACE0; &#xC6B0;&#xD638;&#xC801;&#xC778; &#xC870;&#xCE58;&#xB97C; &#xCDE8;&#xD574;&#xC57C;&#xB9CC; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h4 id="foster-open-communication">Foster Open Communication</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h4 id="&#xC5F4;&#xB9B0;-&#xCEE4;&#xBBA4;&#xB2C8;&#xCF00;&#xC774;&#xC158;&#xC744;-&#xCD09;&#xC9C4;&#xD558;&#xAE30;">&#xC5F4;&#xB9B0; &#xCEE4;&#xBBA4;&#xB2C8;&#xCF00;&#xC774;&#xC158;&#xC744; &#xCD09;&#xC9C4;&#xD558;&#xAE30;</h4>
<p>Beyond showing respect, your developers need to engage with the open source community productively, which might require a culture change. Developers might be used to calling an informal meeting of two to four people and making design decisions informally. Some kinds of Agile and Scrum methodologies encourage this behavior, but they also provide techniques for accepting input from wide swaths of the organization. Therefore, Agile and Scrum can be adapted to open source. In fact, open source is open to a wide range of methodologies.</p>
<p>&#xC874;&#xC911;&#xC744; &#xBCF4;&#xC774;&#xB294; &#xAC83;&#xC744; &#xB118;&#xC5B4;, &#xC5EC;&#xB7EC;&#xBD84;&#xC758; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC5D0; &#xC0DD;&#xC0B0;&#xC801;&#xC73C;&#xB85C; &#xCC38;&#xC5EC;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBB38;&#xD654;&#xC758; &#xBCC0;&#xD654;&#xAC00; &#xD544;&#xC694;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xB450; &#xBA85;&#xC5D0;&#xC11C; &#xB124; &#xBA85; &#xC815;&#xB3C4;&#xC758; &#xBE44;&#xACF5;&#xC2DD; &#xBBF8;&#xD305;&#xC744; &#xC18C;&#xC9D1;&#xD574;&#xC11C; &#xC124;&#xACC4; &#xACB0;&#xC815;&#xC744; &#xB0B4;&#xB9AC;&#xB294; &#xB370;&#xC5D0; &#xC775;&#xC219;&#xD588;&#xC744; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC77C;&#xBD80; &#xC560;&#xC790;&#xC77C; &#xC2A4;&#xD06C;&#xB7FC; &#xBC29;&#xBC95;&#xB860;(Agile and Scrum methodologies)&#xC740; &#xC774;&#xB7F0; &#xBC29;&#xC2DD;&#xC744; &#xC9C0;&#xC9C0;&#xD558;&#xAE30;&#xB3C4; &#xD558;&#xC9C0;&#xB9CC;, &#xC870;&#xC9C1; &#xB0B4;&#xC758; &#xD3ED; &#xB113;&#xC740; &#xC758;&#xACAC;&#xC744; &#xC218;&#xB834;&#xD558;&#xB294; &#xAE30;&#xC220; &#xB610;&#xD55C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C;, &#xC560;&#xC790;&#xC77C; &#xC2A4;&#xD06C;&#xB7FC; &#xBC29;&#xBC95;&#xB860;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC5D0; &#xC801;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2E4;&#xC81C;&#xB85C; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xC885;&#xB958;&#xC758; &#xBC29;&#xBC95;&#xB860;&#xC5D0; &#xC5F4;&#xB824; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Developers must now learn to conduct all discussions of significant design issues in forums where the decisions are archived for others to view. For changes that you intend to contribute back to the community, discussions must be on the community mailing list or communication channels everyone can join, such as <a href="https://slack.com/" target="_blank">Slack</a>, <a href="https://gitter.im/" target="_blank">Gitter</a>, <a href="https://stackoverflow.com/" target="_blank">Stack Overflow</a>, or <a href="https://groups.google.com" target="_blank">Google Groups</a>. Otherwise, you will take the community by surprise when you submit changes and will probably fail to get changes accepted.</p>
<p>&#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xC774;&#xC81C; &#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xB4E4;&#xB3C4; &#xBCFC; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xAE30;&#xB85D;&#xC774; &#xBCF4;&#xAD00;&#xB418;&#xB294; &#xD3EC;&#xB7FC;&#xC5D0;&#xC11C; &#xC911;&#xC694;&#xD55C; &#xC124;&#xACC4; &#xACB0;&#xC815;&#xC5D0; &#xB300;&#xD55C; &#xBAA8;&#xB4E0; &#xB17C;&#xC758;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294; &#xBC95;&#xC744; &#xBC30;&#xC6CC;&#xC57C;&#xB9CC; &#xD569;&#xB2C8;&#xB2E4;. &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC5D0; &#xC5ED;&#xC73C;&#xB85C; &#xAE30;&#xC5EC;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC5D0; &#xB300;&#xD574; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xBA54;&#xC77C;&#xB9C1; &#xB9AC;&#xC2A4;&#xD2B8; &#xD639;&#xC740; &#xBAA8;&#xB4E0; &#xC0AC;&#xB78C;&#xC774; &#xCC38;&#xC5EC;&#xD560; &#xC218; &#xC788;&#xB294; <a href="https://slack.com/" target="_blank">&#xC2AC;&#xB799;</a>, <a href="https://gitter.im/" target="_blank">&#xC9C0;&#xD130;</a>, <a href="https://stackoverflow.com/" target="_blank">&#xC2A4;&#xD0DD; &#xC624;&#xBC84;&#xD50C;&#xB85C;</a>, <a href="https://groups.google.com" target="_blank">&#xAD6C;&#xAE00; &#xADF8;&#xB8F9;&#xC2A4;</a>&#xC640; &#xAC19;&#xC740; &#xCEE4;&#xBBA4;&#xB2C8;&#xCF00;&#xC774;&#xC158; &#xCC44;&#xB110;&#xC744; &#xD1B5;&#xD574; &#xD1A0;&#xB860;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xC73C;&#xBA74;, &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC744; &#xC81C;&#xCD9C;&#xD560; &#xB54C; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB97C; &#xD654;&#xB4E4;&#xC9DD; &#xB180;&#xB77C;&#xAC8C; &#xD558;&#xACE0; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC740; &#xC544;&#xB9C8;&#xB3C4; &#xBC1B;&#xC544;&#xB4E4;&#xC5EC;&#xC9C0;&#xC9C0; &#xBABB;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>In addition to providing information in a timely manner, developers must also look beyond the narrow horizons of their team and recognize the value of input from a diverse range of people, either from other parts of your company or from outsiders who might live halfway around the world. This is where techniques of respectful dialog must enter your corporate culture. Developers need other new skills, as well: they must be good listeners, take feedback from a variety of developers, reject unsuitable contributions while encouraging the contributor to learn and try again, and deal with people from different backgrounds with varying language skills.</p>
<p>&#xC2DC;&#xC758;&#xC801;&#xC808;&#xD558;&#xAC8C; &#xC815;&#xBCF4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xAC83; &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C;, &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xC18C;&#xC18D; &#xD300; &#xB0B4;&#xC758; &#xC881;&#xC740; &#xC2DC;&#xC57C;&#xB97C; &#xB118;&#xC5B4;, &#xC0AC;&#xB0B4; &#xB2E4;&#xB978; &#xBD80;&#xC11C;&#xB098; &#xC2EC;&#xC9C0;&#xC5B4;&#xB294; &#xC9C0;&#xAD6C; &#xBC18;&#xB300;&#xD3B8;&#xC5D0; &#xC788;&#xB294; &#xC678;&#xBD80;&#xC778;&#xC5D0; &#xC774;&#xB974;&#xAE30;&#xAE4C;&#xC9C0; &#xB2E4;&#xC591;&#xD55C; &#xBC94;&#xC704;&#xC758; &#xC0AC;&#xB78C;&#xB4E4;&#xB85C;&#xBD80;&#xD130; &#xC758;&#xACAC;&#xC744; &#xC5BB;&#xB294; &#xAC83;&#xC758; &#xAC00;&#xCE58;&#xB97C; &#xC778;&#xC2DD;&#xD574;&#xC57C;&#xB9CC; &#xD569;&#xB2C8;&#xB2E4;. &#xC874;&#xC911;&#xC774; &#xB2F4;&#xAE34; &#xB300;&#xD654;&#xC758; &#xAE30;&#xC220;&#xC774; &#xC5EC;&#xB7EC;&#xBD84;&#xC758; &#xAE30;&#xC5C5; &#xBB38;&#xD654;&#xC5D0; &#xAF2D; &#xB3C4;&#xC785;&#xB418;&#xC5B4;&#xC57C; &#xD558;&#xB294; &#xAC83;&#xC740; &#xC774; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xB2E4;&#xB978; &#xC0C8;&#xB85C;&#xC6B4; &#xAE30;&#xC220;&#xB3C4; &#xD544;&#xC694;&#xB85C; &#xD569;&#xB2C8;&#xB2E4; : &#xD0C0;&#xC778;&#xC758; &#xB9D0;&#xC744; &#xC798; &#xB4E4;&#xC5B4;&#xC8FC;&#xC5B4;&#xC57C; &#xD558;&#xACE0;, &#xB2E4;&#xC591;&#xD55C; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xB85C;&#xBD80;&#xD130; &#xD53C;&#xB4DC;&#xBC31;&#xC744; &#xBC1B;&#xC544;&#xC57C; &#xD558;&#xBA70;, &#xBD80;&#xC801;&#xC808;&#xD55C; &#xAE30;&#xC5EC;&#xB97C; &#xAC70;&#xC808;&#xD558;&#xB294; &#xD55C;&#xD3B8;&#xC73C;&#xB85C;&#xB294; &#xAE30;&#xC5EC;&#xC790;&#xAC00; &#xACF5;&#xBD80;&#xD558;&#xC5EC; &#xB2E4;&#xC2DC; &#xC2DC;&#xB3C4;&#xD558;&#xB3C4;&#xB85D; &#xACA9;&#xB824;&#xD558;&#xACE0;, &#xB2E4;&#xC591;&#xD55C; &#xC5B8;&#xC5B4; &#xB2A5;&#xB825;&#xC744; &#xAC00;&#xC9C4; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xBC30;&#xACBD;&#xC758; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xB2E4;&#xB8E8;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>When developers are accustomed to making design decisions in hallway conversations or over the telephone, they might need some time to learn to make decisions in more open ways and to use the less-intuitive communication media provided by mailing lists and bug trackers. Joining an open source project is an excellent way to raise the priority of good communications, honest disagreement, and open, respectful dialog throughout your organization.</p>
<p>&#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC774; &#xBCF5;&#xB3C4;&#xC5D0;&#xC11C;&#xC758; &#xB300;&#xD654;&#xB098; &#xC804;&#xD654; &#xD1B5;&#xD654;&#xB97C; &#xD1B5;&#xD574; &#xC124;&#xACC4; &#xACB0;&#xC815;&#xC744; &#xB0B4;&#xB9AC;&#xB294; &#xB370;&#xC5D0; &#xC775;&#xC219;&#xD574;&#xC838; &#xC788;&#xB2E4;&#xBA74;, &#xC880; &#xB354; &#xACF5;&#xAC1C;&#xB41C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xACB0;&#xC815;&#xC744; &#xB0B4;&#xB9AC;&#xACE0; &#xBA54;&#xC77C;&#xB9C1; &#xB9AC;&#xC2A4;&#xD2B8;&#xB098; &#xBC84;&#xADF8; &#xCD94;&#xC801;&#xAE30;&#xAC00; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xB35C; &#xC9C1;&#xAD00;&#xC801;&#xC778; &#xCEE4;&#xBBA4;&#xB2C8;&#xCF00;&#xC774;&#xC158; &#xB9E4;&#xCCB4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xBC30;&#xC6B0;&#xB294; &#xB370;&#xC5D0; &#xB2E4;&#xC18C; &#xC2DC;&#xAC04;&#xC774; &#xD544;&#xC694;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC5EC;&#xB7EC;&#xBD84;&#xC758; &#xC870;&#xC9C1; &#xB0B4;&#xC5D0;&#xC11C; &#xD6CC;&#xB96D;&#xD55C; &#xCEE4;&#xBBA4;&#xB2C8;&#xCF00;&#xC774;&#xC158;&#xACFC; &#xC194;&#xC9C1;&#xD55C; &#xBC18;&#xB300;, &#xADF8;&#xB9AC;&#xACE0; &#xC874;&#xC911;&#xC774; &#xB2F4;&#xAE34; &#xC5F4;&#xB9B0; &#xB300;&#xD654;&#xC758; &#xC6B0;&#xC120; &#xC21C;&#xC704;&#xB97C; &#xB192;&#xC774;&#xB294; &#xD6CC;&#xB96D;&#xD55C; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>Decisions can take longer when the crowd become involved. If you short-circuit the open source discussion process and make a quick decision in order to get a product out the door, you might need to roll back some of the work done later so that the code can be maintained and can adapt to future needs.</p>
<p>&#xAD70;&#xC911;&#xC774; &#xCC38;&#xC5EC;&#xD558;&#xAC8C; &#xB418;&#xBA74; &#xACB0;&#xC815;&#xC5D0; &#xB354; &#xC624;&#xB79C; &#xC2DC;&#xAC04;&#xC774; &#xAC78;&#xB9B4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC81C;&#xD488;&#xC744; &#xBE68;&#xB9AC; &#xB0B4;&#xB193;&#xAE30; &#xC704;&#xD574; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD1A0;&#xB860; &#xC808;&#xCC28;&#xB97C; &#xC9E7;&#xAC8C; &#xC904;&#xC774;&#xACE0; &#xBE60;&#xB978; &#xACB0;&#xC815;&#xC744; &#xB0B4;&#xB824; &#xBC84;&#xB9AC;&#xAC8C; &#xB418;&#xBA74;, &#xCF54;&#xB4DC;&#xAC00; &#xC720;&#xC9C0;&#xB418;&#xACE0; &#xBBF8;&#xB798;&#xC758; &#xC694;&#xAD6C;&#xC758; &#xBC1B;&#xC544;&#xB4E4;&#xC77C; &#xC218; &#xC788;&#xAC8C; &#xD558;&#xAE30; &#xC704;&#xD574; &#xC218;&#xD589;&#xD55C; &#xC791;&#xC5C5;&#xC758; &#xC77C;&#xBD80;&#xB97C; &#xB864;&#xBC31;&#xD574;&#xC57C; &#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>An important side benefit of diligently recording decisions is that the project becomes less dependent on particular individuals and can reorganize itself gracefully if key individuals leave. No single person has unique or irreplaceable information.</p>
<p>&#xC131;&#xC2E4;&#xD558;&#xAC8C; &#xACB0;&#xC815; &#xC0AC;&#xD56D;&#xC744; &#xAE30;&#xB85D;&#xD560; &#xB54C;&#xC5D0; &#xD55C; &#xAC00;&#xC9C0; &#xC911;&#xC694;&#xD55C; &#xBD80;&#xCC28;&#xC801;&#xC778; &#xC774;&#xC810;&#xC740; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xD2B9;&#xC815; &#xC778;&#xBB3C;&#xC5D0; &#xB35C; &#xC758;&#xC874;&#xD558;&#xAC8C; &#xB418;&#xACE0;, &#xD575;&#xC2EC; &#xC778;&#xBB3C;&#xC774; &#xB5A0;&#xB098;&#xB354;&#xB77C;&#xB3C4; &#xBB34;&#xB9AC;&#xC5C6;&#xC774; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC7AC;&#xAD6C;&#xC131;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC900;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB290; &#xD55C; &#xC0AC;&#xB78C;&#xB3C4; &#xC720;&#xC77C;&#xD558;&#xAC70;&#xB098; &#xB300;&#xCCB4;&#xBD88;&#xAC00;&#xB2A5;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC9C8; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="08-participating-in-a-projects-community.html" class="navigation navigation-prev " aria-label="Previous page: 프로젝트 커뮤니티에의 참여">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="10-launching-an-open-source-project.html" class="navigation navigation-next " aria-label="Next page: 오픈소스 프로젝트의 시작">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"오픈소스 프로젝트에 기여하기","level":"1.10","depth":1,"next":{"title":"오픈소스 프로젝트의 시작","level":"1.11","depth":1,"path":"src/10-launching-an-open-source-project.md","ref":"src/10-launching-an-open-source-project.md","articles":[]},"previous":{"title":"프로젝트 커뮤니티에의 참여","level":"1.9","depth":1,"path":"src/08-participating-in-a-projects-community.md","ref":"src/08-participating-in-a-projects-community.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"이민석 外","pdf.fontSize":14,"pdf.fontFamily":"NanumGothic","pdf.paperSize":"a5","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"기업에서의 오픈소스","language":"ko","gitbook":"*","description":"Zaheda Bhorat, Andy Oram의 저서 'Open Source in the Enterprise'의 한글 번역본. https://aws.amazon.com/opensource/enterprise-oss-book/","pdf.pageNumbers":true},"file":{"path":"src/09-contributing-to-open-source-project.md","mtime":"2019-01-03T08:27:03.907Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-03T08:28:29.523Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

