
<!DOCTYPE HTML>
<html lang="ko" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>오픈소스 프로젝트의 시작 · 기업에서의 오픈소스</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="이민석 外">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="11-open-source-and-the-cloud.html" />
    
    
    <link rel="prev" href="09-contributing-to-open-source-project.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="검색어 입력" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-acknowledgments.html">
            
                <a href="00-acknowledgments.html">
            
                    
                    감사의 글
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-preface.html">
            
                <a href="01-preface.html">
            
                    
                    역자 서문
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03-open-source-in-the-enteprise.html">
            
                <a href="03-open-source-in-the-enteprise.html">
            
                    
                    개괄: 기업에서의 오픈소스
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                <a href="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                    
                    왜 기업과 정부는 오픈소스로 전환하는가?
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05-more-than-a-license-or-even-code.html">
            
                <a href="05-more-than-a-license-or-even-code.html">
            
                    
                    저작권이나 심지어 코드보다 더 중요한 것
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06-groundworks-for-understanding-open-source.html">
            
                <a href="06-groundworks-for-understanding-open-source.html">
            
                    
                    오픈소스를 이해하기 위한 기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07-adopting-and-using-open-source-code.html">
            
                <a href="07-adopting-and-using-open-source-code.html">
            
                    
                    오픈소스 코드의 도입과 사용
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08-participating-in-a-projects-community.html">
            
                <a href="08-participating-in-a-projects-community.html">
            
                    
                    프로젝트 커뮤니티에의 참여
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09-contributing-to-open-source-project.html">
            
                <a href="09-contributing-to-open-source-project.html">
            
                    
                    오픈소스 프로젝트에 기여하기
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="10-launching-an-open-source-project.html">
            
                <a href="10-launching-an-open-source-project.html">
            
                    
                    오픈소스 프로젝트의 시작
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-open-source-and-the-cloud.html">
            
                <a href="11-open-source-and-the-cloud.html">
            
                    
                    오픈소스와 클라우드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-conclusion.html">
            
                <a href="12-conclusion.html">
            
                    
                    결어
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-about-authors.html">
            
                <a href="13-about-authors.html">
            
                    
                    저자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-translators.html">
            
                <a href="14-translators.html">
            
                    
                    역자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="15-links.html">
            
                <a href="15-links.html">
            
                    
                    외부 링크
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="../GLOSSARY.html">
            
                <a href="../GLOSSARY.html">
            
                    
                    용어 사전
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBook에 게시
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >오픈소스 프로젝트의 시작</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="launching-an-open-source-project">Launching an Open Source Project</h3>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h3 id="&#xC624;&#xD508;&#xC18C;&#xC2A4;-&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758;-&#xC2DC;&#xC791;">&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xC2DC;&#xC791;</h3>
<p>As your organization comes to recognize the benefits of the open source development model, you might decide to 
start a project of your own. Careful planning can make the difference between a quickly forgotten fiasco and a thriving, 
sustainable code base. A Linux Foundation guide(<a href="http://bit.ly/2sWo0cO" target="_blank">http://bit.ly/2sWo0cO</a>) offers more details about the process and a comprehensive project launch 
checklist. All the principles of the previous sections apply, and some further considerations are summarized in this section.</p>
<p>&#xC624;&#xD508; &#xC18C;&#xC2A4; &#xAC1C;&#xBC1C; &#xBAA8;&#xB378;&#xC758; &#xC7A5;&#xC810;&#xC744; &#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xC18D;&#xD55C; &#xC870;&#xC9C1;&#xC774; &#xC54C;&#xAC8C; &#xB418;&#xBA74;&#xC11C;, &#xC0C8;&#xB85C;&#xC6B4; &#xC790;&#xC2E0;&#xB9CC;&#xC758; &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2DC;&#xC791;&#xD558;&#xACE0;&#xC790; &#xACB0;&#xC815;&#xD588;&#xC744;&#xC9C0;&#xB3C4; &#xBAA8;&#xB985;&#xB2C8;&#xB2E4;.
&#xC0AC;&#xB824;&#xAE4A;&#xAC8C; &#xACC4;&#xD68D;&#xC744; &#xD574;&#xC57C; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xAC00; &#xBE60;&#xB978; &#xD765;&#xB9DD;&#xC131;&#xC1E0;&#xB97C; &#xD1B5;&#xD574; &#xC78A;&#xD600;&#xC9C8;&#xC9C0; &#xACC4;&#xC18D; &#xC720;&#xC9C0;&#xD558;&#xAC8C; &#xB420;&#xC9C0; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9AC;&#xB205;&#xC2A4; &#xC7AC;&#xB2E8; &#xAC00;&#xC774;&#xB4DC;(<a href="http://bit.ly/2sWo0cO)&#xC5D0;&#xC11C;&#xB294;" target="_blank">http://bit.ly/2sWo0cO)&#xC5D0;&#xC11C;&#xB294;</a>
&#xADF8; &#xACFC;&#xC815;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC790;&#xC138;&#xD788; &#xC124;&#xBA85;&#xD558;&#xBA70;, &#xC885;&#xD569;&#xC801;&#xC778; &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC744; &#xC2DC;&#xC791;&#xD560; &#xC218; &#xC788;&#xB294; &#xCCB4;&#xD06C;&#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xC55E;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xBAA8;&#xB4E0; &#xC774;&#xB860;&#xB4E4;&#xC774; &#xB2F9;&#xC5F0;&#xD788; &#xC801;&#xC6A9;&#xB418;&#xBA70;,
&#xC880;&#xB354; &#xACE0;&#xB824;&#xD560; &#xB9CC;&#xD55C; &#xC0AC;&#xD56D;&#xB4E4;&#xC744; &#xC124;&#xBA85;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h4 id="choose-a-license">Choose a License</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC; : &#xC724;&#xC885;&#xBBFC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xC644;&#xB8CC; : &#xC774;&#xBBFC;&#xC11D;)</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h4 id="&#xB77C;&#xC774;&#xC120;&#xC2A4;&#xC758;-&#xC120;&#xD0DD;">&#xB77C;&#xC774;&#xC120;&#xC2A4;&#xC758; &#xC120;&#xD0DD;</h4>
<p>Your legal staff must understand how you plan to use the code, including whether you will make closed enhancements for internal use. The license you choose will control your own use as well as the decisions other companies and individuals make to adopt your software. So, make sure it is aligned to the business&#x2019;s strategy.</p>
<p>&#xBC95;&#xBB34;&#xD300;&#xC5D0;&#xC11C;&#xB294; &#xC55E;&#xC73C;&#xB85C; &#xB0B4;&#xBD80; &#xC0AC;&#xC6A9;&#xC744; &#xC704;&#xD558;&#xC5EC; &#xBE44;&#xACF5;&#xAC1C;&#xB85C; &#xAC1C;&#xC120;&#xD560; &#xAC83;&#xC778;&#xC9C0;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xC5EC;, &#xCF54;&#xB4DC;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xD65C;&#xC6A9;&#xD560;&#xC9C0;&#xB97C; &#xD30C;&#xC545;&#xD558;&#xACE0; &#xC788;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xC758; &#xC120;&#xD0DD;&#xC740; &#xB2E4;&#xB978; &#xD68C;&#xC0AC;&#xB098; &#xAC1C;&#xC778;&#xB4E4;&#xC774; &#xADF8; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xCC44;&#xD0DD; &#xC5EC;&#xBD80;&#xB97C; &#xACB0;&#xC815;&#xD558;&#xB294; &#xAC83;&#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xD68C;&#xC0AC; &#xC790;&#xC2E0;&#xC758; &#xC0AC;&#xC6A9;&#xC5D0;&#xB3C4; &#xC601;&#xD5A5;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30;&#xC5D0;, &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xB294; &#xD68C;&#xC0AC;&#xC758; &#xBE44;&#xC9C0;&#xB2C8;&#xC2A4; &#xC804;&#xB7B5;&#xC744; &#xACE0;&#xB824;&#xD574;&#xC57C; &#xACB0;&#xC815;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.   </p>
<p>There is no reason to get fancy, though. Earlier in this book, we mentioned a few of the most popular licenses. Although there is a long list of open source licenses at the <a href="https://opensource.org/licenses" target="_blank">Open Source Initiative</a>, we strongly urge that you to go with one of the popular and recent licenses. GitHub offers a <a href="https://choosealicense.com/" target="_blank">guide</a>  with a selection of well-crafted licenses. If you don&#x2019;t think one of these meets your needs, go back and candidly reevaluate your motivation for going open source. If you can&#x2019;t use a popular license, you are probably trying to do something out of sync with open source principles, and could end up driving away the people whom you want to attract.</p>
<p>&#xBCF5;&#xC7A1;&#xD55C; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xB97C; &#xCC44;&#xD0DD;&#xD560; &#xD544;&#xC694;&#xB294; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC758; &#xC55E;&#xBD80;&#xBD84;&#xC5D0;&#xC11C; &#xBA87; &#xAC00;&#xC9C0;&#xC758; &#xC720;&#xBA85;&#xD55C; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xB97C; &#xC18C;&#xAC1C;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. <a href="https://opensource.org/licenses" target="_blank">OSI(Open Source Initiative)</a>&#xC5D0; &#xBCF4;&#xBA74; &#xB9CE;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xAC00; &#xB098;&#xC5F4;&#xB418;&#xC5B4; &#xC788;&#xAE30;&#xB294; &#xD558;&#xC9C0;&#xB9CC;, &#xADF8; &#xC911;&#xC5D0;&#xC11C; &#xC798; &#xC54C;&#xB824;&#xC838;&#xC788;&#xACE0; &#xCD5C;&#xC2E0;&#xC5D0; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xB97C; &#xC120;&#xD0DD;&#xD560; &#xAC83;&#xC744; &#xAC15;&#xB825;&#xD558;&#xAC8C; &#xAD8C;&#xD569;&#xB2C8;&#xB2E4;. GitHub&#xC740; &#xC798; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; <a href="https://choosealicense.com/" target="_blank">&#xB77C;&#xC774;&#xC120;&#xC2A4; &#xC120;&#xBCC4; &#xAC00;&#xC774;&#xB4DC;</a>&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9C8;&#xC74C;&#xC5D0; &#xB9DE;&#xB294; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xB97C; &#xCC3E;&#xC744; &#xC218; &#xC5C6;&#xB2E4;&#xBA74;, &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB85C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xB3D9;&#xAE30;&#xB97C; &#xB2E4;&#xC2DC; &#xD55C;&#xBC88; &#xC9C4;&#xC9C0;&#xD558;&#xAC8C; &#xC0DD;&#xAC01;&#xD574; &#xBCF4;&#xC2ED;&#xC2DC;&#xC624;. &#xB9CC;&#xC77C; &#xC798; &#xC54C;&#xB824;&#xC9C4; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xB2E4;&#xBA74;, &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC758; &#xC6D0;&#xCE59;&#xACFC; &#xC5B4;&#xAE0B;&#xB098;&#xB294; &#xBC29;&#xD5A5;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xB824;&#xB294; &#xAC83;&#xC77C; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xADF8;&#xB85C; &#xC778;&#xD558;&#xC5EC; &#xC6B0;&#xB9AC;&#xAC00; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xB04C;&#xC5B4;&#xB4E4;&#xC774;&#xACE0; &#xC2F6;&#xC5C8;&#xB358; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xB5A8;&#xC5B4;&#xC838;&#xB098;&#xAC00;&#xAC8C; &#xD560; &#xC218; &#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h4 id="open-the-code-right-out-of-the-gate">Open the Code Right Out of the Gate</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<p>It&#x2019;s best to create a public repository and invite participation from outside your company before you create a single line of code. Otherwise, you won&#x2019;t be able to open your code until you review it thoroughly to strip out proprietary secrets and embarrassing comments. Opening the code from the start&#x2014;part of an &#x201C;open source first&#x201D; approach&#x2014;will encourage your own developers to follow best coding practices.</p>
<p>Select a name for your project that will resonate with the community. Names can be very personal (for example, Linux was named after the creator of the operating system) or can describe the software, as in the office software called <a href="https://www.libreoffice.org/" target="_blank">LibreOffice</a>. The project can be named after a mascot or even be a nonsense word chosen to be easy to remember (such as Hadoop). Run through the same checks and due diligence that your legal team does for trademarks to ensure that no duplicate exists, that the name is not offensive in some language, and so on. See the section <a href="...">&#x201C;Keep Up Communication&#x201D; on page 22</a> for information on promoting your project and brand.</p>
<p>The first code you open could be messy, if it&#x2019;s created by people used to internal team work instead of open source development. Opening immature code can be difficult for both your developers and your managers to accept. But simply docu&#x2010; ment the progress you&#x2019;ve made and what you need from the community, and you will be rewarded by them&#x2014;given, that is, a commitment to winning over and mentoring new users. If you have a good idea, many hands will reach in to fix your problems. If you don&#x2019;t have a good idea, you&#x2019;ll hear that unpleasant news from outsiders and will be able to abandon the project before wasting more developer time.</p>
<h4 id="&#xCF54;&#xB4DC;&#xB97C;-&#xBB38;-&#xBC16;&#xC5D0;-&#xB0B4;&#xB193;&#xAE30;">&#xCF54;&#xB4DC;&#xB97C; &#xBB38; &#xBC16;&#xC5D0; &#xB0B4;&#xB193;&#xAE30;</h4>
<p>&#xCF54;&#xB4DC;&#xC758; &#xCCAB;&#xBC88;&#xC9F8; &#xB77C;&#xC778;&#xC744; &#xC791;&#xC131;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xBA3C;&#xC800; &#xACF5;&#xAC1C;&#xB41C; &#xCF54;&#xB4DC; &#xC800;&#xC7A5;&#xC18C;&#xB97C; &#xB9CC;&#xB4E4;&#xACE0; &#xD68C;&#xC0AC; &#xC678;&#xBD80;&#xC5D0; &#xCC38;&#xC5EC;&#xB97C; &#xC694;&#xCCAD;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAC00;&#xC7A5; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xACF5;&#xAC1C;&#xB418;&#xC11C;&#xB294; &#xC548;&#xB418;&#xB294; &#xB0B4;&#xC6A9;&#xB4E4;&#xACFC; &#xB0AF; &#xB728;&#xAC70;&#xC6B4; &#xCF54;&#xBA58;&#xD2B8;&#xB4E4;&#xC744; &#xC81C;&#xAC70;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xCCA0;&#xC800;&#xD55C; &#xCF54;&#xB4DC; &#xB9AC;&#xBDF0; &#xC804;&#xAE4C;&#xC9C0;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xACF5;&#xAC1C;&#xD560; &#xC218; &#xC5C6;&#xC744; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &quot;&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC6B0;&#xC120;&quot; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xCF54;&#xB4DC;&#xB97C; &#xACF5;&#xAC1C;&#xD558;&#xBA74; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC774; &#xCD5C;&#xC0C1;&#xC758; &#xCF54;&#xB529; &#xBC29;&#xBC95;&#xC744; &#xB530;&#xB974;&#xAC8C; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC774;&#xB984;&#xC740; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC640; &#xACF5;&#xAC10;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC120;&#xC815;&#xD558;&#xC2ED;&#xC2DC;&#xC624;. &#xC774;&#xB984;&#xC740; &#xC544;&#xC8FC; &#xAC1C;&#xC778;&#xC801;&#xC77C; &#xC218;&#xB3C4; &#xC788;&#xACE0;(&#xC608; : Linux&#xB294; &#xC6B4;&#xC601;&#xCCB4;&#xC81C; &#xC791;&#xC131;&#xC790;&#xC758; &#xC774;&#xB984;&#xC744; &#xB530;&#xC11C; &#xBA85;&#xBA85;&#xB428;) [LibreOffice] (<a href="https://www.libreoffice.org/)&#xB77C;&#xB294;" target="_blank">https://www.libreoffice.org/)&#xB77C;&#xB294;</a> &#xC624;&#xD53C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xCC98;&#xB7FC; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC124;&#xBA85;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC83;&#xB3C4; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9C8;&#xC2A4;&#xCF54;&#xD2B8;&#xC758; &#xC774;&#xB984;&#xC744; &#xB530;&#xC11C; &#xC9D3;&#xAE30;&#xB3C4; &#xD558;&#xACE0; &#xAE30;&#xC5B5;&#xD558;&#xAE30; &#xC27D;&#xB3C4;&#xB85D; &#xC758;&#xBBF8;&#xC5C6;&#xB294; &#xB2E8;&#xC5B4;&#xB97C; &#xC4F0;&#xAE30;&#xB3C4; (&#xC608; : Hadoop) &#xD569;&#xB2C8;&#xB2E4;.  &#xBC95;&#xBB34;&#xD300;&#xC774; &#xC0C1;&#xD45C;&#xC5D0; &#xB300;&#xD574; &#xC218;&#xD589;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xB3D9;&#xC77C;&#xD55C; &#xC218;&#xC900;&#xC758; &#xC870;&#xC0AC;&#xC640; &#xD655;&#xC778;&#xC744; &#xAC70;&#xCCD0; &#xAC19;&#xC740; &#xC774;&#xB984;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA70;, &#xC5B4;&#xB5A4; &#xC5B8;&#xC5B4;&#xC5D0;&#xC11C;&#xB294; &#xB098;&#xC05C; &#xC758;&#xBBF8;&#xB97C; &#xAC00;&#xC9C0;&#xC9C0; &#xC54A;&#xB294; &#xC774;&#xB984;&#xC744; &#xC120;&#xD0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xBC0F; &#xBE0C;&#xB79C;&#xB4DC; &#xD64D;&#xBCF4;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB294; &#xC544;&#xB798; &#xCEE4;&#xBBA4;&#xB2C8;&#xCF00;&#xC774;&#xC158; &#xC720;&#xC9C0;&#xD558;&#xAE30; &#xC139;&#xC158;&#xC744; &#xCC38;&#xC870;&#xD558;&#xC2ED;&#xC2DC;&#xC624;.</p>
<p>&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xAC1C;&#xBC1C; &#xBC29;&#xC2DD; &#xB300;&#xC2E0; &#xB0B4;&#xBD80; &#xD300; &#xC791;&#xC5C5;&#xC5D0; &#xC775;&#xC219;&#xD55C; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xB9CC;&#xB4E0; &#xCCAB; &#xBC88;&#xC9F8; &#xCF54;&#xB4DC;&#xB294; &#xC9C0;&#xC800;&#xBD84;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC644;&#xC131;&#xB3C4;&#xAC00; &#xB0AE;&#xC740; &#xCF54;&#xB4DC;&#xB97C; &#xACF5;&#xAC1C;&#xD558;&#xB294; &#xAC83;&#xC740; &#xAC1C;&#xBC1C;&#xC790;&#xC640; &#xAD00;&#xB9AC;&#xC790; &#xBAA8;&#xB450; &#xC218;&#xC6A9;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6B8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC774;&#xBBF8; &#xC9C4;&#xD589;&#xB41C; &#xB0B4;&#xC6A9;&#xACFC; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB85C;&#xBD80;&#xD130;&#xC758; &#xB3C4;&#xC6C0;&#xC774; &#xD544;&#xC694;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xBB38;&#xC11C;&#xD654;&#xD558;&#xBA74;, &#xC0C8;&#xB85C;&#xC6B4; &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xC218;&#xC6A9;&#xD558;&#xACE0; &#xADF8;&#xB4E4;&#xC5D0; &#xB300;&#xD55C; &#xBA58;&#xD1A0;&#xB9C1;&#xC744; &#xC57D;&#xC18D;&#xD558;&#xBA74; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB85C;&#xBD80;&#xD130; &#xBCF4;&#xC0C1;&#xC744; &#xBC1B;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xACF5;&#xAC1C;&#xD55C; &#xB0B4;&#xC6A9;&#xC774; &#xC88B;&#xC740; &#xC0DD;&#xAC01;&#xC774;&#xB77C;&#xBA74; &#xB9CE;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xC190;&#xC744; &#xB0B4;&#xBC00;&#xC5B4; &#xAC19;&#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xD639;&#xC2DC; &#xADF8; &#xB0B4;&#xC6A9;&#xC774; &#xC88B;&#xC740; &#xC0DD;&#xAC01;&#xC774; &#xC544;&#xB2C8;&#xB77C;&#xBA74;, &#xC678;&#xBD80;&#xB85C;&#xBD80;&#xD130; &#xC88B;&#xC9C0; &#xC54A;&#xC740; &#xBC18;&#xC751;&#xB4E4;&#xC774; &#xB4E4;&#xB9B4; &#xAC83;&#xC774;&#xBA70;, &#xB354; &#xC774;&#xC0C1; &#xAC1C;&#xBC1C;&#xC790; &#xC2DC;&#xAC04;&#xC744; &#xB0AD;&#xBE44;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xD3EC;&#xAE30;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h4 id="use-best-practices-for-stable-code">Use Best Practices for Stable Code</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<p>You can use one of the popular public repositories to store code and documentation, or can set up a version control system of your own with public access. Have developers check in their changes daily or as often as needed. Developers refer to this practice as &#x201C;release early, release often.&#x201D; Continuous integration and regres&#x2010; sion tests (both considered best practices in open source communities) should ensure that the developer doesn&#x2019;t break anything. Most projects still offer formal releases in order to guarantee stability (especially to major corporate users), but open source permits feedback and improvements on a continuous basis.</p>
<h4 id="&#xC548;&#xC815;&#xB41C;-&#xCF54;&#xB4DC;&#xB97C;-&#xB9CC;&#xB4E4;&#xAE30;-&#xC704;&#xD55C;-&#xBAA8;&#xBC94;&#xC801;&#xC778;-&#xAC1C;&#xBC1C;-&#xBC29;&#xBC95;&#xC758;-&#xC0AC;&#xC6A9;">&#xC548;&#xC815;&#xB41C; &#xCF54;&#xB4DC;&#xB97C; &#xB9CC;&#xB4E4;&#xAE30; &#xC704;&#xD55C; &#xBAA8;&#xBC94;&#xC801;&#xC778; &#xAC1C;&#xBC1C; &#xBC29;&#xBC95;&#xC758; &#xC0AC;&#xC6A9;</h4>
<p>&#xACF5;&#xAC1C; &#xCF54;&#xB4DC; &#xC800;&#xC7A5;&#xC18C;&#xC5D0; &#xCF54;&#xB4DC;&#xC640; &#xBB38;&#xC11C;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xAC70;&#xB098; &#xB0B4; &#xBC84;&#xC804; &#xAD00;&#xB9AC; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xB204;&#xAD6C;&#xB098; &#xC811;&#xADFC;&#xD558;&#xAC8C; &#xC124;&#xC815;&#xD574;&#xB3C4; &#xB429;&#xB2C8;&#xB2E4;. &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xB9E4;&#xC77C; &#xB610;&#xB294; &#xD544;&#xC694;&#xD55C; &#xB9CC;&#xD07C; &#xC790;&#xC8FC; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC744; &#xC801;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD558;&#xC2ED;&#xC2DC;&#xC624;. &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xC774; &#xBC29;&#xBC95;&#xC744; &quot;release early, release often&quot;&#xC774;&#xB77C;&#xACE0; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;. &#xC624;&#xD508; &#xC18C;&#xC2A4; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC5D0;&#xC11C; &#xBAA8;&#xBC94; &#xC0AC;&#xB840;&#xB85C; &#xAC04;&#xC8FC;&#xB418;&#xB294; &#xC9C0;&#xC18D;&#xC801; &#xD1B5;&#xD569;(Continuous Integration) &#xBC0F; &#xD68C;&#xADC0; &#xD14C;&#xC2A4;&#xD2B8;&#xB85C; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xC798; &#xB418;&#xB358; &#xAC83;&#xC744; &#xB9DD;&#xAC00;&#xB728;&#xB9AC;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;. &#xB300;&#xBD80;&#xBD84;&#xC758; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xC544;&#xC9C1;&#xB3C4; &#xC548;&#xC815;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xAE30; &#xC704;&#xD574; (&#xD2B9;&#xD788; &#xC8FC;&#xC694; &#xAE30;&#xC5C5; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC5D0;&#xAC8C;)&#xACF5;&#xC2DD; &#xB9B4;&#xB9AC;&#xC2A4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xC9C0;&#xB9CC; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC5D0;&#xC11C;&#xB294; &#xB04A;&#xC784;&#xC5C6;&#xB294; &#xD53C;&#xB4DC;&#xBC31;&#xACFC; &#xAC1C;&#xC120;&#xC744; &#xD5C8;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h4 id="set-up-public-discussion-forums">Set Up Public Discussion Forums</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
</ul>
<h4 id="&#xACF5;&#xAC1C;-&#xB17C;&#xC758;-&#xD3EC;&#xB7FC;&#xC744;-&#xC124;&#xC815;&#xD558;&#xAE30;">&#xACF5;&#xAC1C; &#xB17C;&#xC758; &#xD3EC;&#xB7FC;&#xC744; &#xC124;&#xC815;&#xD558;&#xAE30;</h4>
<p>You can&#x2019;t expect people to respect your process and make contributions if you hide decisions from them. As explained earlier in <a href="https://d1.awsstatic.com/Open%20Source/enterprise-oss-book.pdf" target="_blank">&#x201C;Foster Open Communication&#x201D; on page 19</a>, developers within your company are now part of the wider community that hopefully will flock to the project outside your company. A simple mailing list might be all that you need. Any tools you use for discussions should be open to the public and should be based themselves on free and open source software so that you don&#x2019;t put up barriers to participation. </p>
<p>&#xACB0;&#xC815;&#xC744; &#xC228;&#xAE30;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC874;&#xC911;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xAE30;&#xC5EC;&#xB97C; &#xB9CC;&#xB4DC;&#xB294; &#xAC83;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xAE30;&#xB300;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6B8; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.  <a href="https://github.com/KMU-OSS-Laboratory/Open-Source-in-the-Enteprise/blob/master/src/09-contributing-to-open-source-project.md#&#xC5F4;&#xB9B0;-&#xCEE4;&#xBBA4;&#xB2C8;&#xCF00;&#xC774;&#xC158;&#xC744;-&#xCD09;&#xC9C4;&#xD558;&#xAE30;" target="_blank">&quot;&#xC5F4;&#xB9B0; &#xCEE4;&#xBBA4;&#xB2C8;&#xCF00;&#xC774;&#xC158;&#xC744; &#xCD09;&#xC9C4;&#xD558;&#xAE30;&quot;</a>&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xAC83;&#xCC98;&#xB7FC;, &#xD68C;&#xC0AC; &#xC548;&#xC758; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC740; &#xC774;&#xC81C; &#xAE30;&#xB300;&#xD558;&#xAC74;&#xB300; &#xD68C;&#xC0AC; &#xC678;&#xBD80;&#xC758; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB85C; &#xBAB0;&#xB824;&#xAC00;&#xB294; &#xB354; &#xD070; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC758; &#xD55C; &#xBD80;&#xBD84;&#xC774; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xD544;&#xC694;&#xD55C; &#xAC83;&#xC740; &#xB2E8;&#xC21C;&#xD55C; &#xBA54;&#xC77C;&#xB9C1; &#xB9AC;&#xC2A4;&#xD2B8; &#xD558;&#xB098;&#xC77C;&#xC9C0;&#xB3C4; &#xBAA8;&#xB985;&#xB2C8;&#xB2E4;. &#xB17C;&#xC758;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xB3C4;&#xAD6C;&#xB4E4;&#xC740; &#xACF5;&#xAC1C;&#xB418;&#xC5B4;&#xC57C;&#xD558;&#xBA70;, &#xC774;&#xAC83; &#xC790;&#xCCB4;&#xAC00; &#xC790;&#xC720; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xADF8;&#xB9AC;&#xACE0; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xAE30;&#xBC18;&#xC774; &#xB418;&#xC5B4;&#xC57C; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xC7A5;&#xBCBD;&#xC744; &#xB450;&#xC9C0; &#xB9D0;&#xC544;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;. </p>
<h4 id="make-life-easy-for-newbies">Make Life Easy for Newbies</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h4 id="&#xCC98;&#xC74C;-&#xC2DC;&#xC791;&#xD558;&#xB294;-&#xC0AC;&#xB78C;&#xB4E4;&#xC774;-&#xC27D;&#xAC8C;-&#xD560;-&#xC218;-&#xC788;&#xB3C4;&#xB85D;-&#xB9CC;&#xB4E4;&#xAE30;">&#xCC98;&#xC74C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xC27D;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB9CC;&#xB4E4;&#xAE30;</h4>
<p>Attracting people who are unfamiliar with your code and organizational setup is critical at the very start of your project, and it remains important even after you are well established. Do not drift into an insular culture understood only by people who have participated for several years. Devote resources constantly to activities that draw in new people, such as the following: </p>
<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2DC;&#xC791;&#xD560;&#xB54C; &#xB2F9;&#xC2E0;&#xC758; &#xCF54;&#xB4DC;&#xC640; &#xC870;&#xC9C1;&#xC758; &#xC124;&#xB9BD;&#xC5D0; &#xC775;&#xC219;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xB04C;&#xC5B4;&#xBAA8;&#xC73C;&#xB294; &#xAC83;&#xC740; &#xB9E4;&#xC6B0; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xAC83;&#xC740; &#xC798; &#xC124;&#xB9BD;&#xC774; &#xB41C; &#xC774;&#xD6C4;&#xC5D0;&#xB3C4; &#xC911;&#xC694;&#xD558;&#xAC8C; &#xB0A8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBBF8; &#xBA87; &#xB144;&#xB3D9;&#xC548; &#xCC38;&#xAC00;&#xD55C; &#xC0AC;&#xB78C;&#xB4E4;&#xB9CC; &#xC774;&#xD574;&#xD558;&#xB294; &#xD3B8;&#xD611;&#xD55C; &#xBB38;&#xD654;&#xC548;&#xC5D0;&#xC11C;&#xB9CC; &#xB5A0;&#xB2E4;&#xB2C8;&#xC9C0; &#xB9C8;&#xC2ED;&#xC2DC;&#xC624;. &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC0C8;&#xB85C;&#xC6B4; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xD65C;&#xB3D9;&#xC5D0; &#xCC38;&#xAC00;&#xC2DC;&#xD0A4;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xB9AC;&#xC18C;&#xC2A4;&#xB4E4;&#xC744; &#xC3DF;&#xC544;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;:</p>
<p><em>Documentation</em></p>
<p>This ranges from quick Getting Started guides to architectural descriptions that explain what is unique and valuable about your project. Many people who lack the skills to contribute code would be happy to write documentation; you need to find, recruit, and engage them. </p>
<p><em>&#xBB38;&#xC11C;&#xD654;</em> </p>
<p>&#xBE60;&#xB974;&#xAC8C; &#xC2DC;&#xC791;&#xD558;&#xAE30; &#xC548;&#xB0B4;&#xC11C;(quick getting started guides) &#xBD80;&#xD130; &#xC774; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xBB34;&#xC5C7;&#xC774; &#xD2B9;&#xBCC4;&#xD558;&#xACE0; &#xAC00;&#xCE58;&#xC788;&#xB294;&#xC9C0;&#xB97C; &#xC124;&#xBA85;&#xD558;&#xB294; &#xAD6C;&#xC870;&#xC801;&#xC778; &#xAE30;&#xC220;&#xAE4C;&#xC9C0;&#xB97C; &#xD3EC;&#xD568;&#xD569;&#xB2C8;&#xB2E4;.  &#xCF54;&#xB4DC;&#xB97C; &#xAE30;&#xC5EC;&#xD558;&#xAE30;&#xC5D0;&#xB294; &#xC2A4;&#xD0AC;&#xC774; &#xBD80;&#xC871;&#xD55C; &#xB9CE;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC740; &#xBB38;&#xC11C;&#xB97C; &#xC791;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC5D0; &#xB9E4;&#xC6B0; &#xAE30;&#xBED0;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xCC3E;&#xACE0;, &#xCC44;&#xC6A9;&#xD558;&#xACE0;, &#xCC38;&#xC5EC;&#xC2DC;&#xCF1C;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><em>Conferences and code-a-thons</em></p>
<p>These demonstrate your commitment to the community and foster enthusi&#x2010; asm. Many people become long-term contributors after attending such events, which are a good way to recruit new contributors and inspire existing contributors to do even more. They also ensure that the wider community is heard when key decisions are made. Get community involvement in organizing the events as well as attending them. Local meetups can be cheap to organize&#x2014;offer a space in your offices and buy a few pizzas and sandwiches&#x2014; and can build strong community support. </p>
<p><em>&#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;&#xC640; &#xCF54;&#xB354;&#xD1A4;(code-a-thons)</em></p>
<p>&#xC774;&#xAC83;&#xB4E4;&#xC740; &#xB2F9;&#xC2E0;&#xC758; &#xD5CC;&#xC2E0;(&#xBAB0;&#xC785;,&#xC57D;&#xC18D;,&#xCC45;&#xC784;,&#xC758;&#xC9C0;)&#xC744; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC5D0; &#xC99D;&#xBA85;&#xD558;&#xACE0; &#xC5F4;&#xC815;&#xC744; &#xAC00;&#xC18D;&#xD654;&#xC2DC;&#xD0A4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xB9CE;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC740; &#xC774;&#xB7F0; &#xC885;&#xB958;&#xC758; &#xD589;&#xC0AC;&#xB97C; &#xCC38;&#xAC00;&#xD558;&#xACE0; &#xB09C; &#xB4A4;&#xC5D0; &#xC7A5;&#xAE30;&#xC801;&#xC778; &#xAE30;&#xC5EC;&#xC790;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30;&#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB7F0; &#xD589;&#xC0AC;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xAE30;&#xC5EC;&#xC790;&#xB4E4;&#xC744; &#xCC44;&#xC6A9;&#xD558;&#xACE0; &#xAE30;&#xC874;&#xC758; &#xAE30;&#xC5EC;&#xC790;&#xB4E4;&#xC774; &#xB354; &#xB9CE;&#xC740; &#xAC83;&#xC744; &#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xACA9;&#xB824;&#xD560; &#xC218; &#xC788;&#xB294; &#xD558;&#xB098;&#xC758; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC740; &#xB610;&#xD55C; &#xC8FC;&#xC694; &#xACB0;&#xC815;&#xC774; &#xB354; &#xB113;&#xC740; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xAC00; &#xB4E4;&#xC744; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;. &#xCC38;&#xC11D;&#xD558;&#xB294; &#xAC83; &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xC900;&#xBE44;&#xD558;&#xB294; &#xB370; &#xC788;&#xC5B4;&#xC11C; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC758; &#xCC38;&#xC5EC;&#xB97C; &#xC720;&#xB3C4;&#xD558;&#xC138;&#xC694;. &#xC9C0;&#xC5ED; &#xBC0B;&#xC5C5;(meetup)&#xC740; &#xC900;&#xBE44;&#xD558;&#xB294;&#xB370; &#xBE44;&#xC6A9;&#xC774; &#xC801;&#xAC8C; &#x2014; &#xC0AC;&#xBB34;&#xC2E4;&#xC758; &#xACF5;&#xAC04;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xD53C;&#xC790;&#xC640; &#xC0CC;&#xB4DC;&#xC704;&#xCE58; &#xAC19;&#xC740; &#xAC83;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC138;&#xC694;. &#x2014; &#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xAC15;&#xB825;&#xD55C; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xC9C0;&#xC6D0;&#xC744; &#xD615;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  </p>
<p><em>Code of conduct</em></p>
<p>Establish respect as a key value of your project from the start. A written code of conduct is critical, even if what it says seems obvious to you. Make sure that project leaders intervene quickly when people are rude or abusive. Even a single tense exchange can drive away a substantial number of users. If you are not welcoming to diverse genders and other groups, you will lose (perhaps forever) the chance to recruit from a big group of talent. And the bad reputation will stain your organization, as well. </p>
<p><em>&#xD589;&#xB3D9; &#xADDC;&#xBC94;</em></p>
<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2DC;&#xC791;&#xD560; &#xB54C; &#xBD80;&#xD130; &#xC874;&#xC911;&#xC774;&#xB77C;&#xB294; &#xAC83;&#xC744; &#xC8FC;&#xC694; &#xAC00;&#xCE58;&#xB85C; &#xC124;&#xB9BD;&#xD558;&#xC138;&#xC694;. &#xBCF4;&#xAE30;&#xC5D0; &#xB108;&#xBB34;&#xB098;&#xB3C4; &#xB2F9;&#xC5F0;&#xD558;&#xAC8C; &#xBCF4;&#xC77C;&#xC9C0;&#xB77C;&#xB3C4;, &#xAE00;&#xB85C; &#xC4F0;&#xC5EC;&#xC9C4; &#xD589;&#xB3D9; &#xADDC;&#xBC94;&#xC740; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xBB34;&#xB840;&#xD558;&#xAC70;&#xB098; &#xB3C5;&#xC124;&#xC744; &#xD560; &#xB54C; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB9AC;&#xB354;(&#xC9C0;&#xB3C4;&#xC790;)&#xB4E4;&#xC774; &#xBE60;&#xB974;&#xAC8C; &#xC911;&#xC7AC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD558;&#xC138;&#xC694;. &#xC2EC;&#xC9C0;&#xC5B4; &#xD558;&#xB098;&#xC758; &#xAE34;&#xC7A5;&#xC774; &#xC624;&#xACE0; &#xAC00;&#xB294; &#xAC83;&#xC774; &#xC7A0;&#xC7AC;&#xC801;&#xC778; &#xB9CE;&#xC740; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC744; &#xB5A0;&#xB098;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xB2E4;&#xC591;&#xD55C; &#xC131;&#xBCC0;&#xACFC; &#xB2E4;&#xB978; &#xADF8;&#xB8F9;&#xB4E4;&#xC744; &#xD658;&#xC601;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xBA74; &#xC7AC;&#xB2A5;&#xC758; &#xD070; &#xADF8;&#xB8F9;&#xC73C;&#xB85C;&#xBD80;&#xD130; &#xCC44;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xD68C;&#xB97C; (&#xC5B4;&#xCA4C;&#xBA74; &#xC601;&#xC6D0;&#xD788;) &#xC783;&#xAC8C; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xB610;&#xD55C; &#xB098;&#xC05C; &#xD3C9;&#xD310;&#xC740; &#xC870;&#xC9C1;&#xC744; &#xC5BC;&#xB8E9;&#xC9C0;&#xAC8C; &#xB9CC;&#xB4E4; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p><em>To-do lists</em></p>
<p>When people have been using your code for a while, they begin to ask how they can help. Provide a prominent list of tasks that you&#x2014;and other members of the community&#x2014;have identified as priorities. </p>
<p><em>&#xD574;&#xC57C;&#xD560; &#xC77C; &#xBAA9;&#xB85D;</em></p>
<p>&#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xC77C;&#xC815; &#xAE30;&#xAC04;&#xB3D9;&#xC548; &#xCF54;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C;, &#xC5B4;&#xB5BB;&#xAC8C; &#xADF8;&#xB4E4;&#xC774; &#xB3C4;&#xC6B8; &#xC218; &#xC788;&#xC744;&#xC9C0; &#xBB3C;&#xC5B4;&#xBCF4;&#xAE30; &#xC2DC;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xC57C;&#xD560; &#xC77C;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC9C1;&#xC811;&#x2014; &#xADF8;&#xB9AC;&#xACE0; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC758; &#xB2E4;&#xB978; &#xD68C;&#xC6D0;&#xB4E4;&#xC774;&#x2014; &#xC9C0;&#xC815;&#xD55C; &#xC6B0;&#xC120;&#xC21C;&#xC704;&#xC5D0; &#xB530;&#xB974;&#xB294; &#xBA85;&#xD655;&#xD55C; &#xBAA9;&#xB85D;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC138;&#xC694;. </p>
<p>You need to assess at different stages in development how much time you can dedicate to the community; hopefully others will start to pick up the task and answer questions. Ultimately, though, you&#x2019;ll lose users unless you take their needs seriously, support them in creating the features they want, and give them a say. Hiring a community manager is a good investment: such a member of your staff can educate both company employees and outside community members about how to help the project progress smoothly and productively. As the project grows big and widely adopted, it might become time to hand control over to an independent governance organization altogether, which is the topic of an upcoming section (<a href="https://d1.awsstatic.com/Open%20Source/enterprise-oss-book.pdf" target="_blank">&#x201C;Release the Project to an Independent Governance Organization&#x201D; on page 24</a>). 
For an in-depth discussion of how to work well with a community, the book The Art of Community by Jono Bacon (O&#x2019;Reilly, 2012) is very useful. </p>
<p>&#xC5BC;&#xB9C8;&#xB098; &#xB9CE;&#xC740; &#xC2DC;&#xAC04;&#xC744; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC5D0; &#xC3DF;&#xC744; &#xC218; &#xC788;&#xC744;&#xC9C0;&#xB97C; &#xAC1C;&#xBC1C; &#xB2E8;&#xACC4;&#xC5D0; &#xB530;&#xB77C; &#xAC00;&#xB2A0;&#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;; &#xBC14;&#xB77C;&#xAC74;&#xB300; &#xB2E4;&#xB978;&#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xD560; &#xC77C;&#xC744; &#xACE0;&#xB974;&#xACE0; &#xC9C8;&#xBB38;&#xC5D0; &#xB2F5;&#xBCC0;&#xD558;&#xAE30; &#xC2DC;&#xC791;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xAD81;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC758; &#xC694;&#xAD6C;&#xB97C; &#xC9C4;&#xC9C0;&#xD558;&#xAC8C; &#xBC1B;&#xC544;&#xB4E4;&#xC774;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xBA74; &#xADF8;&#xB4E4;&#xC744; &#xC783;&#xAC8C;&#xB420; &#xAC83;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xADF8;&#xB4E4;&#xC774; &#xC6D0;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xACE0;, &#xBAA9;&#xC18C;&#xB9AC;&#xB97C; &#xB0B4;&#xB3C4;&#xB85D; &#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;. &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAD00;&#xB9AC;&#xC790;&#xB97C; &#xACE0;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC88B;&#xC740; &#xD22C;&#xC790;&#xC785;&#xB2C8;&#xB2E4;: &#xAC00;&#xB839; &#xC9C1;&#xC6D0;&#xC911;&#xC758; &#xD55C; &#xC0AC;&#xB78C;&#xC740; &#xD68C;&#xC0AC; &#xC9C1;&#xC6D0;&#xB4E4;&#xACFC; &#xC678;&#xBD80; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xC0AC;&#xB78C;&#xB4E4; &#xBAA8;&#xB450;&#xC5D0;&#xAC8C; &#xC5B4;&#xB5BB;&#xAC8C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xC9C4;&#xD589;&#xC744; &#xBD80;&#xB4DC;&#xB7FD;&#xACE0; &#xC0DD;&#xC0B0;&#xC801;&#xC73C;&#xB85C; &#xB3C4;&#xC6B8; &#xC218; &#xC788;&#xC744;&#xC9C0;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xAD50;&#xC721;&#xD560; &#xC218; &#xC788;&#xC744; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xD06C;&#xAC8C; &#xC131;&#xC7A5;&#xD558;&#xACE0; &#xB110;&#xB9AC; &#xCC44;&#xD0DD;&#xB418;&#xBA74;, &#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xC6B4;&#xC601; &#xCCB4;&#xACC4;&#xB97C; &#xAC00;&#xC9C4; &#xB2E8;&#xCCB4;&#xB85C; &#xD1B5;&#xC81C;&#xAD8C;&#xC744; &#xB118;&#xACA8;&#xC904; &#xB54C;&#xAC00; &#xC62C;&#xC9C0;&#xB3C4; &#xBAA8;&#xB985;&#xB2C8;&#xB2E4;. &#xC774;&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xBA85;&#xC740; &#xBC14;&#xB85C; &#xB2E4;&#xC74C;&#xC7A5; (<a href="https://github.com/KMU-OSS-Laboratory/Open-Source-in-the-Enteprise/blob/master/src/10-launching-an-open-source-project.md#&#xB3C5;&#xB9BD;&#xB41C;-&#xAD00;&#xB9AC;-&#xC870;&#xC9C1;&#xC5D0;-&#xD504;&#xB85C;&#xC81D;&#xD2B8;-&#xB9B4;&#xB9AC;&#xC988;&#xD558;&#xAE30;" target="_blank">&#xB3C5;&#xB9BD;&#xB41C; &#xAD00;&#xB9AC; &#xC870;&#xC9C1;&#xC5D0; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB9B4;&#xB9AC;&#xC988;&#xD558;&#xAE30;</a>)&#xC5D0;&#xC11C; &#xB2E4;&#xB904;&#xC9D1;&#xB2C8;&#xB2E4;.<br>&#xC5B4;&#xB5BB;&#xAC8C; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xC548;&#xC5D0;&#xC11C; &#xC798; &#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xC2EC;&#xB3C4;&#xC788;&#xB294; &#xB17C;&#xC758;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294;, Jono Bacon&#xC758; &#xCC45; <em><a href="http://shop.oreilly.com/product/0636920021995.do" target="_blank">The Art of Community</a></em> (O&apos;Reilly, 2012) &#xAC00; &#xAD49;&#xC7A5;&#xD788; &#xC720;&#xC6A9;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. </p>
<h4 id="keep-up-communication">Keep Up Communication</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<p>Talking with a community goes beyond public relations, which typically focus on press releases about major events. You want the community and the world at large to know about evolution in the project before, during, and after each step. Encourage your employees to blog and use social media in appropriate ways to get the news out. Consider a commitment to recruit an informative post at least once every two weeks from someone in the community (and even more often for large projects) along with regular tweets. A small investment in branding, such as stickers that community members can put on their laptops, or socks and t-shirts, shows pride in the project and gets the name where it is seen by the people you want. Such practices attract new users and remind existing community members that you have a vibrant project.</p>
<p>&#xBCF4;&#xD1B5; &#xC8FC;&#xC694; &#xC774;&#xBCA4;&#xD2B8;&#xC5D0; &#xB300;&#xD55C; &#xBCF4;&#xB3C4;&#xC5D0; &#xC9D1;&#xC911;&#xD558;&#xB294; PR(public relation) &#xD65C;&#xB3D9;&#xACFC; &#xB2EC;&#xB9AC; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC640;&#xC758; &#xC18C;&#xD1B5;&#xC740; &#xADF8; &#xC774;&#xC0C1;&#xC744; &#xD544;&#xC694;&#xB85C; &#xD569;&#xB2C8;&#xB2E4;. &#xD68C;&#xC0AC;&#xB77C;&#xBA74; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC640; &#xC804; &#xC138;&#xACC4;&#xAC00; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC9C4;&#xD589; &#xB2E8;&#xACC4;&#xC758; &#xC774;&#xC804;, &#xACFC;&#xC815; &#xBC0F; &#xC774;&#xD6C4;&#xC758; &#xC9C4;&#xD654;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xAE30;&#xB97C; &#xC6D0;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC9C1;&#xC6D0;&#xB4E4;&#xC774; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xAE00;&#xC744; &#xAC8C;&#xC2DC;&#xD558;&#xAC70;&#xB098; &#xC18C;&#xC15C;&#xBBF8;&#xB514;&#xC5B4; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xADF8; &#xC0C8;&#xB85C;&#xC6B4; &#xC18C;&#xC2DD;&#xC744; &#xC804;&#xD558;&#xB3C4;&#xB85D; &#xB3C5;&#xB824;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xB0B4;&#xC758; &#xB204;&#xAD70;&#xAC00;&#xAC00; &#xC801;&#xC5B4;&#xB3C4; 2 &#xC8FC;&#xC77C;&#xC5D0; &#xD55C; &#xBC88; &#xC774;&#xC0C1;&#xC740; (&#xD070; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xACBD;&#xC6B0; &#xB354; &#xC790;&#xC8FC;) &#xC815;&#xAE30;&#xC801;&#xC778; &#xD2B8;&#xC717;&#xC744; &#xBC18;&#xB4DC;&#xC2DC; &#xD574;&#xC57C;&#xD55C;&#xB2E4;&#xACE0; &#xC815;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xBA64;&#xBC84;&#xB4E4;&#xC774; &#xB178;&#xD2B8;&#xBD81;&#xC774;&#xB098; &#xC591;&#xB9D0; &#xBC0F; &#xD2F0;&#xC154;&#xCE20; &#xB4F1;&#xC5D0; &#xBD99;&#xC77C; &#xC218; &#xC788;&#xB294; &#xC2A4;&#xD2F0;&#xCEE4;&#xB97C; &#xB9CC;&#xB4DC;&#xB294; &#xAC83;&#xACFC; &#xAC19;&#xC740; &#xC791;&#xC740; &#xBE0C;&#xB79C;&#xB4DC; &#xD22C;&#xC790;&#xB294; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xB300;&#xD55C; &#xC790;&#xBD80;&#xC2EC;&#xC744; &#xB4DC;&#xB7EC;&#xB0B4;&#xACE0;, &#xCC38;&#xC5EC;&#xB97C; &#xD558;&#xBA74; &#xC88B;&#xACA0;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xB294; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xBCFC; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC774;&#xB984;&#xC744; &#xC54C;&#xB9AC;&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC774; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xD65C;&#xB3D9;&#xC740; &#xC0C8;&#xB85C;&#xC6B4; &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xC720;&#xCE58;&#xD558;&#xACE0; &#xAE30;&#xC874; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xBA64;&#xBC84;&#xB4E4;&#xC5D0;&#xAC8C; &#xC774; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xD65C;&#xBC1C;&#xD55C; &#xD65C;&#xB3D9;&#xC744; &#xD558;&#xB294; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC784;&#xC744; &#xC0C1;&#xAE30;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.</p>
<h4 id="adopt-metrics-and-measurement">Adopt Metrics and Measurement</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC911; : &#xC624;&#xC5F0;&#xD638;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<p>We are a data-driven society. All organizations must learn how to collect useful
metrics and educate employees on how to use the data when making decisions.
Some metrics are easier to collect than others, so you need to determine what&#x2019;s
really useful to you. Begin by collecting lots of metrics; then, over time, as you
find out which ones are really useful, you can scale back. Typical metrics include
the following:</p>
<ul>
<li>Numbers of contributors and contributions, and what people and places they
come from</li>
<li>Number of users, which you might be able to calculate roughly from statis&#x2010;
tics on downloads, mailing list participation, and other proxies</li>
<li>Growth or shrinkage of the contributor mailing list</li>
<li>Numbers of reported issues, bugs, and fixes</li>
<li>Number of forks and stars on GitHub</li>
<li>Page views of web pages, blogs, and tweets associated with your project</li>
</ul>
<p>The <a href="https://chaoss.community/" target="_blank">CHAOSS Community</a>] is defining
<a href="http://bit.ly/2sWYq7u" target="_blank">metrics</a> that are useful to collect across most projects.</p>
<p>Generally, you want to see the measures increase. Even an increase in reported
bugs can be a good thing because it shows that the code is useful. The speed with
which reported bugs are fixed can be a more important metric. If pull requests
stagnate or go down, you need to think of ways to promote the project&#x2014;or per&#x2010;
haps it&#x2019;s time to launch an effort to add new features that make the project more
appealing.</p>
<p>If most of your contributions are coming from a couple of organizations, you
might need to encourage more diversity. There is a risk that your code will be
optimized for one or two major users, losing value for other potential users. And,
if a major contributor suddenly pulls out, you can be left without crucial support.</p>
<p>Different metrics are useful in different circumstances. For some projects, it&#x2019;s all
right for pull requests and community participation to stabilize. Perhaps your
project has a narrow application but is very useful for the people who need it.</p>
<p>Your measurements can become part of a continuous improvement process.
Make them available to managers through dashboards and encourage managers
to pull them up at meetings and during the process of prioritizing future work.
As with nearly all software, good open source tools exist for dashboards and
visualizations displaying metrics. <a href="https://bitergia.com/opensource/" target="_blank">Bitergia</a>
offers open source dashboards, and Amazon has released an
<a href="http://bit.ly/2LOzGVL" target="_blank">OSS attribution builder</a> and
<a href="http://bit.ly/2JDTA9k" target="_blank">OSS contribution tracker</a> that
their OSPO uses to manage its open source projects.</p>
<h4 id="&#xCE21;&#xC815;-&#xAE30;&#xC900;&#xC744;-&#xC120;&#xD0DD;&#xD558;&#xACE0;-&#xADF8;&#xC5D0;-&#xB530;&#xB77C;-&#xCE21;&#xC815;&#xD558;&#xAE30;">&#xCE21;&#xC815; &#xAE30;&#xC900;&#xC744; &#xC120;&#xD0DD;&#xD558;&#xACE0; &#xADF8;&#xC5D0; &#xB530;&#xB77C; &#xCE21;&#xC815;&#xD558;&#xAE30;</h4>
<p>&#xBAA8;&#xB4E0; &#xC870;&#xC9C1;&#xC740; &#xC720;&#xC6A9;&#xD55C; &#xCE21;&#xC815; &#xAE30;&#xC900;(metrics)&#xB4E4;&#xC744; &#xC218;&#xC9D1;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xBC30;&#xC6B0;&#xACE0;
&#xC758;&#xC0AC; &#xACB0;&#xC815;&#xC2DC; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB2E4;&#xB8E8;&#xB294; &#xBC95;&#xC744; &#xC9C1;&#xC6D0;&#xC5D0;&#xAC8C; &#xAC00;&#xB974;&#xCCD0;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;.
&#xC77C;&#xBD80; &#xCE21;&#xC815; &#xAE30;&#xC900;&#xC740; &#xB2E4;&#xB978; &#xAC83;&#xB4E4; &#xBCF4;&#xB2E4; &#xBAA8;&#xC73C;&#xAE30; &#xC27D;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;,
&#xCE21;&#xC815; &#xAE30;&#xC900;&#xC744; &#xACE0;&#xB97C; &#xB550; &#xC2E4;&#xC81C;&#xB85C; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC5D0;&#xAC8C; &#xC720;&#xC6A9;&#xD55C; &#xAC83;&#xC774; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xACB0;&#xC815;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.
&#xB530;&#xB77C;&#xC11C; &#xBA3C;&#xC800; &#xB9CE;&#xC740; &#xCE21;&#xC815; &#xAE30;&#xC900;&#xB4E4;&#xC744; &#xBAA8;&#xC740; &#xB4A4;&#xC5D0; &#xADF8; &#xC911; &#xC720;&#xC6A9;&#xD55C; &#xAC83;&#xB4E4;&#xB9CC; &#xACE8;&#xB77C;&#xB0B4;&#xBA70; &#xC218;&#xB97C; &#xC904;&#xC5EC;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.
&#xC77C;&#xBC18;&#xC801;&#xC778; &#xCE21;&#xC815; &#xAE30;&#xC900;&#xB4E4;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ul>
<li>&#xCEE8;&#xD2B8;&#xB9AC;&#xBDF0;&#xD130; &#xC778;&#xC6D0;&#xACFC; &#xAE30;&#xC5EC; &#xC218;</li>
<li>&#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xC218;, &#xBA54;&#xC77C; &#xBAA9;&#xB85D; &#xB4F1;&#xC758; &#xC811;&#xADFC; &#xD1B5;&#xACC4;&#xB85C; &#xC0B0;&#xCD9C; &#xAC00;&#xB2A5;&#xD55C; &#xC0AC;&#xC6A9;&#xC790; &#xC218;</li>
<li>&#xCEE8;&#xD2B8;&#xB9AC;&#xBDF0;&#xD130;&#xC758; &#xC99D;&#xAC00; &#xD639;&#xC740; &#xAC10;&#xC18C;</li>
<li>&#xC81C;&#xBCF4;&#xB41C; &#xC774;&#xC288; &#xBC0F; &#xBC84;&#xADF8;&#xC640; &#xD574;&#xACB0; &#xC218;</li>
<li>GitHub &#xC5D0;&#xC11C; &#xD3EC;&#xD06C; &#xB41C; &#xD69F;&#xC218; &#xBC0F; &#xC2A4;&#xD0C0; &#xAC1C;&#xC218;</li>
<li>&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;, &#xBE14;&#xB85C;&#xADF8;, &#xD2B8;&#xC704;&#xD130; &#xB4F1;&#xC758; &#xBC29;&#xBB38;&#xC790; &#xC218;</li>
</ul>
<p><a href="https://chaoss.community/" target="_blank">CHAOSS &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;</a> &#xC5D0;&#xC120; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xC801;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C;
<a href="http://bit.ly/2sWYq7u" target="_blank">&#xCE21;&#xC815; &#xAE30;&#xC900;</a> &#xB4E4;&#xC744; &#xC815;&#xC758;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xBCF4;&#xD1B5; &#xCE21;&#xC815; &#xACB0;&#xACFC;&#xAC00; &#xB354; &#xB192;&#xAC8C; &#xB098;&#xC624;&#xAE30;&#xB97C; &#xC6D0;&#xD560; &#xAC81;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xBC84;&#xADF8; &#xC81C;&#xBCF4;&#xAC00; &#xB298;&#xC5B4;&#xB09C;&#xB2E4;
&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xB099;&#xB2F4;&#xD558;&#xC9C0;&#xB294; &#xB9D9;&#xC2DC;&#xB2E4;. &#xC774;&#xB294; &#xCF54;&#xB4DC;&#xAC00; &#xADF8;&#xB9CC;&#xD07C; &#xC720;&#xC6A9;&#xD558;&#xB2E4;&#xB294; &#xB73B;&#xC774;&#xBA70;,
&#xC624;&#xD788;&#xB824; &#xBC84;&#xADF8; &#xD574;&#xACB0; &#xC18D;&#xB3C4;&#xAC00; &#xB354; &#xC911;&#xC694;&#xD55C; &#xCE21;&#xC815; &#xAE30;&#xC900;&#xC774; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.
&#xB9CC;&#xC57D; PR &#xC774; &#xB4E4;&#xC5B4;&#xC624;&#xB294; &#xD69F;&#xC218;&#xAC00; &#xC810;&#xC810; &#xC904;&#xC5B4;&#xB4E0;&#xB2E4;&#xBA74;, &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xD64D;&#xBCF4;&#xD558;&#xAC70;&#xB098;
&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xB354; &#xB9E4;&#xB825;&#xC801;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4; &#xC904; &#xC0C8; &#xAE30;&#xB2A5;&#xC744; &#xCD94;&#xAC00;&#xD560; &#xB54C;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB300;&#xBD80;&#xBD84;&#xC758; &#xAE30;&#xC5EC;&#xAC00; &#xC18C;&#xC218;&#xC758; &#xC870;&#xC9C1;&#xC5D0;&#xC11C;&#xB9CC; &#xC62C; &#xACBD;&#xC6B0; &#xB2E4;&#xC591;&#xC131;&#xC744; &#xC7A5;&#xB824;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.
&#xCF54;&#xB4DC;&#xAC00; &#xD55C; &#xB450;&#xBA85;&#xC758; &#xC8FC;&#xC694; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xB9DE;&#xCDB0;&#xC11C; &#xCD5C;&#xC801;&#xD654; &#xB420; &#xACBD;&#xC6B0;, &#xB2E4;&#xB978; &#xC7A0;&#xC7AC;&#xC801; &#xC720;&#xC800;&#xB4E4;&#xC744; &#xC783;&#xC744; &#xC218;
&#xC788;&#xB294;&#xB370;&#xB2E4;&#xAC00; &#xADF8; &#xC8FC;&#xC694; &#xAE30;&#xC5EC;&#xC790;&#xAC00; &#xAC11;&#xC790;&#xAE30; &#xADF8;&#xB9CC;&#xB450;&#xAC8C; &#xB418;&#xBA74; &#xC911;&#xC694;&#xD55C; &#xC9C0;&#xC6D0;&#xC774; &#xB04A;&#xC5B4;&#xC9C0;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xCE21;&#xC815; &#xAE30;&#xC900;&#xC740; &#xC0C1;&#xD669;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.
&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xD2B9;&#xC815; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xC704;&#xD55C; &#xD2B9;&#xC218; &#xBAA9;&#xC801;&#xC744; &#xAC16;&#xB294; &#xBA87;&#xBA87; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294;
&#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xCC38;&#xC5EC;&#xC640; PR &#xC774; &#xC548;&#xC815;&#xB418;&#xB294; &#xD3B8;&#xC774; &#xB354; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xCE21;&#xC815; &#xACB0;&#xACFC;&#xB294; &#xC9C0;&#xC18D;&#xB418;&#xB294; &#xBC1C;&#xC804; &#xACFC;&#xC815;&#xC758; &#xC77C;&#xBD80;&#xAC00; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.
&#xAD00;&#xB9AC;&#xC790;&#xAC00; &#xC774; &#xACB0;&#xACFC;&#xB97C; &#xB300;&#xC2DC;&#xBCF4;&#xB4DC;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xAC8C; &#xD558;&#xC5EC; &#xD68C;&#xC758;&#xB098;
&#xD5A5;&#xD6C4; &#xC791;&#xC5C5;&#xC758; &#xC6B0;&#xC120; &#xC21C;&#xC704;&#xB97C; &#xACB0;&#xC815;&#xD558;&#xB294;&#xB370; &#xCC38;&#xACE0;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD558;&#xC2ED;&#xC2DC;&#xC624;.
&#xAC70;&#xC758; &#xBAA8;&#xB4E0; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C;, &#xCE21;&#xC815; &#xAE30;&#xC900;&#xC744; &#xD45C;&#xC2DC;&#xD558;&#xB294; &#xB300;&#xC2DC; &#xBCF4;&#xB4DC; &#xBC0F; &#xC2DC;&#xAC01;&#xD654;&#xC5D0; &#xC801;&#xD569;&#xD55C;
&#xC88B;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD234;&#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. <a href="https://bitergia.com/opensource/" target="_blank">Bitergia</a> &#xB294;
&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xB300;&#xC2DC; &#xBCF4;&#xB4DC;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xACE0;, &#xC544;&#xB9C8;&#xC874;&#xC740; &#xC790;&#xC2E0;&#xB4E4;&#xC758; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xBD80;&#xC11C;&#xC5D0;&#xC11C;
&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xD558;&#xB294; <a href="http://bit.ly/2LOzGVL" target="_blank">OSS attribution builder</a> &#xC640;
<a href="http://bit.ly/2JDTA9k" target="_blank">OSS contribution tracker</a> &#xB97C; &#xCD9C;&#xC2DC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h4 id="release-the-project-to-an-independent-governance-organization">Release the Project to an Independent Governance Organization</h4>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC911; : &#xC624;&#xC5F0;&#xD638;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xC644;&#xB8CC; : &#xC774;&#xBBFC;&#xC11D;)</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h4 id="&#xB3C5;&#xB9BD;&#xB41C;-&#xAD00;&#xB9AC;-&#xC870;&#xC9C1;&#xC5D0;-&#xD504;&#xB85C;&#xC81D;&#xD2B8;-&#xB9B4;&#xB9AC;&#xC988;&#xD558;&#xAE30;">&#xB3C5;&#xB9BD;&#xB41C; &#xAD00;&#xB9AC; &#xC870;&#xC9C1;&#xC5D0; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB9B4;&#xB9AC;&#xC988;&#xD558;&#xAE30;</h4>
<p>Suppose that you have followed the advice of this book and the resources to
which we&#x2019;ve pointed you. Your project looks like a success and is being adopted
by people outside your organization. 
When the project is big and stable enough,
it&#x2019;s probably valuable to make it independent from your company. This will fur&#x2010;
ther encourage other organizations to support it, financially and otherwise. It will announce to the world that the project is sustainable and does not depend on your own management decisions for its future, 
which in turn will draw more people to use it and contribute to it. 
But because making an independent foundation is a lot of work, you should wait for clear evidence that it&#x2019;s important; 
for instance, requests from major contributors or the need to raise funds outside your own organization.</p>
<p>&#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xC774; &#xCC45;&#xC758; &#xC870;&#xC5B8;&#xACFC; &#xC790;&#xB8CC;&#xB4E4;&#xC744; &#xC798; &#xB530;&#xB77C;&#xC654;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;.
&#xC5EC;&#xB7EC;&#xBD84;&#xC758; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xC131;&#xACF5;&#xD55C; &#xAC83;&#xCC98;&#xB7FC; &#xBCF4;&#xC77C; &#xAC83;&#xC774;&#xBA70;, &#xC870;&#xC9C1; &#xC678;&#xBD80;&#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC8C;&#xB3C4; &#xC54C;&#xB824;&#xC9C0;&#xACE0; &#xCC44;&#xD0DD;&#xB420; &#xAC81;&#xB2C8;&#xB2E4;. 
&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xCEE4;&#xC9C0;&#xACE0; &#xCDA9;&#xBD84;&#xD788; &#xC548;&#xC815;&#xB418;&#xBA74;, &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xD68C;&#xC0AC;&#xB85C;&#xBD80;&#xD130;
&#xB3C5;&#xB9BD;&#xC2DC;&#xD0A4;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xB2E4;&#xB978; &#xC870;&#xC9C1;&#xB4E4;&#xC774; &#xC7AC;&#xC815;&#xC801;&#xC73C;&#xB85C;, &#xD639;&#xC740; &#xB2E4;&#xB978; &#xBC29;&#xBC95;&#xC73C;&#xB85C;
&#xADF8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xB354; &#xC798; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xAC83;&#xC744; &#xB3C4;&#xC640;&#xC90D;&#xB2C8;&#xB2E4;.
&#xB610; &#xC774;&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xC9C0;&#xC18D;&#xC131; &#xC788;&#xACE0;, &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xBBF8;&#xB798;&#xC5D0; &#xB300;&#xD55C; &#xC758;&#xC0AC;&#xACB0;&#xC815;&#xC774;
&#xD68C;&#xC0AC;&#xC758; &#xACBD;&#xC601;&#xC801; &#xD310;&#xB2E8;&#xC5D0; &#xC758;&#xC874;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xAC83;&#xC744; &#xC138;&#xC0C1;&#xC5D0; &#xC54C;&#xB9AC;&#xB294; &#xAE38;&#xC774;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.
&#xADF8;&#xB7FC;&#xC73C;&#xB85C;&#xC368; &#xB354; &#xB9CE;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0;, &#xAE30;&#xC5EC;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.
&#xD558;&#xC9C0;&#xB9CC; &#xADF8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC704;&#xD574; &#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xC7AC;&#xB2E8;&#xC744; &#xC124;&#xB9BD;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC77C;&#xC774; &#xB9E4;&#xC6B0; &#xB9CE;&#xC544;&#xC11C; &#xC815;&#xB9D0; &#xC7AC;&#xB2E8; &#xC124;&#xB9BD;&#xC774; &#xC911;&#xC694;&#xD55C;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xBA85;&#xD655;&#xD55C; &#xC774;&#xC720;&#xAC00; &#xC0DD;&#xAE34; &#xD6C4;&#xC5D0; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74;, &#xC8FC;&#xC694; &#xAE30;&#xC5EC;&#xC790;&#xB4E4;&#xC758; &#xC694;&#xCCAD;&#xC774; &#xC788;&#xAC70;&#xB098; &#xC678;&#xBD80;&#xC758; &#xC870;&#xC9C1;&#xC5D0;&#xC11C; &#xC790;&#xAE08;&#xC744; &#xBAA8;&#xC544;&#xC57C; &#xD560;&#xB54C; &#xB9D0;&#xC774;&#xC8E0;.</p>
<p>Setting up a foundation is a complex task. A few major projects set up independent foundations, such as <a href="http://bit.ly/2LQAtWa" target="_blank">Linux</a>, <a href="https://mzl.la/2HOXeaO" target="_blank">Mozilla</a>,
and <a href="http://bit.ly/2LPYjBx" target="_blank">OpenStack</a>, but the vast majority of
open source projects&#x2014;even such popular tools as the
<a href="https://spark.apache.org/" target="_blank">Spark data processing tool</a> &#x2014;work under the auspices of an existing foundation. <a href="http://bit.ly/2JCHspm" target="_blank">The Apache Software Foundation</a>,
<a href="http://bit.ly/2MsxzZd" target="_blank">Eclipse Foundation</a>, and <a href="http://bit.ly/2JAiZRr" target="_blank">Linux Foundation</a>
sponsor wide varieties of software that extend beyond their original missions.
Other organizations serve particular industries, such as <a href="http://www.hl7.org/" target="_blank">HL7</a>
for health care and <a href="https://www.automotivelinux.org/" target="_blank">Automotive Grade Linux</a>
for software in cars.</p>
<p>&#xC7AC;&#xB2E8;&#xC744; &#xC138;&#xC6B4;&#xB2E4;&#xB294;&#xAC74; &#xBCF5;&#xC7A1;&#xD55C; &#xC77C;&#xC785;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; <a href="http://bit.ly/2LQAtWa" target="_blank">Linux</a>,
<a href="https://mzl.la/2HOXeaO" target="_blank">Mozilla</a>, <a href="http://bit.ly/2LPYjBx" target="_blank">OpenStack</a> &#xB4F1;&#xC758;
&#xBA87;&#xBA87; &#xC8FC;&#xC694; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xB3C5;&#xB9BD; &#xC7AC;&#xB2E8;&#xC744; &#xC138;&#xC6E0;&#xC9C0;&#xB9CC;, &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294;
-<a href="https://spark.apache.org/" target="_blank">Spark &#xB370;&#xC774;&#xD130; &#xCC98;&#xB9AC; &#xD234;</a> &#xB4F1;&#xC758; &#xC720;&#xBA85;&#xD55C; &#xD234;&#xB3C4; &#xD3EC;&#xD568;&#xD574;&#xC11C;-
&#xAE30;&#xC874; &#xC7AC;&#xB2E8;&#xC758; &#xD6C4;&#xC6D0; &#xD558;&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <a href="http://bit.ly/2JCHspm" target="_blank">&#xC544;&#xD30C;&#xCE58; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC7AC;&#xB2E8;</a>,
<a href="http://bit.ly/2MsxzZd" target="_blank">&#xC774;&#xD074;&#xB9BD;&#xC2A4; &#xC7AC;&#xB2E8;</a>, <a href="http://bit.ly/2JAiZRr" target="_blank">&#xB9AC;&#xB205;&#xC2A4; &#xC7AC;&#xB2E8;</a> &#xB4F1;&#xC740; &#xC790;&#xC2E0;&#xB4E4;&#xC758; &#xC6D0;&#xB798; &#xBBF8;&#xC158;&#xC744; &#xB6F0;&#xC5B4;&#xB118;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xD6C4;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;. 
&#xADF8;&#xBC16;&#xC5D0;&#xB3C4; &#xD5EC;&#xC2A4;&#xCF00;&#xC5B4; &#xBD84;&#xC57C;&#xC758; <a href="http://www.hl7.org/" target="_blank">HL7</a>&#xC774;&#xB098; &#xC790;&#xB3D9;&#xCC28; &#xBD84;&#xC57C;&#xC758;
<a href="https://www.automotivelinux.org/" target="_blank">Automotive Grade Linux</a> &#xB4F1;, &#xD2B9;&#xC815; &#xC0B0;&#xC5C5;&#xC744; &#xCDE8;&#xAE09;&#xD558;&#xB294; &#xC870;&#xC9C1;&#xB4E4;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="09-contributing-to-open-source-project.html" class="navigation navigation-prev " aria-label="Previous page: 오픈소스 프로젝트에 기여하기">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="11-open-source-and-the-cloud.html" class="navigation navigation-next " aria-label="Next page: 오픈소스와 클라우드">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"오픈소스 프로젝트의 시작","level":"1.11","depth":1,"next":{"title":"오픈소스와 클라우드","level":"1.12","depth":1,"path":"src/11-open-source-and-the-cloud.md","ref":"src/11-open-source-and-the-cloud.md","articles":[]},"previous":{"title":"오픈소스 프로젝트에 기여하기","level":"1.10","depth":1,"path":"src/09-contributing-to-open-source-project.md","ref":"src/09-contributing-to-open-source-project.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"이민석 外","pdf.fontSize":14,"pdf.fontFamily":"NanumGothic","pdf.paperSize":"a5","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"기업에서의 오픈소스","language":"ko","gitbook":"*","description":"Zaheda Bhorat, Andy Oram의 저서 'Open Source in the Enterprise'의 한글 번역본. https://aws.amazon.com/opensource/enterprise-oss-book/","pdf.pageNumbers":true},"file":{"path":"src/10-launching-an-open-source-project.md","mtime":"2019-01-03T08:27:03.907Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-03T08:28:29.523Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

