
<!DOCTYPE HTML>
<html lang="ko" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>오픈소스와 클라우드 · 기업에서의 오픈소스</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="이민석 外">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="12-conclusion.html" />
    
    
    <link rel="prev" href="10-launching-an-open-source-project.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="검색어 입력" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-acknowledgments.html">
            
                <a href="00-acknowledgments.html">
            
                    
                    감사의 글
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-preface.html">
            
                <a href="01-preface.html">
            
                    
                    역자 서문
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03-open-source-in-the-enteprise.html">
            
                <a href="03-open-source-in-the-enteprise.html">
            
                    
                    개괄: 기업에서의 오픈소스
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                <a href="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                    
                    왜 기업과 정부는 오픈소스로 전환하는가?
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05-more-than-a-license-or-even-code.html">
            
                <a href="05-more-than-a-license-or-even-code.html">
            
                    
                    저작권이나 심지어 코드보다 더 중요한 것
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06-groundworks-for-understanding-open-source.html">
            
                <a href="06-groundworks-for-understanding-open-source.html">
            
                    
                    오픈소스를 이해하기 위한 기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07-adopting-and-using-open-source-code.html">
            
                <a href="07-adopting-and-using-open-source-code.html">
            
                    
                    오픈소스 코드의 도입과 사용
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08-participating-in-a-projects-community.html">
            
                <a href="08-participating-in-a-projects-community.html">
            
                    
                    프로젝트 커뮤니티에의 참여
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09-contributing-to-open-source-project.html">
            
                <a href="09-contributing-to-open-source-project.html">
            
                    
                    오픈소스 프로젝트에 기여하기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-launching-an-open-source-project.html">
            
                <a href="10-launching-an-open-source-project.html">
            
                    
                    오픈소스 프로젝트의 시작
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="11-open-source-and-the-cloud.html">
            
                <a href="11-open-source-and-the-cloud.html">
            
                    
                    오픈소스와 클라우드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-conclusion.html">
            
                <a href="12-conclusion.html">
            
                    
                    결어
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-about-authors.html">
            
                <a href="13-about-authors.html">
            
                    
                    저자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-translators.html">
            
                <a href="14-translators.html">
            
                    
                    역자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="15-links.html">
            
                <a href="15-links.html">
            
                    
                    외부 링크
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="../GLOSSARY.html">
            
                <a href="../GLOSSARY.html">
            
                    
                    용어 사전
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBook에 게시
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >오픈소스와 클라우드</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="open-source-and-the-cloud">Open Source and the Cloud</h3>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC; : &#xC815;&#xC6D0;&#xD601;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h3 id="&#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC640;-&#xD074;&#xB77C;&#xC6B0;&#xB4DC;">&#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC640; &#xD074;&#xB77C;&#xC6B0;&#xB4DC;</h3>
<p>The move to open source during the past decade or so has been paralleled by the adoption of cloud computing at many levels: infrastructure, data, and services. In fact, free and open source software is a major driver of the cloud, and service providers&#x2014;many of them listed at the beginning of this book&#x2014;are major crea&#x2010; tors of open source software. Cloud providers rely heavily on open source soft&#x2010; ware such as Linux, and virtualization software such as <a href="https://www.linux-kvm.org/page/Main_Page" target="_blank">KVM</a> and <a href="https://www.xenproject.org" target="_blank">Xen</a>. Customers running their software in the cloud choose open source software for the same reason.</p>
<p>&#xC9C0;&#xB09C; &#xC2ED;&#xC5EC;&#xB144;&#xB3D9;&#xC548; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB85C; &#xC774;&#xB3D9;&#xC740; &#xC778;&#xD504;&#xB77C;&#xC2A4;&#xD2B8;&#xB7ED;&#xCC98;, &#xB370;&#xC774;&#xD130;, &#xC11C;&#xBE44;&#xC2A4;&#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xC218;&#xC900;&#xC5D0;&#xC11C; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xCEF4;&#xD4E8;&#xD305;&#xC744; &#xCC44;&#xD0DD;&#xACFC; &#xBCD1;&#xD589;&#xB418;&#xC5C8;&#xB2E4;. &#xC2E4;&#xC81C;&#xB85C; &#xBB34;&#xB8CC; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;, &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xD074;&#xB77C;&#xC6B0;&#xB4DC;&#xC640; &#xC11C;&#xBE44;&#xC2A4; &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354;&#xC758; &#xC8FC;&#xB41C; &#xB3D9;&#xB825;&#xC774;&#xC5C8;&#xB2E4;. &#xC11C;&#xBE44;&#xC2A4; &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354;&#xB294; &#xC774; &#xCC45;&#xC758; &#xC55E; &#xBD80;&#xBD84;&#xC5D0; &#xB098;&#xC5F4;&#xD55C; &#xBC14; &#xC788;&#xC73C;&#xBA70;, &#xC774;&#xB4E4;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xC8FC;&#xB41C; &#xC81C;&#xC791;&#xC790;&#xC774;&#xB2E4;. &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354;&#xB294; Linux&#xC640; &#xAC19;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;, <a href="https://www.linux-kvm.org/page/Main_Page" target="_blank">KVM</a>&#xACFC; <a href="https://www.xenproject.org" target="_blank">Xen</a> &#xAC19;&#xC740; &#xAC00;&#xC0C1;&#xD654; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC5D0; &#xD06C;&#xAC8C; &#xC758;&#xC874; &#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xACE0;&#xAC1D;&#xB4E4;&#xC774; &#xD074;&#xB77C;&#xC6B0;&#xB4DC;&#xC5D0;&#xC11C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC120;&#xD0DD;&#xD560; &#xB54C; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xAC19;&#xC740; &#xC774;&#xC720;&#xB2E4;.</p>
<p>The key advantage open source software offers both cloud providers and cloud users is its cost-free deployment. You can start up 10 instances of a virtual machine, expand quickly to 30 to meet peak needs, and then shrink back to 10 without trying to keep track of cost per seats, or adjust payments.</p>
<p>&#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354;&#xC640; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xC8FC;&#xB41C; &#xC787;&#xC810;&#xC740; &#xBC30;&#xD3EC;&#xB97C; &#xBB34;&#xB8CC;&#xB85C; &#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xC2DC;&#xC791;&#xD560; &#xB54C;&#xB294; 10&#xAC1C;&#xC758; &#xAC00;&#xC0C1; &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0;, &#xD53C;&#xD06C; &#xB54C;&#xB294; &#xAC10;&#xB2F9;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; 30&#xAC1C;&#xB85C; &#xBE60;&#xB974;&#xAC8C; &#xB298;&#xB9B4; &#xC218; &#xC788;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xB2E4;&#xC2DC; 10&#xAC1C;&#xB85C; &#xC904;&#xC5EC;&#xC11C; &#xBE44;&#xC6A9;&#xC744; &#xC808;&#xC57D;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xC774;&#xB54C; &#xC2DC;&#xD2B8; &#xB77C;&#xC774;&#xC13C;&#xC2A4;&#xB098; &#xBE44;&#xC6A9;&#xC744; &#xC870;&#xC815;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB41C;&#xB2E4;.</p>
<p>Open source software has become a <em>lingua franca</em>, widely known and deeply understood by experienced developers. This increases its appeal to cloud provid&#x2010; ers and customers, because they understand the impacts of using each project. Also, basing a cloud business on well-tested, preexisting software allows you to spin up faster and add more enhancements. For instance, most cloud providers remain competitive by adding all the latest hot technologies such as deep learn&#x2010; ing. The providers realize that making it simpler to operate open source tools has tremendous value to their customers. The most successful new projects are natu&#x2010; rally great candidates for new services. The wealth of high-quality open source options in these areas allows rapid upgrades to services and quickly enhances their platforms for customers&#x2019; development efforts.</p>
<p>&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xACBD;&#xD5D8;&#xB9CE;&#xC740; &#xAC1C;&#xBC1C;&#xC790;&#xC5D0;&#xAC8C; &#xB110;&#xB9AC; &#xC54C;&#xB824;&#xC9C0;&#xACE0; &#xAE4A;&#xC774; &#xC774;&#xD574;&#xB418;&#xBBC0;&#xB85C;&#xC368;, <em>&#xB9C1;&#xAD6C;&#xC544; &#xD504;&#xB791;&#xCE74;</em>(&#xB9C1;&#xAD6C;&#xC544; &#xD504;&#xB791;&#xCE74;&#xB294; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xBAA8;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD654;&#xC790;&#xB4E4;&#xC774; &#xC758;&#xC0AC;&#xC18C;&#xD1B5;&#xC744; &#xD558;&#xAE30; &#xC704;&#xD574; &#xACF5;&#xD1B5;&#xC5B4;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC81C;3&#xC758; &#xC5B8;&#xC5B4;&#xB97C; &#xB9D0;&#xD558;&#xBA70; &#xAD6D;&#xAC00;&#xB098; &#xB2E8;&#xCCB4;&#xC5D0;&#xC11C; &#xACF5;&#xC2DD;&#xC801;&#xC73C;&#xB85C; &#xC815;&#xD55C; &#xC5B8;&#xC5B4;&#xB97C; &#xB73B;&#xD558;&#xB294; &#xACF5;&#xC6A9;&#xC5B4;&#xC640;&#xB294; &#xB2E4;&#xB978; &#xAC1C;&#xB150;&#xC774;&#xB2E4;. &#xC704;&#xD0A4;&#xBC31;&#xACFC;)&#xAC00; &#xB418;&#xC5C8;&#xB2E4;. &#xC774; &#xC810;&#xC774; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354;&#xC640; &#xC18C;&#xBE44;&#xC790;&#xC5D0;&#xAC8C; &#xB354; &#xB9E4;&#xB825;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xAC00;&#xC628;&#xB2E4;. &#xC65C;&#xB0D0;&#xD558;&#xBA74; &#xC774;&#xB4E4;&#xC740; &#xAC01; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC758; &#xC5C4;&#xCCAD;&#xB09C; &#xD30C;&#xAE09;&#xD6A8;&#xACFC;&#xB97C; &#xC774;&#xD574;&#xD558;&#xACE0; &#xC788;&#xAE30;&#xB54C;&#xBB38;&#xC774;&#xB2E4;. &#xB610;&#xD55C;, &#xC774;&#xBBF8; &#xC874;&#xC7AC;&#xD558;&#xBA70;, &#xC798; &#xD14C;&#xC2A4;&#xD2B8;&#xB41C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC0AC;&#xC5C5;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC740; &#xBCF4;&#xB2E4; &#xBE68;&#xB9AC; &#xC2A4;&#xD540; &#xC5C5;&#xD558;&#xACE0;, &#xB354; &#xB9CE;&#xC740; &#xD5A5;&#xC0C1;&#xB41C; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xB300;&#xBD80;&#xBD84; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354;&#xB294; &#xB525; &#xB7EC;&#xB2DD;&#xAC19;&#xC740; &#xCD5C;&#xC2E0; &#xAE30;&#xC220;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xC5EC; &#xCC3D;&#xC758;&#xC801;&#xC73C;&#xB85C; &#xC790;&#xB9AC;&#xB9E4;&#xAE40;&#xD55C;&#xB2E4;. &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xB3C4;&#xAD6C;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC6B4;&#xC601;&#xC744; &#xB2E8;&#xC21C;&#xD654; &#xD558;&#xB294; &#xAC83;&#xC774; &#xACE0;&#xAC1D;&#xB4E4;&#xC5D0;&#xAC8C; &#xC5C4;&#xCCAD;&#xB09C; &#xAC00;&#xCE58;&#xB97C; &#xAC00;&#xC838;&#xB2E4; &#xC900;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C;&#xACE0; &#xC788;&#xB2E4;. &#xAC00;&#xC7A5; &#xC131;&#xACF5;&#xC801;&#xC778; &#xC0C8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xC790;&#xC5F0;&#xC2A4;&#xB7FD;&#xAC8C; &#xAC00;&#xC7A5; &#xD6CC;&#xB96D;&#xD55C; &#xC11C;&#xBE44;&#xC2A4; &#xD6C4;&#xBCF4;&#xAC00; &#xB41C;&#xB2E4;. &#xC774; &#xC601;&#xC5ED;&#xC5D0;&#xC11C; &#xACE0;&#xD488;&#xC9C8;&#xC758; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC635;&#xC158;&#xC740; &#xBE60;&#xB978; &#xC11C;&#xBE44;&#xC2A4; &#xC5C5;&#xADF8;&#xB808;&#xC774;&#xB4DC;&#xB97C; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD558;&#xACE0;, &#xACE0;&#xAC1D;&#xC758; &#xAC1C;&#xBC1C; &#xB178;&#xB825;&#xC744; &#xC704;&#xD55C; &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xBE60;&#xB974;&#xAC8C; &#xAC15;&#xD654;&#xD55C;&#xB2E4;. </p>
<p>Customers also feel safer when cloud providers use open source tools. It reduces the risk of lock-in and allows customers to adopt hybrid solutions that run their applications on multiple cloud providers or using on-premises software as well as cloud providers.</p>
<p>&#xACE0;&#xAC1D; &#xB610;&#xD55C; &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354;&#xAC00; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xB3C4;&#xAD6C;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C;, &#xBCF4;&#xB2E4; &#xC548;&#xC804;&#xD558;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD55C;&#xB2E4;. &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB294; &#xB77D;&#xC778;(&#xAE30;&#xC874; &#xC2DC;&#xC2A4;&#xD15C; &#xB300;&#xCCB4;&#xBE44;&#xC6A9;&#xC774; &#xC5B4;&#xB9C8;&#xC5B4;&#xB9C8;&#xD558;&#xC5EC; &#xAE30;&#xC220; &#xC804;&#xD658;&#xC744; &#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xC0C1;&#xD0DC;, &#xB124;&#xC774;&#xBC84; &#xC0AC;&#xC804;)&#xC758; &#xC704;&#xD5D8;&#xC744; &#xC904;&#xC778;&#xB2E4;. &#xB610;&#xD55C;, &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB294; &#xD558;&#xC774;&#xBE0C;&#xB9AC;&#xB4DC; &#xC194;&#xB8E8;&#xC158;&#xC744; &#xCC44;&#xD0DD;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294;&#xB370;, &#xC774;&#xB294; &#xC5EC;&#xB7EC; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354; &#xC704;&#xC5D0;&#xC11C; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xBFD0; &#xC544;&#xB2C8;&#xB77C;, &#xC628; &#xD504;&#xB808;&#xBBF8;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xAC8C; &#xD574;&#xC900;&#xB2E4;.</p>
<p>Because cloud providers own and manage their services, they are empowered to release tools and support software as open source and thus benefit from com&#x2010; munities that form to improve the software.</p>
<p>&#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354;&#xB294; &#xC790;&#xC2E0;&#xC758; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC18C;&#xC720;&#xD558;&#xACE0; &#xAD00;&#xB9AC;&#xD558;&#xBBC0;&#xB85C;, &#xB3C4;&#xAD6C;&#xC640; &#xC9C0;&#xC6D0; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB85C; &#xB9B4;&#xB9AC;&#xC988; &#xD558;&#xB3C4;&#xB85D; &#xAD8C;&#xD55C;&#xC744; &#xBD80;&#xC5EC;&#xBC1B;&#xB294;&#xB2E4;. &#xC774;&#xB9AC;&#xD558;&#xC5EC;, &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xD5A5;&#xD56D;&#xC2DC;&#xD0A4;&#xB294; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xC774;&#xC810;&#xC744; &#xC5BB;&#xB294;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="10-launching-an-open-source-project.html" class="navigation navigation-prev " aria-label="Previous page: 오픈소스 프로젝트의 시작">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="12-conclusion.html" class="navigation navigation-next " aria-label="Next page: 결어">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"오픈소스와 클라우드","level":"1.12","depth":1,"next":{"title":"결어","level":"1.13","depth":1,"path":"src/12-conclusion.md","ref":"src/12-conclusion.md","articles":[]},"previous":{"title":"오픈소스 프로젝트의 시작","level":"1.11","depth":1,"path":"src/10-launching-an-open-source-project.md","ref":"src/10-launching-an-open-source-project.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"이민석 外","pdf.fontSize":14,"pdf.fontFamily":"NanumGothic","pdf.paperSize":"a5","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"기업에서의 오픈소스","language":"ko","gitbook":"*","description":"Zaheda Bhorat, Andy Oram의 저서 'Open Source in the Enterprise'의 한글 번역본. https://aws.amazon.com/opensource/enterprise-oss-book/","pdf.pageNumbers":true},"file":{"path":"src/11-open-source-and-the-cloud.md","mtime":"2019-01-03T08:27:03.907Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-03T08:28:29.523Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

