
<!DOCTYPE HTML>
<html lang="ko" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>결어 · 기업에서의 오픈소스</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="이민석 外">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="13-about-authors.html" />
    
    
    <link rel="prev" href="11-open-source-and-the-cloud.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="검색어 입력" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-acknowledgments.html">
            
                <a href="00-acknowledgments.html">
            
                    
                    감사의 글
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-preface.html">
            
                <a href="01-preface.html">
            
                    
                    역자 서문
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03-open-source-in-the-enteprise.html">
            
                <a href="03-open-source-in-the-enteprise.html">
            
                    
                    개괄: 기업에서의 오픈소스
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                <a href="04-why-are-companies-and-governments-turning-to-open-source.html">
            
                    
                    왜 기업과 정부는 오픈소스로 전환하는가?
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05-more-than-a-license-or-even-code.html">
            
                <a href="05-more-than-a-license-or-even-code.html">
            
                    
                    저작권이나 심지어 코드보다 더 중요한 것
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06-groundworks-for-understanding-open-source.html">
            
                <a href="06-groundworks-for-understanding-open-source.html">
            
                    
                    오픈소스를 이해하기 위한 기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07-adopting-and-using-open-source-code.html">
            
                <a href="07-adopting-and-using-open-source-code.html">
            
                    
                    오픈소스 코드의 도입과 사용
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08-participating-in-a-projects-community.html">
            
                <a href="08-participating-in-a-projects-community.html">
            
                    
                    프로젝트 커뮤니티에의 참여
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09-contributing-to-open-source-project.html">
            
                <a href="09-contributing-to-open-source-project.html">
            
                    
                    오픈소스 프로젝트에 기여하기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-launching-an-open-source-project.html">
            
                <a href="10-launching-an-open-source-project.html">
            
                    
                    오픈소스 프로젝트의 시작
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-open-source-and-the-cloud.html">
            
                <a href="11-open-source-and-the-cloud.html">
            
                    
                    오픈소스와 클라우드
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.13" data-path="12-conclusion.html">
            
                <a href="12-conclusion.html">
            
                    
                    결어
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="13-about-authors.html">
            
                <a href="13-about-authors.html">
            
                    
                    저자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="14-translators.html">
            
                <a href="14-translators.html">
            
                    
                    역자 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="15-links.html">
            
                <a href="15-links.html">
            
                    
                    외부 링크
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="../GLOSSARY.html">
            
                <a href="../GLOSSARY.html">
            
                    
                    용어 사전
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBook에 게시
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >결어</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#xFEFF;</p>
<h3 id="conclusion">Conclusion</h3>
<ul>
<li>(&#xBC88;&#xC5ED;&#xC644;&#xB8CC;)</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(1&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; : )</li>
<li>(2&#xCC28; &#xB9AC;&#xBDF0; &#xBC18;&#xC601; : )</li>
<li>...</li>
</ul>
<h3 id="&#xACB0;&#xC5B4;">&#xACB0;&#xC5B4;</h3>
<p>The production and use of open source software has matured tremendously over the past decade. From informal collaboration, often around a &#x201C;benevolent dicta&#x2010; tor,&#x201D; it has evolved into a discipline. Community managers, open source program offices, codes of conduct, and other facets of organized development practices are widespread. Websites have become more sophisticated, good communication practices and processes are codified on collaboration sites such as GitHub by groups like the TODO Group, and projects recognize the importance of that long-neglected cousin to source code: documentation.</p>
<p>&#xC9C0;&#xB09C; 10 &#xB144; &#xB3D9;&#xC548; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xC0DD;&#xC0B0;&#xACFC; &#xD65C;&#xC6A9;&#xC740; &#xC5C4;&#xCCAD;&#xB098;&#xAC8C; &#xC131;&#xC219;&#xD574;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC00;&#xB054;&#xC740; &#xC5B4;&#xB5A4; &quot;&#xC790;&#xBE44;&#xB85C;&#xC6B4; &#xB3C5;&#xC7AC;&#xC790;&quot; &#xC8FC;&#xBCC0;&#xC5D0;&#xC11C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xB358; &#xD615;&#xC2DD;&#xC774; &#xC5C6;&#xB294; &#xD611;&#xB825;&#xC5D0;&#xC11C; &#xD558;&#xB098;&#xC758; &#xADDC;&#xC728;&#xB85C; &#xBC1C;&#xC804;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAD00;&#xB9AC;&#xC790;, OSPO(&#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC0AC;&#xBB34;&#xC18C;), &#xD589;&#xB3D9; &#xADDC;&#xBC94;&#xACFC; &#xC870;&#xC9C1;&#xC801;&#xC778; &#xAC1C;&#xBC1C; &#xAD00;&#xD589;&#xACFC; &#xAC19;&#xC740; &#xB2E4;&#xB978; &#xCE21;&#xBA74;&#xB4E4;&#xB3C4; &#xB110;&#xB9AC; &#xBCF4;&#xAE09;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;&#xB294; &#xB354;&#xC6B1; &#xC815;&#xAD50;&#xD574;&#xC9C0;&#xACE0; &#xC88B;&#xC740; &#xC758;&#xC0AC;&#xC18C;&#xD1B5; &#xBC29;&#xC2DD;&#xACFC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; TODO &#xADF8;&#xB8F9;&#xACFC; &#xAC19;&#xC740; &#xADF8;&#xB8F9;&#xC5D0; &#xC758;&#xD574; GitHub&#xC640; &#xAC19;&#xC740; &#xACF5;&#xB3D9; &#xC791;&#xC5C5; &#xC0AC;&#xC774;&#xD2B8;&#xC5D0; &#xB179;&#xC544;&#xB4E4;&#xC5C8;&#xC73C;&#xBA70;, &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB4E4;&#xC740; &#xC815;&#xB9D0; &#xC624;&#xB7AB;&#xB3D9;&#xC548; &#xC911;&#xC694;&#xC131;&#xC774; &#xC778;&#xC2DD;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xB358;, &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xC758; &#xC0AC;&#xCD0C;&#xACA9;&#xC778;, &#xBB38;&#xC11C;&#xC758; &#xC911;&#xC694;&#xC131;&#xC744; &#xC778;&#xC2DD;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>This book described open source as it is conducted by the most advanced, tech&#x2010; nology led companies and government agencies in 2018, with a look toward the future. We have consolidated resources and references to materials that will make your open source ventures successful and answered questions where you might have had concerns. Yes, there&#x2019;s a lot to learn in the adoption, use, and release of open source code. Yet many companies are doing so successfully. They maximize the strategic value of adopting open source through culture change and by investing in support for developers and all employees engaged in these efforts.</p>
<p>&#xC774; &#xCC45;&#xC5D0;&#xC11C;&#xB294; 2018&#xB144;&#xC5D0; &#xAC00;&#xC7A5; &#xAE30;&#xC220; &#xC8FC;&#xB3C4;&#xC801;&#xC778; &#xAE30;&#xC5C5; &#xBC0F; &#xC815;&#xBD80; &#xAE30;&#xAD00;&#xB4E4;&#xC5D0; &#xC758;&#xD574; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xD65C;&#xB3D9;&#xC774; &#xBBF8;&#xB798;&#xC9C0;&#xD5A5;&#xC801;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xB418;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xAE30;&#xC220;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610; &#xC5EC;&#xB7EC; &#xC815;&#xBCF4;&#xC640; &#xCC38;&#xACE0; &#xC790;&#xB8CC;&#xB4E4;&#xC744; &#xC885;&#xD569;&#xD558;&#xC5EC; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB97C; &#xCD94;&#xC9C4;&#xD558;&#xB824;&#xB294; &#xC2DC;&#xB3C4;&#xB97C; &#xC131;&#xACF5;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD558;&#xACE0;, &#xC6B0;&#xB824;&#xB418;&#xB294; &#xBD80;&#xBD84;&#xC5D0; &#xAD00;&#xD55C; &#xC9C8;&#xBB38;&#xC5D0; &#xB2F5;&#xBCC0;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xCC44;&#xD0DD;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xB9B4;&#xB9AC;&#xC2A4; &#xD558;&#xB824;&#xBA74; &#xBC30;&#xC6CC;&#xC57C; &#xD560; &#xAC83;&#xC774; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xB9CE;&#xC740; &#xAE30;&#xC5C5;&#xB4E4;&#xC774; &#xAF64; &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8; &#xAE30;&#xC5C5;&#xB4E4;&#xC740; &#xD68C;&#xC0AC; &#xB0B4;&#xC758; &#xCEEC;&#xCC98;&#xB97C; &#xBC14;&#xAFB8;&#xACE0; &#xC774;&#xB7EC;&#xD55C; &#xB178;&#xB825;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xC640; &#xBAA8;&#xB4E0; &#xC9C1;&#xC6D0;&#xB4E4;&#xC744; &#xC9C0;&#xC6D0;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB97C; &#xCC44;&#xD0DD;&#xC758; &#xC804;&#xB7B5;&#xC801; &#xAC00;&#xCE58;&#xB97C; &#xADF9;&#xB300;&#xD654;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>Thousands of companies use open source software, and many contribute to it. This book showed you how to start your own journey with a pilot project, working with developers and other key stakeholders. Poll your developers to find out whether they are already using open source code. It&#x2019;s important for the members of your organization to learn from their experiences and perhaps to involve them in a more formal policy regarding open source. The community will be a willing mentor as you embark on this journey.</p>
<p>&#xC218; &#xB9CE;&#xC740; &#xD68C;&#xC0AC;&#xAC00; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xB9CE;&#xC740; &#xD68C;&#xC0AC;&#xB4E4;&#xC774; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC5D0; &#xAE30;&#xC5EC;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xAC1C;&#xBC1C;&#xC790; &#xBC0F; &#xAE30;&#xD0C0; &#xC8FC;&#xC694; &#xC774;&#xD574; &#xAD00;&#xACC4;&#xC790;&#xB4E4;&#xACFC; &#xD611;&#xB825;&#xD558;&#xC5EC; &#xD30C;&#xC77C;&#xB7FF; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB85C; &#xC774; &#xACFC;&#xC815;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC124;&#xBA85;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xC774;&#xBBF8; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xC744; &#xC704;&#xD55C; &#xC870;&#xC0AC;&#xB97C;  &#xD574;&#xBCF4;&#xC2ED;&#xC2DC;&#xC624;. &#xC870;&#xC9C1; &#xAD6C;&#xC131;&#xC6D0;&#xB4E4;&#xC774; &#xADF8;&#xB4E4;&#xC758; &#xACBD;&#xD5D8;&#xC744; &#xD1B5;&#xD574; &#xBC30;&#xC6B0;&#xACE0; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xAD00;&#xB828;&#xD55C; &#xC880; &#xB354; &#xACF5;&#xC2DD;&#xC801;&#xC778; &#xC815;&#xCC45;&#xC744; &#xAC00;&#xC9C0;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB294; &#xC774;&#xB7F0; &#xD65C;&#xB3D9;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xAE30;&#xAEBC;&#xC774; &#xBA58;&#xD1A0; &#xC5ED;&#xD560;&#xC744; &#xD574;&#xC904; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>Read some of the documents to which this book points and follow some basic good practices for checking the quality of the open source project. Document what you do and use your experience to determine your next steps.</p>
<p>&#xC774; &#xCC45;&#xC774; &#xCC38;&#xACE0;&#xD558;&#xACE0; &#xC788;&#xB294; &#xBB38;&#xC11C;&#xB4E4; &#xAC00;&#xC6B4;&#xB370; &#xC77C;&#xBD80;&#xB97C; &#xC77D;&#xACE0; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xD488;&#xC9C8;&#xC744; &#xD655;&#xC778;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xBA87; &#xAC00;&#xC9C0; &#xAE30;&#xBCF8;&#xC801;&#xC774;&#xACE0; &#xBAA8;&#xBC94;&#xC801;&#xC778; &#xC0AC;&#xB840;&#xB97C; &#xB530;&#xB974;&#xC2ED;&#xC2DC;&#xC624;. &#xC9C4;&#xD589; &#xC0C1;&#xD669;&#xC744; &#xBB38;&#xC11C;&#xD654;&#xD558;&#xACE0; &#xADF8; &#xACBD;&#xD5D8;&#xC744; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xB2E4;&#xC74C; &#xB2E8;&#xACC4;&#xB97C; &#xACB0;&#xC815;&#xD558;&#xC2ED;&#xC2DC;&#xC624;.</p>
<p>With adjustments and revisions to your corporate practices, you can use open source libraries for such things as deep learning or web development. The big next step is incorporating open source software into your products. An even big&#x2010; ger step is to open your own code and start a new open source project. This book offered an overview of the tasks facing organizations that undertake these efforts, along with pointers to more detailed sources of information.</p>
<p>&#xAE30;&#xC5C5; &#xC5C5;&#xBB34; &#xAD00;&#xD589;&#xC5D0; &#xB300;&#xD55C; &#xC870;&#xC815;&#xACFC; &#xAC1C;&#xC815;&#xC744; &#xD1B5;&#xD574; &#xB525;&#xB7EC;&#xB2DD;&#xC774;&#xB098; &#xC6F9; &#xAC1C;&#xBC1C;&#xACFC; &#xAC19;&#xC740; &#xC601;&#xC5ED;&#xC758; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8; &#xB2E4;&#xC74C; &#xB2E8;&#xACC4;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xC81C;&#xD488;&#xC5D0; &#xD1B5;&#xD569;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xADF8; &#xB2E4;&#xC74C;&#xC758; &#xD070; &#xB2E8;&#xACC4;&#xB294; &#xC6B0;&#xB9AC; &#xCF54;&#xB4DC;&#xB97C; &#xC624;&#xD508;&#xD558;&#xACE0; &#xC0C8;&#xB85C;&#xC6B4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xB354; &#xAD6C;&#xCCB4;&#xC801;&#xC778; &#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB294; &#xC790;&#xB8CC;&#xC640; &#xD568;&#xAED8; &#xC774;&#xB7EC;&#xD55C; &#xB178;&#xB825;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xC870;&#xC9C1;&#xC774; &#xB2F9;&#xBA74;&#xD560; &#xC5EC;&#xB7EC; &#xC77C;&#xB4E4;&#xC5D0; &#xAD00;&#xD558;&#xC5EC; &#xB300;&#xB7B5; &#xC774;&#xC57C;&#xAE30;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Large corporations&#x2019; embrace of open source demonstrates that it is a fixture of software development and becoming the new normal. We can see that software is changing markets and driving the value of all sorts of organizations, ranging from governments to financial services, and including traditional fields such as agriculture and construction. Each organization chooses a balance between building its own software, purchasing closed-source products or services, and consuming or creating open source.</p>
<p>&#xD070; &#xAE30;&#xC5C5;&#xB4E4;&#xC774; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB97C; &#xD3EC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC740; &#xADF8;&#xAC83;&#xC774; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xAC1C;&#xBC1C; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xC815;&#xCC29;&#xB418;&#xACE0; &#xC788;&#xACE0; &#xC0C8;&#xB85C;&#xC6B4; &#xD45C;&#xC900;&#xC774; &#xB418;&#xACE0; &#xC788;&#xC74C;&#xC744; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xC815;&#xBD80;, &#xAE08;&#xC735; &#xC11C;&#xBE44;&#xC2A4; &#xB4F1; &#xBFD0;&#xB9CC;&#xC544;&#xB2C8;&#xB77C; &#xB18D;&#xC5C5; &#xBC0F; &#xAC74;&#xC124;&#xACFC; &#xAC19;&#xC740; &#xC804;&#xD1B5;&#xC801;&#xC778; &#xBD84;&#xC57C;&#xB97C; &#xD3EC;&#xD568;&#xD55C; &#xBAA8;&#xB4E0; &#xC870;&#xC9C1;&#xC5D0; &#xB354; &#xD070; &#xAC00;&#xCE58;&#xB97C; &#xBD80;&#xC5EC;&#xD558;&#xACE0; &#xC2DC;&#xC7A5;&#xC744; &#xBCC0;&#xD654;&#xC2DC;&#xD0A4;&#xACE0; &#xC788;&#xC74C;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC01; &#xC870;&#xC9C1;&#xC740; &#xC790;&#xCCB4;&#xC801;&#xC778; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xAC1C;&#xBC1C;, &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xAC00; &#xC544;&#xB2CC; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC81C;&#xD488; &#xB610;&#xB294; &#xC11C;&#xBE44;&#xC2A4; &#xAD6C;&#xB9E4;, &#xC544;&#xB2C8;&#xBA74; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC758; &#xC0AC;&#xC6A9; &#xB610;&#xB294; &#xAC1C;&#xBC1C; &#xC0AC;&#xC774;&#xC758; &#xADE0;&#xD615;&#xC744; &#xC120;&#xD0DD;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>Startups also recognize the power of community. For them, the open source pro&#x2010; cesses are a multiplier for their limited, precious resource of developer time.</p>
<p>&#xC2A4;&#xD0C0;&#xD2B8;&#xC5C5;&#xB4E4;&#xB3C4; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC758; &#xD798;&#xC744; &#xC778;&#xC2DD;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB4E4;&#xC5D0;&#xAC8C; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xC790;&#xC2E0;&#xB4E4;&#xC774; &#xD22C;&#xC785;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xC2DC;&#xAC04;&#xC774;&#xB780; &#xC81C;&#xD55C;&#xB41C; &#xC790;&#xC0B0;&#xC744; &#xBA87; &#xBC30;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC8FC;&#xB294; &#xB3C4;&#xAD6C;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>Similar principles apply in other areas of creative production (although each type differs in the details): open source hardware such as <a href="https://www.arduino.cc" target="_blank">Arduino</a>, artwork released under some <a href="https://creativecommons.org" target="_blank">Creative Commons licenses</a>, data provided under an <a href="https://opendatacommons.org/" target="_blank">open license</a>, open standards (such as the Open Standards principles <a href="https://www.gov.uk/government/publications/open-standards-principles/open-standards-principles" target="_blank">defined by the UK government</a>, information provided through an open license by <a href="https://open.canada.ca/en/open-government-licence-canada" target="_blank">governments</a>, and so on.</p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC6D0;&#xB9AC;&#xB294; &#xC138;&#xBD80;&#xC801;&#xC778; &#xB0B4;&#xC6A9;&#xC774; &#xC870;&#xAE08; &#xB2E4;&#xB978; &#xD615;&#xD0DC;&#xC774;&#xAE30;&#xB294; &#xD558;&#xC9C0;&#xB9CC; <a href="https://www.arduino.cc" target="_blank">Arduino</a>&#xC640; &#xAC19;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;, <a href="https://creativecommons.org" target="_blank">Creative Commons &#xB77C;&#xC774;&#xC120;&#xC2A4;</a>&#xB85C; &#xACF5;&#xAC1C;&#xB41C; &#xC608;&#xC220; &#xC791;&#xD488;&#xB4E4;, <a href="https://opendatacommons.org/" target="_blank">&#xC624;&#xD508; &#xB77C;&#xC774;&#xC120;&#xC2A4;</a>&#xB85C; &#xC81C;&#xACF5;&#xB418;&#xB294; &#xB370;&#xC774;&#xD130;, <a href="https://www.gov.uk/government/publications/open-standards-principles/open-standards-principles" target="_blank">&#xC601;&#xAD6D; &#xC815;&#xBD80;&#xAC00; &#xC815;&#xC758;&#xD55C; &#xACF5;&#xAC1C; &#xD45C;&#xC900; &#xC6D0;&#xCE59;</a>&#xACFC; &#xAC19;&#xC740; &#xACF5;&#xAC1C; &#xD45C;&#xC900;, <a href="https://open.canada.ca/en/open-government-licence-canada" target="_blank">&#xC815;&#xBD80;</a>&#xAC00; &#xACF5;&#xAC1C; &#xB77C;&#xC774;&#xC120;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xC815;&#xBCF4; &#xB4F1;&#xC5D0;&#xB3C4; &#xC801;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. </p>
<p>Thus, open source software provides value across many fields. It&#x2019;s time to incorporate the best of open source tools and methods into your company strategy and culture, which will increase your competitive advantage.</p>
<p>&#xB530;&#xB77C;&#xC11C; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xB9CE;&#xC740; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xAC00;&#xCE58;&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C;&#xB294; &#xD68C;&#xC0AC;&#xC758; &#xC804;&#xB7B5;&#xACFC; &#xBB38;&#xD654;&#xC5D0; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xB3C4;&#xAD6C;&#xC640; &#xBC29;&#xBC95;&#xB860;&#xC744; &#xCD5C;&#xB300;&#xD55C; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xACBD;&#xC7C1; &#xC6B0;&#xC704;&#xB97C; &#xB192;&#xC77C; &#xB54C;&#xC785;&#xB2C8;&#xB2E4;. </p>
<p>Furthermore, adopting open source practices&#x2014;including InnerSource for soft&#x2010; ware you don&#x2019;t want to open to the world&#x2014;can make your organization more productive, your innovation faster-moving, your employees happier, and your decision-making more efficient. These are the extra gifts of open source you will come to appreciate during your journey.</p>
<p>&#xB610;&#xD55C; &#xC678;&#xBD80;&#xC5D0;&#xB294; &#xC624;&#xD508;&#xD558;&#xACE0; &#xC2F6;&#xC9C0; &#xC54A;&#xC740; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xB0B4;&#xBD80; &#xAC1C;&#xBC1C; &#xACFC;&#xC815;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xC5EC;, &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xAD00;&#xD589;&#xC744; &#xCC44;&#xD0DD;&#xD558;&#xBA74; &#xC870;&#xC9C1;&#xC758; &#xC0DD;&#xC0B0;&#xC131;&#xC744; &#xB192;&#xC774;&#xACE0; &#xD601;&#xC2E0;&#xC744; &#xBCF4;&#xB2E4; &#xBE60;&#xB974;&#xAC8C; &#xC218;&#xD589;&#xD558;&#xBA70; &#xC9C1;&#xC6D0;&#xB4E4;&#xC744; &#xB354; &#xD589;&#xBCF5;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4;&#xACE0; &#xC758;&#xC0AC; &#xACB0;&#xC815;&#xC744; &#xBCF4;&#xB2E4; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC7A5;&#xC810;&#xB4E4;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB85C; &#xB098;&#xC544;&#xAC00;&#xB294; &#xC5EC;&#xB7EC;&#xBD84;&#xB4E4;&#xC744; &#xC704;&#xD574; &#xC900;&#xBE44;&#xD55C; &#xC0AC;&#xC740;&#xD488; &#xAC19;&#xC740; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="11-open-source-and-the-cloud.html" class="navigation navigation-prev " aria-label="Previous page: 오픈소스와 클라우드">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="13-about-authors.html" class="navigation navigation-next " aria-label="Next page: 저자 소개">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"결어","level":"1.13","depth":1,"next":{"title":"저자 소개","level":"1.14","depth":1,"path":"src/13-about-authors.md","ref":"src/13-about-authors.md","articles":[]},"previous":{"title":"오픈소스와 클라우드","level":"1.12","depth":1,"path":"src/11-open-source-and-the-cloud.md","ref":"src/11-open-source-and-the-cloud.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"이민석 外","pdf.fontSize":14,"pdf.fontFamily":"NanumGothic","pdf.paperSize":"a5","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"기업에서의 오픈소스","language":"ko","gitbook":"*","description":"Zaheda Bhorat, Andy Oram의 저서 'Open Source in the Enterprise'의 한글 번역본. https://aws.amazon.com/opensource/enterprise-oss-book/","pdf.pageNumbers":true},"file":{"path":"src/12-conclusion.md","mtime":"2019-01-03T08:27:03.907Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-03T08:28:29.523Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

